[Killed] StringLiteral
src/lib/database.ts:10:32
 
 export class ObsidianDatabase {
   private pool: Pool;
-  private readonly tableName = "obsidian_chunks";
+  private readonly tableName = "";
   private readonly dimension = 768;
 
killedBy: ObsidianDatabase should have correct table name
statusReason: expected '' to be 'obsidian_chunks' // Object.is equality

[Killed] BlockStatement
src/lib/database.ts:13:41
   private readonly tableName = "obsidian_chunks";
   private readonly dimension = 768;
 
-  constructor(connectionString: string) {
-    this.pool = new Pool({
-      connectionString,
-      max: 10,
-      idleTimeoutMillis: 30000,
-      connectionTimeoutMillis: 2000,
-    });
-  }
+  constructor(connectionString: string) {}
 
   async initialize(): Promise<void> {
killedBy: ObsidianDatabase should initialize successfully
statusReason: Cannot read properties of undefined (reading 'end')

[NoCoverage] StringLiteral
src/lib/database.ts:26:26
     const client = await this.pool.connect();
     try {
       // Enable pgvector extension
-      await client.query("CREATE EXTENSION IF NOT EXISTS vector");
+      await client.query("");
 
       // Create table with exact dimension pinned

[NoCoverage] StringLiteral
src/lib/database.ts:41:26
       `);
 
       // Create HNSW index for fast ANN search
-      await client.query(`
-        CREATE INDEX IF NOT EXISTS ${this.tableName}_hnsw_idx 
-        ON ${this.tableName} 
-        USING hnsw (v vector_cosine_ops)
-      `);
+      await client.query(``);
 
       // Create indexes on Obsidian-specific metadata

[NoCoverage] StringLiteral
src/lib/database.ts:60:26
         USING BTREE ((meta->>'contentType'))
       `);
 
-      await client.query(`
-        CREATE INDEX IF NOT EXISTS ${this.tableName}_tags_idx 
-        ON ${this.tableName} 
-        USING GIN ((meta->'obsidianFile'->'tags'))
-      `);
+      await client.query(``);
 
       await client.query(`

[NoCoverage] StringLiteral
src/lib/database.ts:66:26
         USING GIN ((meta->'obsidianFile'->'tags'))
       `);
 
-      await client.query(`
-        CREATE INDEX IF NOT EXISTS ${this.tableName}_updated_at_idx 
-        ON ${this.tableName} 
-        USING BTREE ((meta->>'updatedAt'))
-      `);
+      await client.query(``);
 
       console.log(

[NoCoverage] BlockStatement
src/lib/database.ts:75:15
       console.log(
         `✅ Obsidian database initialized with table ${this.tableName}`
       );
-    } finally {
-      client.release();
-    }
+    } finally {}
   }
 

[Killed] ConditionalExpression
src/lib/database.ts:81:29
   }
 
   async upsertChunk(chunk: DocumentChunk): Promise<void> {
-    if (!chunk.embedding || chunk.embedding.length !== this.dimension) {
+    if (!chunk.embedding || false) {
       throw new Error(
         `Embedding dimension mismatch: expected ${this.dimension}, got ${
killedBy: ObsidianDatabase upsertChunk should reject chunks with wrong embedding dimension
statusReason: expected [Function] to throw error including 'Embedding dimension mismatch' but got 'role "postgres" does not exist'

[Killed] LogicalOperator
src/lib/database.ts:81:9
   }
 
   async upsertChunk(chunk: DocumentChunk): Promise<void> {
-    if (!chunk.embedding || chunk.embedding.length !== this.dimension) {
+    if (!chunk.embedding && chunk.embedding.length !== this.dimension) {
       throw new Error(
         `Embedding dimension mismatch: expected ${this.dimension}, got ${
killedBy: ObsidianDatabase upsertChunk should reject chunks with wrong embedding dimension
statusReason: expected [Function] to throw error including 'Embedding dimension mismatch' but got 'role "postgres" does not exist'

[Killed] StringLiteral
src/lib/database.ts:83:9
   async upsertChunk(chunk: DocumentChunk): Promise<void> {
     if (!chunk.embedding || chunk.embedding.length !== this.dimension) {
       throw new Error(
-        `Embedding dimension mismatch: expected ${this.dimension}, got ${
-          chunk.embedding?.length || 0
-        }`
+        ``
       );
     }
killedBy: ObsidianDatabase upsertChunk should reject chunks with wrong embedding dimension
statusReason: expected [Function] to throw error including 'Embedding dimension mismatch' but got ''

[Killed] OptionalChaining
src/lib/database.ts:84:11
     if (!chunk.embedding || chunk.embedding.length !== this.dimension) {
       throw new Error(
         `Embedding dimension mismatch: expected ${this.dimension}, got ${
-          chunk.embedding?.length || 0
+          chunk.embedding.length || 0
         }`
       );
killedBy: ObsidianDatabase upsertChunk should reject chunks with null embedding
statusReason: expected [Function] to throw error including 'Embedding dimension mismatch' but got 'Cannot read properties of null (readi…'

[Survived] ConditionalExpression
src/lib/database.ts:84:11
     if (!chunk.embedding || chunk.embedding.length !== this.dimension) {
       throw new Error(
         `Embedding dimension mismatch: expected ${this.dimension}, got ${
-          chunk.embedding?.length || 0
+          false
         }`
       );

[NoCoverage] BlockStatement
src/lib/database.ts:90:9
     }
 
     const client = await this.pool.connect();
-    try {
-      const vectorLiteral = `'[${chunk.embedding.join(",")}]'`;
-
-      await client.query(
-        `
-        INSERT INTO ${this.tableName} (id, text, meta, v, updated_at)
-        VALUES ($1, $2, $3::jsonb, ${vectorLiteral}::vector, NOW())
-        ON CONFLICT (id) DO UPDATE SET 
-          text = EXCLUDED.text,
-          meta = EXCLUDED.meta,
-          v = EXCLUDED.v,
-          updated_at = NOW()
-      `,
-        [chunk.id, chunk.text, JSON.stringify(chunk.meta)]
-      );
-    } finally {
+    try {} finally {
       client.release();
     }

[NoCoverage] StringLiteral
src/lib/database.ts:91:55
 
     const client = await this.pool.connect();
     try {
-      const vectorLiteral = `'[${chunk.embedding.join(",")}]'`;
+      const vectorLiteral = `'[${chunk.embedding.join("")}]'`;
 
       await client.query(

[NoCoverage] StringLiteral
src/lib/database.ts:94:9
       const vectorLiteral = `'[${chunk.embedding.join(",")}]'`;
 
       await client.query(
-        `
-        INSERT INTO ${this.tableName} (id, text, meta, v, updated_at)
-        VALUES ($1, $2, $3::jsonb, ${vectorLiteral}::vector, NOW())
-        ON CONFLICT (id) DO UPDATE SET 
-          text = EXCLUDED.text,
-          meta = EXCLUDED.meta,
-          v = EXCLUDED.v,
-          updated_at = NOW()
-      `,
+        ``,
         [chunk.id, chunk.text, JSON.stringify(chunk.meta)]
       );

[NoCoverage] ArrayDeclaration
src/lib/database.ts:103:9
           v = EXCLUDED.v,
           updated_at = NOW()
       `,
-        [chunk.id, chunk.text, JSON.stringify(chunk.meta)]
+        []
       );
     } finally {

[Survived] BlockStatement
src/lib/database.ts:110:67
     }
   }
 
-  async batchUpsertChunks(chunks: DocumentChunk[]): Promise<void> {
-    if (chunks.length === 0) return;
-
-    const client = await this.pool.connect();
-    try {
-      await client.query("BEGIN");
-
-      for (const chunk of chunks) {
-        await this.upsertChunk(chunk);
-      }
-
-      await client.query("COMMIT");
-      console.log(`✅ Upserted ${chunks.length} chunks`);
-    } catch (error) {
-      await client.query("ROLLBACK");
-      throw error;
-    } finally {
-      client.release();
-    }
-  }
+  async batchUpsertChunks(chunks: DocumentChunk[]): Promise<void> {}
 
   async search(

[Killed] ConditionalExpression
src/lib/database.ts:111:9
   }
 
   async batchUpsertChunks(chunks: DocumentChunk[]): Promise<void> {
-    if (chunks.length === 0) return;
+    if (false) return;
 
     const client = await this.pool.connect();
killedBy: ObsidianDatabase batchUpsertChunks should handle empty batch
statusReason: promise rejected "error: role "postgres" does not exist { …(15) }" instead of resolving

[Killed] EqualityOperator
src/lib/database.ts:111:9
   }
 
   async batchUpsertChunks(chunks: DocumentChunk[]): Promise<void> {
-    if (chunks.length === 0) return;
+    if (chunks.length !== 0) return;
 
     const client = await this.pool.connect();
killedBy: ObsidianDatabase batchUpsertChunks should handle empty batch
statusReason: promise rejected "error: role "postgres" does not exist { …(15) }" instead of resolving

[NoCoverage] BlockStatement
src/lib/database.ts:114:9
     if (chunks.length === 0) return;
 
     const client = await this.pool.connect();
-    try {
-      await client.query("BEGIN");
-
-      for (const chunk of chunks) {
-        await this.upsertChunk(chunk);
-      }
-
-      await client.query("COMMIT");
-      console.log(`✅ Upserted ${chunks.length} chunks`);
-    } catch (error) {
+    try {} catch (error) {
       await client.query("ROLLBACK");
       throw error;

[NoCoverage] BlockStatement
src/lib/database.ts:117:35
     try {
       await client.query("BEGIN");
 
-      for (const chunk of chunks) {
-        await this.upsertChunk(chunk);
-      }
+      for (const chunk of chunks) {}
 
       await client.query("COMMIT");

[NoCoverage] BlockStatement
src/lib/database.ts:123:21
 
       await client.query("COMMIT");
       console.log(`✅ Upserted ${chunks.length} chunks`);
-    } catch (error) {
-      await client.query("ROLLBACK");
-      throw error;
-    } finally {
+    } catch (error) {} finally {
       client.release();
     }

[NoCoverage] BlockStatement
src/lib/database.ts:126:15
     } catch (error) {
       await client.query("ROLLBACK");
       throw error;
-    } finally {
-      client.release();
-    }
+    } finally {}
   }
 

[Killed] EqualityOperator
src/lib/database.ts:143:9
       minSimilarity?: number;
     } = {}
   ): Promise<SearchResult[]> {
-    if (queryEmbedding.length !== this.dimension) {
+    if (queryEmbedding.length === this.dimension) {
       throw new Error(
         `Query embedding dimension mismatch: expected ${this.dimension}, got ${queryEmbedding.length}`
killedBy: ObsidianDatabase search should search by embedding similarity
statusReason: Query embedding dimension mismatch: expected 768, got 768

[Killed] ConditionalExpression
src/lib/database.ts:143:9
       minSimilarity?: number;
     } = {}
   ): Promise<SearchResult[]> {
-    if (queryEmbedding.length !== this.dimension) {
+    if (true) {
       throw new Error(
         `Query embedding dimension mismatch: expected ${this.dimension}, got ${queryEmbedding.length}`
killedBy: ObsidianDatabase search should search by embedding similarity
statusReason: Query embedding dimension mismatch: expected 768, got 768

[NoCoverage] StringLiteral
src/lib/database.ts:153:25
     try {
       const vectorLiteral = `'[${queryEmbedding.join(",")}]'`;
 
-      let whereClause = "";
+      let whereClause = "Stryker was here!";
       const params: any[] = [limit];
       let paramIndex = 2;

[NoCoverage] ArrayDeclaration
src/lib/database.ts:154:29
       const vectorLiteral = `'[${queryEmbedding.join(",")}]'`;
 
       let whereClause = "";
-      const params: any[] = [limit];
+      const params: any[] = [];
       let paramIndex = 2;
 

[NoCoverage] LogicalOperator
src/lib/database.ts:158:11
       let paramIndex = 2;
 
       // File type filter
-      if (options.fileTypes && options.fileTypes.length > 0) {
+      if (options.fileTypes || options.fileTypes.length > 0) {
         whereClause += ` WHERE meta->>'contentType' = ANY($${paramIndex})`;
         params.push(options.fileTypes);

[NoCoverage] EqualityOperator
src/lib/database.ts:158:32
       let paramIndex = 2;
 
       // File type filter
-      if (options.fileTypes && options.fileTypes.length > 0) {
+      if (options.fileTypes && options.fileTypes.length >= 0) {
         whereClause += ` WHERE meta->>'contentType' = ANY($${paramIndex})`;
         params.push(options.fileTypes);

[NoCoverage] UpdateOperator
src/lib/database.ts:161:9
       if (options.fileTypes && options.fileTypes.length > 0) {
         whereClause += ` WHERE meta->>'contentType' = ANY($${paramIndex})`;
         params.push(options.fileTypes);
-        paramIndex++;
+        paramIndex--;
       }
 

[NoCoverage] LogicalOperator
src/lib/database.ts:165:11
       }
 
       // Tags filter
-      if (options.tags && options.tags.length > 0) {
+      if (options.tags || options.tags.length > 0) {
         const prefix = whereClause ? " AND " : " WHERE ";
         whereClause += `${prefix} meta->'obsidianFile'->'tags' ?| $${paramIndex}`;

[NoCoverage] EqualityOperator
src/lib/database.ts:165:27
       }
 
       // Tags filter
-      if (options.tags && options.tags.length > 0) {
+      if (options.tags && options.tags.length <= 0) {
         const prefix = whereClause ? " AND " : " WHERE ";
         whereClause += `${prefix} meta->'obsidianFile'->'tags' ?| $${paramIndex}`;

[NoCoverage] StringLiteral
src/lib/database.ts:166:48
 
       // Tags filter
       if (options.tags && options.tags.length > 0) {
-        const prefix = whereClause ? " AND " : " WHERE ";
+        const prefix = whereClause ? " AND " : "";
         whereClause += `${prefix} meta->'obsidianFile'->'tags' ?| $${paramIndex}`;
         params.push(options.tags);

[NoCoverage] UpdateOperator
src/lib/database.ts:169:9
         const prefix = whereClause ? " AND " : " WHERE ";
         whereClause += `${prefix} meta->'obsidianFile'->'tags' ?| $${paramIndex}`;
         params.push(options.tags);
-        paramIndex++;
+        paramIndex--;
       }
 

[NoCoverage] BlockStatement
src/lib/database.ts:173:58
       }
 
       // Folders filter
-      if (options.folders && options.folders.length > 0) {
-        const prefix = whereClause ? " AND " : " WHERE ";
-        whereClause += `${prefix} (`;
-        const folderConditions = options.folders.map((_, i) => {
-          const currentParam = paramIndex + i;
-          return `meta->'obsidianFile'->>'filePath' LIKE $${currentParam}`;
-        });
-        whereClause += folderConditions.join(" OR ");
-        whereClause += ")";
-
-        options.folders.forEach((folder) => {
-          params.push(`%${folder}%`);
-        });
-        paramIndex += options.folders.length;
-      }
+      if (options.folders && options.folders.length > 0) {}
 
       // Wikilinks filter

[NoCoverage] ConditionalExpression
src/lib/database.ts:173:11
       }
 
       // Folders filter
-      if (options.folders && options.folders.length > 0) {
+      if (true) {
         const prefix = whereClause ? " AND " : " WHERE ";
         whereClause += `${prefix} (`;

[NoCoverage] StringLiteral
src/lib/database.ts:174:48
 
       // Folders filter
       if (options.folders && options.folders.length > 0) {
-        const prefix = whereClause ? " AND " : " WHERE ";
+        const prefix = whereClause ? " AND " : "";
         whereClause += `${prefix} (`;
         const folderConditions = options.folders.map((_, i) => {

[NoCoverage] BlockStatement
src/lib/database.ts:176:64
       if (options.folders && options.folders.length > 0) {
         const prefix = whereClause ? " AND " : " WHERE ";
         whereClause += `${prefix} (`;
-        const folderConditions = options.folders.map((_, i) => {
-          const currentParam = paramIndex + i;
-          return `meta->'obsidianFile'->>'filePath' LIKE $${currentParam}`;
-        });
+        const folderConditions = options.folders.map((_, i) => {});
         whereClause += folderConditions.join(" OR ");
         whereClause += ")";

[NoCoverage] ArithmeticOperator
src/lib/database.ts:177:32
         const prefix = whereClause ? " AND " : " WHERE ";
         whereClause += `${prefix} (`;
         const folderConditions = options.folders.map((_, i) => {
-          const currentParam = paramIndex + i;
+          const currentParam = paramIndex - i;
           return `meta->'obsidianFile'->>'filePath' LIKE $${currentParam}`;
         });

[NoCoverage] AssignmentOperator
src/lib/database.ts:180:9
           const currentParam = paramIndex + i;
           return `meta->'obsidianFile'->>'filePath' LIKE $${currentParam}`;
         });
-        whereClause += folderConditions.join(" OR ");
+        whereClause -= folderConditions.join(" OR ");
         whereClause += ")";
 

[NoCoverage] BlockStatement
src/lib/database.ts:183:45
         whereClause += folderConditions.join(" OR ");
         whereClause += ")";
 
-        options.folders.forEach((folder) => {
-          params.push(`%${folder}%`);
-        });
+        options.folders.forEach((folder) => {});
         paramIndex += options.folders.length;
       }

[NoCoverage] AssignmentOperator
src/lib/database.ts:186:9
         options.folders.forEach((folder) => {
           params.push(`%${folder}%`);
         });
-        paramIndex += options.folders.length;
+        paramIndex -= options.folders.length;
       }
 

[NoCoverage] BlockStatement
src/lib/database.ts:190:47
       }
 
       // Wikilinks filter
-      if (options.hasWikilinks !== undefined) {
-        const prefix = whereClause ? " AND " : " WHERE ";
-        if (options.hasWikilinks) {
-          whereClause += `${prefix} jsonb_array_length(meta->'obsidianFile'->'wikilinks') > 0`;
-        } else {
-          whereClause += `${prefix} (meta->'obsidianFile'->'wikilinks' IS NULL OR jsonb_array_length(meta->'obsidianFile'->'wikilinks') = 0)`;
-        }
-      }
+      if (options.hasWikilinks !== undefined) {}
 
       // Date range filter

[NoCoverage] EqualityOperator
src/lib/database.ts:190:11
       }
 
       // Wikilinks filter
-      if (options.hasWikilinks !== undefined) {
+      if (options.hasWikilinks === undefined) {
         const prefix = whereClause ? " AND " : " WHERE ";
         if (options.hasWikilinks) {

[NoCoverage] ConditionalExpression
src/lib/database.ts:192:13
       // Wikilinks filter
       if (options.hasWikilinks !== undefined) {
         const prefix = whereClause ? " AND " : " WHERE ";
-        if (options.hasWikilinks) {
+        if (false) {
           whereClause += `${prefix} jsonb_array_length(meta->'obsidianFile'->'wikilinks') > 0`;
         } else {

[NoCoverage] ConditionalExpression
src/lib/database.ts:192:13
       // Wikilinks filter
       if (options.hasWikilinks !== undefined) {
         const prefix = whereClause ? " AND " : " WHERE ";
-        if (options.hasWikilinks) {
+        if (true) {
           whereClause += `${prefix} jsonb_array_length(meta->'obsidianFile'->'wikilinks') > 0`;
         } else {

[NoCoverage] StringLiteral
src/lib/database.ts:193:26
       if (options.hasWikilinks !== undefined) {
         const prefix = whereClause ? " AND " : " WHERE ";
         if (options.hasWikilinks) {
-          whereClause += `${prefix} jsonb_array_length(meta->'obsidianFile'->'wikilinks') > 0`;
+          whereClause += ``;
         } else {
           whereClause += `${prefix} (meta->'obsidianFile'->'wikilinks' IS NULL OR jsonb_array_length(meta->'obsidianFile'->'wikilinks') = 0)`;

[NoCoverage] BlockStatement
src/lib/database.ts:194:16
         const prefix = whereClause ? " AND " : " WHERE ";
         if (options.hasWikilinks) {
           whereClause += `${prefix} jsonb_array_length(meta->'obsidianFile'->'wikilinks') > 0`;
-        } else {
-          whereClause += `${prefix} (meta->'obsidianFile'->'wikilinks' IS NULL OR jsonb_array_length(meta->'obsidianFile'->'wikilinks') = 0)`;
-        }
+        } else {}
       }
 

[NoCoverage] StringLiteral
src/lib/database.ts:195:26
         if (options.hasWikilinks) {
           whereClause += `${prefix} jsonb_array_length(meta->'obsidianFile'->'wikilinks') > 0`;
         } else {
-          whereClause += `${prefix} (meta->'obsidianFile'->'wikilinks' IS NULL OR jsonb_array_length(meta->'obsidianFile'->'wikilinks') = 0)`;
+          whereClause += ``;
         }
       }

[NoCoverage] ConditionalExpression
src/lib/database.ts:200:11
       }
 
       // Date range filter
-      if (options.dateRange) {
+      if (false) {
         if (options.dateRange.start) {
           const prefix = whereClause ? " AND " : " WHERE ";

[NoCoverage] ConditionalExpression
src/lib/database.ts:200:11
       }
 
       // Date range filter
-      if (options.dateRange) {
+      if (true) {
         if (options.dateRange.start) {
           const prefix = whereClause ? " AND " : " WHERE ";

[NoCoverage] BlockStatement
src/lib/database.ts:201:38
 
       // Date range filter
       if (options.dateRange) {
-        if (options.dateRange.start) {
-          const prefix = whereClause ? " AND " : " WHERE ";
-          whereClause += `${prefix} (meta->>'updatedAt')::timestamp >= $${paramIndex}`;
-          params.push(options.dateRange.start.toISOString());
-          paramIndex++;
-        }
+        if (options.dateRange.start) {}
         if (options.dateRange.end) {
           const prefix = whereClause ? " AND " : " WHERE ";

[NoCoverage] ConditionalExpression
src/lib/database.ts:201:13
 
       // Date range filter
       if (options.dateRange) {
-        if (options.dateRange.start) {
+        if (true) {
           const prefix = whereClause ? " AND " : " WHERE ";
           whereClause += `${prefix} (meta->>'updatedAt')::timestamp >= $${paramIndex}`;

[NoCoverage] UpdateOperator
src/lib/database.ts:205:11
           const prefix = whereClause ? " AND " : " WHERE ";
           whereClause += `${prefix} (meta->>'updatedAt')::timestamp >= $${paramIndex}`;
           params.push(options.dateRange.start.toISOString());
-          paramIndex++;
+          paramIndex--;
         }
         if (options.dateRange.end) {

[NoCoverage] BlockStatement
src/lib/database.ts:207:36
           params.push(options.dateRange.start.toISOString());
           paramIndex++;
         }
-        if (options.dateRange.end) {
-          const prefix = whereClause ? " AND " : " WHERE ";
-          whereClause += `${prefix} (meta->>'updatedAt')::timestamp <= $${paramIndex}`;
-          params.push(options.dateRange.end.toISOString());
-          paramIndex++;
-        }
+        if (options.dateRange.end) {}
       }
 

[NoCoverage] ConditionalExpression
src/lib/database.ts:207:13
           params.push(options.dateRange.start.toISOString());
           paramIndex++;
         }
-        if (options.dateRange.end) {
+        if (true) {
           const prefix = whereClause ? " AND " : " WHERE ";
           whereClause += `${prefix} (meta->>'updatedAt')::timestamp <= $${paramIndex}`;

[NoCoverage] StringLiteral
src/lib/database.ts:208:40
           paramIndex++;
         }
         if (options.dateRange.end) {
-          const prefix = whereClause ? " AND " : " WHERE ";
+          const prefix = whereClause ? "" : " WHERE ";
           whereClause += `${prefix} (meta->>'updatedAt')::timestamp <= $${paramIndex}`;
           params.push(options.dateRange.end.toISOString());

[NoCoverage] StringLiteral
src/lib/database.ts:208:50
           paramIndex++;
         }
         if (options.dateRange.end) {
-          const prefix = whereClause ? " AND " : " WHERE ";
+          const prefix = whereClause ? " AND " : "";
           whereClause += `${prefix} (meta->>'updatedAt')::timestamp <= $${paramIndex}`;
           params.push(options.dateRange.end.toISOString());

[NoCoverage] UpdateOperator
src/lib/database.ts:211:11
           const prefix = whereClause ? " AND " : " WHERE ";
           whereClause += `${prefix} (meta->>'updatedAt')::timestamp <= $${paramIndex}`;
           params.push(options.dateRange.end.toISOString());
-          paramIndex++;
+          paramIndex--;
         }
       }

[NoCoverage] ArrowFunction
src/lib/database.ts:229:37
 
       const result = await client.query(query, params);
 
-      let results = result.rows.map((row, index) => ({
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-        cosineSimilarity: parseFloat(row.cosine_similarity),
-        rank: index + 1,
-      }));
+      let results = result.rows.map(() => undefined);
 
       // Apply minimum similarity filter if specified

[NoCoverage] ObjectLiteral
src/lib/database.ts:229:54
 
       const result = await client.query(query, params);
 
-      let results = result.rows.map((row, index) => ({
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-        cosineSimilarity: parseFloat(row.cosine_similarity),
-        rank: index + 1,
-      }));
+      let results = result.rows.map((row, index) => ({}));
 
       // Apply minimum similarity filter if specified

[NoCoverage] ArithmeticOperator
src/lib/database.ts:234:15
         text: row.text,
         meta: row.meta as DocumentMetadata,
         cosineSimilarity: parseFloat(row.cosine_similarity),
-        rank: index + 1,
+        rank: index - 1,
       }));
 

[NoCoverage] ConditionalExpression
src/lib/database.ts:238:11
       }));
 
       // Apply minimum similarity filter if specified
-      if (options.minSimilarity) {
+      if (false) {
         results = results.filter(
           (r) => r.cosineSimilarity >= options.minSimilarity!

[NoCoverage] ConditionalExpression
src/lib/database.ts:238:11
       }));
 
       // Apply minimum similarity filter if specified
-      if (options.minSimilarity) {
+      if (true) {
         results = results.filter(
           (r) => r.cosineSimilarity >= options.minSimilarity!

[NoCoverage] MethodExpression
src/lib/database.ts:239:19
 
       // Apply minimum similarity filter if specified
       if (options.minSimilarity) {
-        results = results.filter(
-          (r) => r.cosineSimilarity >= options.minSimilarity!
-        );
+        results = results;
       }
 

[NoCoverage] ConditionalExpression
src/lib/database.ts:240:18
       // Apply minimum similarity filter if specified
       if (options.minSimilarity) {
         results = results.filter(
-          (r) => r.cosineSimilarity >= options.minSimilarity!
+          (r) => false
         );
       }

[NoCoverage] EqualityOperator
src/lib/database.ts:240:18
       // Apply minimum similarity filter if specified
       if (options.minSimilarity) {
         results = results.filter(
-          (r) => r.cosineSimilarity >= options.minSimilarity!
+          (r) => r.cosineSimilarity > options.minSimilarity!
         );
       }

[NoCoverage] BlockStatement
src/lib/database.ts:245:15
       }
 
       return results;
-    } finally {
-      client.release();
-    }
+    } finally {}
   }
 

[Killed] BlockStatement
src/lib/database.ts:250:65
     }
   }
 
-  async getChunkById(id: string): Promise<DocumentChunk | null> {
-    const client = await this.pool.connect();
-    try {
-      const result = await client.query(
-        `
-        SELECT id, text, meta FROM ${this.tableName} WHERE id = $1
-      `,
-        [id]
-      );
-
-      if (result.rows.length === 0) return null;
-
-      const row = result.rows[0];
-      return {
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-      };
-    } finally {
-      client.release();
-    }
-  }
+  async getChunkById(id: string): Promise<DocumentChunk | null> {}
 
   async getChunksByFile(fileName: string): Promise<DocumentChunk[]> {
killedBy: ObsidianDatabase getChunkById should return null for non-existent chunk
statusReason: expected undefined to be null

[NoCoverage] BlockStatement
src/lib/database.ts:252:9
 
   async getChunkById(id: string): Promise<DocumentChunk | null> {
     const client = await this.pool.connect();
-    try {
-      const result = await client.query(
-        `
-        SELECT id, text, meta FROM ${this.tableName} WHERE id = $1
-      `,
-        [id]
-      );
-
-      if (result.rows.length === 0) return null;
-
-      const row = result.rows[0];
-      return {
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-      };
-    } finally {
+    try {} finally {
       client.release();
     }

[NoCoverage] ConditionalExpression
src/lib/database.ts:260:11
         [id]
       );
 
-      if (result.rows.length === 0) return null;
+      if (false) return null;
 
       const row = result.rows[0];

[NoCoverage] EqualityOperator
src/lib/database.ts:260:11
         [id]
       );
 
-      if (result.rows.length === 0) return null;
+      if (result.rows.length !== 0) return null;
 
       const row = result.rows[0];

[NoCoverage] ObjectLiteral
src/lib/database.ts:263:14
       if (result.rows.length === 0) return null;
 
       const row = result.rows[0];
-      return {
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-      };
+      return {};
     } finally {
       client.release();

[NoCoverage] BlockStatement
src/lib/database.ts:268:15
         text: row.text,
         meta: row.meta as DocumentMetadata,
       };
-    } finally {
-      client.release();
-    }
+    } finally {}
   }
 

[Killed] BlockStatement
src/lib/database.ts:273:69
     }
   }
 
-  async getChunksByFile(fileName: string): Promise<DocumentChunk[]> {
-    const client = await this.pool.connect();
-    try {
-      const result = await client.query(
-        `
-        SELECT id, text, meta 
-        FROM ${this.tableName} 
-        WHERE meta->'obsidianFile'->>'fileName' = $1
-        ORDER BY (meta->>'chunkIndex')::int ASC
-        `,
-        [fileName]
-      );
-
-      return result.rows.map((row) => ({
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-      }));
-    } finally {
-      client.release();
-    }
-  }
+  async getChunksByFile(fileName: string): Promise<DocumentChunk[]> {}
 
   async getStats(): Promise<{
killedBy: ObsidianDatabase getChunksByFile should return empty array for file with no chunks
statusReason: expected undefined to deeply equal []
