[NoCoverage] BlockStatement
src/lib/database.ts:275:9
 
   async getChunksByFile(fileName: string): Promise<DocumentChunk[]> {
     const client = await this.pool.connect();
-    try {
-      const result = await client.query(
-        `
-        SELECT id, text, meta 
-        FROM ${this.tableName} 
-        WHERE meta->'obsidianFile'->>'fileName' = $1
-        ORDER BY (meta->>'chunkIndex')::int ASC
-        `,
-        [fileName]
-      );
-
-      return result.rows.map((row) => ({
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-      }));
-    } finally {
+    try {} finally {
       client.release();
     }

[NoCoverage] ArrayDeclaration
src/lib/database.ts:283:9
         WHERE meta->'obsidianFile'->>'fileName' = $1
         ORDER BY (meta->>'chunkIndex')::int ASC
         `,
-        [fileName]
+        []
       );
 

[NoCoverage] ArrowFunction
src/lib/database.ts:286:30
         [fileName]
       );
 
-      return result.rows.map((row) => ({
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-      }));
+      return result.rows.map(() => undefined);
     } finally {
       client.release();

[NoCoverage] ObjectLiteral
src/lib/database.ts:286:40
         [fileName]
       );
 
-      return result.rows.map((row) => ({
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-      }));
+      return result.rows.map((row) => ({}));
     } finally {
       client.release();

[NoCoverage] BlockStatement
src/lib/database.ts:291:15
         text: row.text,
         meta: row.meta as DocumentMetadata,
       }));
-    } finally {
-      client.release();
-    }
+    } finally {}
   }
 

[NoCoverage] StringLiteral
src/lib/database.ts:306:9
     try {
       // Total chunks
       const totalResult = await client.query(
-        `SELECT COUNT(*) as count FROM ${this.tableName}`
+        ``
       );
 

[NoCoverage] StringLiteral
src/lib/database.ts:317:47
       `);
 
       // By folder (extract from file path)
-      const folderResult = await client.query(`
-        SELECT 
-          CASE 
-            WHEN meta->'obsidianFile'->>'filePath' LIKE '%/%' 
-            THEN split_part(meta->'obsidianFile'->>'filePath', '/', 1)
-            ELSE 'Root'
-          END as folder,
-          COUNT(*) as count
-        FROM ${this.tableName}
-        GROUP BY folder
-      `);
+      const folderResult = await client.query(``);
 
       // Tag distribution (flatten tags array)

[NoCoverage] BlockStatement
src/lib/database.ts:342:40
       `);
 
       const byContentType: Record<string, number> = {};
-      typeResult.rows.forEach((row) => {
-        byContentType[row.content_type] = parseInt(row.count);
-      });
+      typeResult.rows.forEach((row) => {});
 
       const byFolder: Record<string, number> = {};

[NoCoverage] BlockStatement
src/lib/database.ts:347:42
       });
 
       const byFolder: Record<string, number> = {};
-      folderResult.rows.forEach((row) => {
-        byFolder[row.folder] = parseInt(row.count);
-      });
+      folderResult.rows.forEach((row) => {});
 
       const tagDistribution: Record<string, number> = {};

[NoCoverage] BlockStatement
src/lib/database.ts:352:39
       });
 
       const tagDistribution: Record<string, number> = {};
-      tagResult.rows.forEach((row) => {
-        tagDistribution[row.tag] = parseInt(row.count);
-      });
+      tagResult.rows.forEach((row) => {});
 
       return {

[NoCoverage] BlockStatement
src/lib/database.ts:367:35
     }
   }
 
-  async clearAll(): Promise<void> {
-    const client = await this.pool.connect();
-    try {
-      await client.query(`DELETE FROM ${this.tableName}`);
-      console.log(`🗑️  Cleared all data from ${this.tableName}`);
-    } finally {
-      client.release();
-    }
-  }
+  async clearAll(): Promise<void> {}
 
   async deleteChunksByFile(fileName: string): Promise<void> {

[NoCoverage] BlockStatement
src/lib/database.ts:369:9
 
   async clearAll(): Promise<void> {
     const client = await this.pool.connect();
-    try {
-      await client.query(`DELETE FROM ${this.tableName}`);
-      console.log(`🗑️  Cleared all data from ${this.tableName}`);
-    } finally {
+    try {} finally {
       client.release();
     }

[NoCoverage] StringLiteral
src/lib/database.ts:371:19
     const client = await this.pool.connect();
     try {
       await client.query(`DELETE FROM ${this.tableName}`);
-      console.log(`🗑️  Cleared all data from ${this.tableName}`);
+      console.log(``;
     } finally {
       client.release();

[NoCoverage] BlockStatement
src/lib/database.ts:372:15
     try {
       await client.query(`DELETE FROM ${this.tableName}`);
       console.log(`🗑️  Cleared all data from ${this.tableName}`);
-    } finally {
-      client.release();
-    }
+    } finally {}
   }
 

[Survived] BlockStatement
src/lib/database.ts:377:61
     }
   }
 
-  async deleteChunksByFile(fileName: string): Promise<void> {
-    const client = await this.pool.connect();
-    try {
-      const result = await client.query(
-        `
-        DELETE FROM ${this.tableName}
-        WHERE meta->'obsidianFile'->>'fileName' = $1
-        `,
-        [fileName]
-      );
-
-      console.log(
-        `🗑️  Deleted ${result.rowCount} chunks for file: ${fileName}`
-      );
-    } finally {
-      client.release();
-    }
-  }
+  async deleteChunksByFile(fileName: string): Promise<void> {}
 
   async close(): Promise<void> {

[NoCoverage] BlockStatement
src/lib/database.ts:379:9
 
   async deleteChunksByFile(fileName: string): Promise<void> {
     const client = await this.pool.connect();
-    try {
-      const result = await client.query(
-        `
-        DELETE FROM ${this.tableName}
-        WHERE meta->'obsidianFile'->>'fileName' = $1
-        `,
-        [fileName]
-      );
-
-      console.log(
-        `🗑️  Deleted ${result.rowCount} chunks for file: ${fileName}`
-      );
-    } finally {
+    try {} finally {
       client.release();
     }

[Survived] BlockStatement
src/lib/database.ts:396:32
     }
   }
 
-  async close(): Promise<void> {
-    await this.pool.end();
-  }
+  async close(): Promise<void> {}
 }
 
