[NoCoverage] StringLiteral
src/lib/embeddings.ts:32:13
   // Obsidian-optimized embedding models
   private readonly models: EmbeddingModel[] = [
     {
-      name: "embeddinggemma",
+      name: "",
       dimension: 768,
       type: "semantic",

[NoCoverage] ArrayDeclaration
src/lib/embeddings.ts:36:18
       dimension: 768,
       type: "semantic",
       domain: "knowledge-base",
-      strengths: [
-        "Fast inference",
-        "Good for knowledge management",
-        "Handles markdown well",
-      ],
+      strengths: [],
       limitations: [
         "Limited domain knowledge",

[NoCoverage] StringLiteral
src/lib/embeddings.ts:38:9
       domain: "knowledge-base",
       strengths: [
         "Fast inference",
-        "Good for knowledge management",
+        "",
         "Handles markdown well",
       ],

[NoCoverage] ArrayDeclaration
src/lib/embeddings.ts:41:20
         "Good for knowledge management",
         "Handles markdown well",
       ],
-      limitations: [
-        "Limited domain knowledge",
-        "May not capture technical terms well",
-      ],
+      limitations: [],
     },
     {

[NoCoverage] StringLiteral
src/lib/embeddings.ts:43:9
       ],
       limitations: [
         "Limited domain knowledge",
-        "May not capture technical terms well",
+        "",
       ],
     },

[NoCoverage] StringLiteral
src/lib/embeddings.ts:49:13
     {
       name: "nomic-embed-text",
       dimension: 768,
-      type: "semantic",
+      type: "",
       domain: "general",
       strengths: [

[NoCoverage] ArrayDeclaration
src/lib/embeddings.ts:51:18
       dimension: 768,
       type: "semantic",
       domain: "general",
-      strengths: [
-        "Excellent for general text",
-        "Good performance on knowledge tasks",
-        "Handles long documents well",
-      ],
+      strengths: [],
       limitations: [
         "Larger model, slower inference",

[NoCoverage] ArrayDeclaration
src/lib/embeddings.ts:56:20
         "Good performance on knowledge tasks",
         "Handles long documents well",
       ],
-      limitations: [
-        "Larger model, slower inference",
-        "May be overkill for simple queries",
-      ],
+      limitations: [],
     },
   ];

[NoCoverage] StringLiteral
src/lib/embeddings.ts:57:9
         "Handles long documents well",
       ],
       limitations: [
-        "Larger model, slower inference",
+        "",
         "May be overkill for simple queries",
       ],

[NoCoverage] StringLiteral
src/lib/embeddings.ts:58:9
       ],
       limitations: [
         "Larger model, slower inference",
-        "May be overkill for simple queries",
+        "",
       ],
     },

[NoCoverage] BlockStatement
src/lib/embeddings.ts:63:40
     },
   ];
 
-  constructor(config: EmbeddingConfig) {
-    this.config = config;
-    this.strategy = this.createObsidianStrategy();
-  }
+  constructor(config: EmbeddingConfig) {}
 
   private createObsidianStrategy(): EmbeddingStrategy {

[NoCoverage] BlockStatement
src/lib/embeddings.ts:68:55
     this.strategy = this.createObsidianStrategy();
   }
 
-  private createObsidianStrategy(): EmbeddingStrategy {
-    return {
-      primaryModel:
-        this.models.find((m) => m.name === this.config.model) || this.models[0],
-      fallbackModels: this.models.filter((m) => m.name !== this.config.model),
-      contentTypeOverrides: {
-        // Obsidian-specific content type optimizations
-        moc: this.models.find((m) => m.name === "embeddinggemma")!,
-        article: this.models.find((m) => m.name === "embeddinggemma")!,
-        conversation: this.models.find((m) => m.name === "embeddinggemma")!,
-        "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
-        note: this.models.find((m) => m.name === "embeddinggemma")!,
-      },
-      qualityThresholds: {
-        minSimilarity: 0.3,
-        maxResults: 30,
-      },
-    };
-  }
+  private createObsidianStrategy(): EmbeddingStrategy {}
 
   async embed(text: string): Promise<number[]> {

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:69:12
   }
 
   private createObsidianStrategy(): EmbeddingStrategy {
-    return {
-      primaryModel:
-        this.models.find((m) => m.name === this.config.model) || this.models[0],
-      fallbackModels: this.models.filter((m) => m.name !== this.config.model),
-      contentTypeOverrides: {
-        // Obsidian-specific content type optimizations
-        moc: this.models.find((m) => m.name === "embeddinggemma")!,
-        article: this.models.find((m) => m.name === "embeddinggemma")!,
-        conversation: this.models.find((m) => m.name === "embeddinggemma")!,
-        "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
-        note: this.models.find((m) => m.name === "embeddinggemma")!,
-      },
-      qualityThresholds: {
-        minSimilarity: 0.3,
-        maxResults: 30,
-      },
-    };
+    return {};
   }
 

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:71:9
   private createObsidianStrategy(): EmbeddingStrategy {
     return {
       primaryModel:
-        this.models.find((m) => m.name === this.config.model) || this.models[0],
+        false,
       fallbackModels: this.models.filter((m) => m.name !== this.config.model),
       contentTypeOverrides: {

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:71:9
   private createObsidianStrategy(): EmbeddingStrategy {
     return {
       primaryModel:
-        this.models.find((m) => m.name === this.config.model) || this.models[0],
+        true,
       fallbackModels: this.models.filter((m) => m.name !== this.config.model),
       contentTypeOverrides: {

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:72:49
     return {
       primaryModel:
         this.models.find((m) => m.name === this.config.model) || this.models[0],
-      fallbackModels: this.models.filter((m) => m.name !== this.config.model),
+      fallbackModels: this.models.filter((m) => true),
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:72:49
     return {
       primaryModel:
         this.models.find((m) => m.name === this.config.model) || this.models[0],
-      fallbackModels: this.models.filter((m) => m.name !== this.config.model),
+      fallbackModels: this.models.filter((m) => m.name === this.config.model),
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:75:38
       fallbackModels: this.models.filter((m) => m.name !== this.config.model),
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations
-        moc: this.models.find((m) => m.name === "embeddinggemma")!,
+        moc: this.models.find((m) => false)!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,

[NoCoverage] ArrowFunction
src/lib/embeddings.ts:75:31
       fallbackModels: this.models.filter((m) => m.name !== this.config.model),
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations
-        moc: this.models.find((m) => m.name === "embeddinggemma")!,
+        moc: this.models.find(() => undefined)!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:76:42
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
-        article: this.models.find((m) => m.name === "embeddinggemma")!,
+        article: this.models.find((m) => m.name !== "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,

[NoCoverage] ArrowFunction
src/lib/embeddings.ts:76:35
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
-        article: this.models.find((m) => m.name === "embeddinggemma")!,
+        article: this.models.find(() => undefined)!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:77:47
         // Obsidian-specific content type optimizations
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
-        conversation: this.models.find((m) => m.name === "embeddinggemma")!,
+        conversation: this.models.find((m) => false)!,
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
         note: this.models.find((m) => m.name === "embeddinggemma")!,

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:77:47
         // Obsidian-specific content type optimizations
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
-        conversation: this.models.find((m) => m.name === "embeddinggemma")!,
+        conversation: this.models.find((m) => m.name !== "embeddinggemma")!,
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
         note: this.models.find((m) => m.name === "embeddinggemma")!,

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:78:46
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,
-        "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
+        "book-note": this.models.find((m) => m.name !== "embeddinggemma")!,
         note: this.models.find((m) => m.name === "embeddinggemma")!,
       },

[NoCoverage] ArrowFunction
src/lib/embeddings.ts:78:39
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,
-        "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
+        "book-note": this.models.find(() => undefined)!,
         note: this.models.find((m) => m.name === "embeddinggemma")!,
       },

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:79:39
         article: this.models.find((m) => m.name === "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
-        note: this.models.find((m) => m.name === "embeddinggemma")!,
+        note: this.models.find((m) => true)!,
       },
       qualityThresholds: {

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:79:39
         article: this.models.find((m) => m.name === "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
-        note: this.models.find((m) => m.name === "embeddinggemma")!,
+        note: this.models.find((m) => m.name !== "embeddinggemma")!,
       },
       qualityThresholds: {

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:81:26
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
         note: this.models.find((m) => m.name === "embeddinggemma")!,
       },
-      qualityThresholds: {
-        minSimilarity: 0.3,
-        maxResults: 30,
-      },
+      qualityThresholds: {},
     };
   }

[NoCoverage] StringLiteral
src/lib/embeddings.ts:92:22
     const normalizedText = normalize(text);
 
     // Check cache first
-    const cacheKey = `${this.config.model}:${normalizedText}`;
+    const cacheKey = ``;
     if (this.cache.has(cacheKey)) {
       return this.cache.get(cacheKey)!;

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:93:9
 
     // Check cache first
     const cacheKey = `${this.config.model}:${normalizedText}`;
-    if (this.cache.has(cacheKey)) {
+    if (false) {
       return this.cache.get(cacheKey)!;
     }

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:93:9
 
     // Check cache first
     const cacheKey = `${this.config.model}:${normalizedText}`;
-    if (this.cache.has(cacheKey)) {
+    if (true) {
       return this.cache.get(cacheKey)!;
     }

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:98:43
     }
 
     try {
-      const response = await ollama.embed({
-        model: this.config.model,
-        input: normalizedText,
-      });
+      const response = await ollama.embed({});
 
       if (!response.embeddings || response.embeddings.length === 0) {

[NoCoverage] LogicalOperator
src/lib/embeddings.ts:103:11
         input: normalizedText,
       });
 
-      if (!response.embeddings || response.embeddings.length === 0) {
+      if (!response.embeddings && response.embeddings.length === 0) {
         throw new Error("No embeddings returned from Ollama");
       }

[NoCoverage] BlockStatement
src/lib/embeddings.ts:103:69
         input: normalizedText,
       });
 
-      if (!response.embeddings || response.embeddings.length === 0) {
-        throw new Error("No embeddings returned from Ollama");
-      }
+      if (!response.embeddings || response.embeddings.length === 0) {}
 
       const embedding = response.embeddings[0];

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:110:11
       const embedding = response.embeddings[0];
 
       // Validate dimension
-      if (embedding.length !== this.config.dimension) {
+      if (false) {
         throw new Error(
           `Embedding dimension mismatch: expected ${this.config.dimension}, got ${embedding.length}`

[NoCoverage] BlockStatement
src/lib/embeddings.ts:110:55
       const embedding = response.embeddings[0];
 
       // Validate dimension
-      if (embedding.length !== this.config.dimension) {
-        throw new Error(
-          `Embedding dimension mismatch: expected ${this.config.dimension}, got ${embedding.length}`
-        );
-      }
+      if (embedding.length !== this.config.dimension) {}
 
       // Normalize the embedding vector for consistent cosine similarity scores

[NoCoverage] BlockStatement
src/lib/embeddings.ts:123:21
       this.cache.set(cacheKey, normalizedEmbedding);
 
       return normalizedEmbedding;
-    } catch (error) {
-      console.error(`❌ Failed to embed text: ${error}`);
-      throw new Error(`Embedding failed: ${error}`);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/lib/embeddings.ts:124:21
 
       return normalizedEmbedding;
     } catch (error) {
-      console.error(`❌ Failed to embed text: ${error}`);
+      console.error(``);
       throw new Error(`Embedding failed: ${error}`);
     }

[NoCoverage] BlockStatement
src/lib/embeddings.ts:129:73
     }
   }
 
-  async embedBatch(texts: string[], batchSize = 5): Promise<number[][]> {
-    const results: number[][] = [];
-
-    for (let i = 0; i < texts.length; i += batchSize) {
-      const batch = texts.slice(i, i + batchSize);
-      const promises = batch.map((text) => this.embed(text));
-      const batchResults = await Promise.all(promises);
-      results.push(...batchResults);
-
-      // Rate limiting - small delay between batches
-      if (i + batchSize < texts.length) {
-        await new Promise((resolve) => setTimeout(resolve, 100));
-      }
-    }
-
-    return results;
-  }
+  async embedBatch(texts: string[], batchSize = 5): Promise<number[][]> {}
 
   async embedWithStrategy(

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:132:21
   async embedBatch(texts: string[], batchSize = 5): Promise<number[][]> {
     const results: number[][] = [];
 
-    for (let i = 0; i < texts.length; i += batchSize) {
+    for (let i = 0; i >= texts.length; i += batchSize) {
       const batch = texts.slice(i, i + batchSize);
       const promises = batch.map((text) => this.embed(text));

[NoCoverage] BlockStatement
src/lib/embeddings.ts:132:55
   async embedBatch(texts: string[], batchSize = 5): Promise<number[][]> {
     const results: number[][] = [];
 
-    for (let i = 0; i < texts.length; i += batchSize) {
-      const batch = texts.slice(i, i + batchSize);
-      const promises = batch.map((text) => this.embed(text));
-      const batchResults = await Promise.all(promises);
-      results.push(...batchResults);
-
-      // Rate limiting - small delay between batches
-      if (i + batchSize < texts.length) {
-        await new Promise((resolve) => setTimeout(resolve, 100));
-      }
-    }
+    for (let i = 0; i < texts.length; i += batchSize) {}
 
     return results;

[NoCoverage] MethodExpression
src/lib/embeddings.ts:133:21
     const results: number[][] = [];
 
     for (let i = 0; i < texts.length; i += batchSize) {
-      const batch = texts.slice(i, i + batchSize);
+      const batch = texts;
       const promises = batch.map((text) => this.embed(text));
       const batchResults = await Promise.all(promises);

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:133:36
     const results: number[][] = [];
 
     for (let i = 0; i < texts.length; i += batchSize) {
-      const batch = texts.slice(i, i + batchSize);
+      const batch = texts.slice(i, i - batchSize);
       const promises = batch.map((text) => this.embed(text));
       const batchResults = await Promise.all(promises);

[NoCoverage] ArrowFunction
src/lib/embeddings.ts:134:34
 
     for (let i = 0; i < texts.length; i += batchSize) {
       const batch = texts.slice(i, i + batchSize);
-      const promises = batch.map((text) => this.embed(text));
+      const promises = batch.map(() => undefined);
       const batchResults = await Promise.all(promises);
       results.push(...batchResults);

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:139:11
       results.push(...batchResults);
 
       // Rate limiting - small delay between batches
-      if (i + batchSize < texts.length) {
+      if (false) {
         await new Promise((resolve) => setTimeout(resolve, 100));
       }

[NoCoverage] BlockStatement
src/lib/embeddings.ts:139:41
       results.push(...batchResults);
 
       // Rate limiting - small delay between batches
-      if (i + batchSize < texts.length) {
-        await new Promise((resolve) => setTimeout(resolve, 100));
-      }
+      if (i + batchSize < texts.length) {}
     }
 

[NoCoverage] ArrowFunction
src/lib/embeddings.ts:140:27
 
       // Rate limiting - small delay between batches
       if (i + batchSize < texts.length) {
-        await new Promise((resolve) => setTimeout(resolve, 100));
+        await new Promise(() => undefined);
       }
     }

[NoCoverage] BlockStatement
src/lib/embeddings.ts:163:35
 
     // Check cache with model-specific key
     const cacheKey = `${selectedModel.name}:${normalizedText}`;
-    if (this.cache.has(cacheKey)) {
-      return {
-        embedding: this.cache.get(cacheKey)!,
-        model: selectedModel,
-        confidence: 1.0, // Cached result
-      };
-    }
+    if (this.cache.has(cacheKey)) {}
 
     try {

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:163:9
 
     // Check cache with model-specific key
     const cacheKey = `${selectedModel.name}:${normalizedText}`;
-    if (this.cache.has(cacheKey)) {
+    if (true) {
       return {
         embedding: this.cache.get(cacheKey)!,

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:164:14
     // Check cache with model-specific key
     const cacheKey = `${selectedModel.name}:${normalizedText}`;
     if (this.cache.has(cacheKey)) {
-      return {
-        embedding: this.cache.get(cacheKey)!,
-        model: selectedModel,
-        confidence: 1.0, // Cached result
-      };
+      return {};
     }
 

[NoCoverage] BlockStatement
src/lib/embeddings.ts:171:9
       };
     }
 
-    try {
-      // Temporarily switch model if different from current
-      const originalModel = this.config.model;
-      this.config.model = selectedModel.name;
-
-      const embedding = await this.embedCore(normalizedText);
-
-      // Restore original model
-      this.config.model = originalModel;
-
-      // Cache with model-specific key
-      this.cache.set(cacheKey, embedding);
-
-      // Calculate confidence based on embedding quality metrics
-      const confidence = this.calculateEmbeddingConfidence(
-        embedding,
-        normalizedText
-      );
-
-      return {
-        embedding,
-        model: selectedModel,
-        confidence,
-      };
-    } catch (error) {
+    try {} catch (error) {
       console.warn(
         `Failed to embed with ${selectedModel.name}, trying fallback...`

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:190:14
         normalizedText
       );
 
-      return {
-        embedding,
-        model: selectedModel,
-        confidence,
-      };
+      return {};
     } catch (error) {
       console.warn(

[NoCoverage] StringLiteral
src/lib/embeddings.ts:197:9
       };
     } catch (error) {
       console.warn(
-        `Failed to embed with ${selectedModel.name}, trying fallback...`
+        ``
       );
 

[NoCoverage] BlockStatement
src/lib/embeddings.ts:201:65
       );
 
       // Try fallback models
-      for (const fallbackModel of this.strategy.fallbackModels) {
-        try {
-          const originalModel = this.config.model;
-          this.config.model = fallbackModel.name;
-
-          const embedding = await this.embedCore(normalizedText);
-          this.config.model = originalModel;
-
-          const confidence = this.calculateEmbeddingConfidence(
-            embedding,
-            normalizedText
-          );
-
-          return {
-            embedding,
-            model: fallbackModel,
-            confidence: confidence * 0.8, // Penalty for fallback
-          };
-        } catch (fallbackError) {
-          console.warn(`Fallback model ${fallbackModel.name} also failed`);
-        }
-      }
+      for (const fallbackModel of this.strategy.fallbackModels) {}
 
       throw new Error(

[NoCoverage] BlockStatement
src/lib/embeddings.ts:202:13
 
       // Try fallback models
       for (const fallbackModel of this.strategy.fallbackModels) {
-        try {
-          const originalModel = this.config.model;
-          this.config.model = fallbackModel.name;
-
-          const embedding = await this.embedCore(normalizedText);
-          this.config.model = originalModel;
-
-          const confidence = this.calculateEmbeddingConfidence(
-            embedding,
-            normalizedText
-          );
-
-          return {
-            embedding,
-            model: fallbackModel,
-            confidence: confidence * 0.8, // Penalty for fallback
-          };
-        } catch (fallbackError) {
+        try {} catch (fallbackError) {
           console.warn(`Fallback model ${fallbackModel.name} also failed`);
         }

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:214:18
             normalizedText
           );
 
-          return {
-            embedding,
-            model: fallbackModel,
-            confidence: confidence * 0.8, // Penalty for fallback
-          };
+          return {};
         } catch (fallbackError) {
           console.warn(`Fallback model ${fallbackModel.name} also failed`);

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:217:25
           return {
             embedding,
             model: fallbackModel,
-            confidence: confidence * 0.8, // Penalty for fallback
+            confidence: confidence / 0.8, // Penalty for fallback
           };
         } catch (fallbackError) {

[NoCoverage] BlockStatement
src/lib/embeddings.ts:219:33
             model: fallbackModel,
             confidence: confidence * 0.8, // Penalty for fallback
           };
-        } catch (fallbackError) {
-          console.warn(`Fallback model ${fallbackModel.name} also failed`);
-        }
+        } catch (fallbackError) {}
       }
 

[NoCoverage] MethodExpression
src/lib/embeddings.ts:225:50
       }
 
       throw new Error(
-        `All embedding models failed for text: ${normalizedText.slice(
-          0,
-          50
-        )}...`
+        `All embedding models failed for text: ${normalizedText}...`
       );
     }

[NoCoverage] BlockStatement
src/lib/embeddings.ts:236:21
   private selectModelForContent(
     contentType?: string,
     domainHint?: string
-  ): EmbeddingModel {
-    // Content-type specific overrides for Obsidian
-    if (contentType && this.strategy.contentTypeOverrides[contentType]) {
-      return this.strategy.contentTypeOverrides[contentType];
-    }
-
-    // Domain-specific selection
-    if (domainHint) {
-      const domainModel = this.models.find(
-        (m) => m.domain === domainHint || m.name.includes(domainHint)
-      );
-      if (domainModel) return domainModel;
-    }
-
-    // Default to primary model
-    return this.strategy.primaryModel;
-  }
+  ): EmbeddingModel {}
 
   private async embedCore(text: string): Promise<number[]> {

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:238:9
     domainHint?: string
   ): EmbeddingModel {
     // Content-type specific overrides for Obsidian
-    if (contentType && this.strategy.contentTypeOverrides[contentType]) {
+    if (false) {
       return this.strategy.contentTypeOverrides[contentType];
     }

[NoCoverage] BlockStatement
src/lib/embeddings.ts:238:73
     domainHint?: string
   ): EmbeddingModel {
     // Content-type specific overrides for Obsidian
-    if (contentType && this.strategy.contentTypeOverrides[contentType]) {
-      return this.strategy.contentTypeOverrides[contentType];
-    }
+    if (contentType && this.strategy.contentTypeOverrides[contentType]) {}
 
     // Domain-specific selection

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:243:9
     }
 
     // Domain-specific selection
-    if (domainHint) {
+    if (true) {
       const domainModel = this.models.find(
         (m) => m.domain === domainHint || m.name.includes(domainHint)

[NoCoverage] BlockStatement
src/lib/embeddings.ts:243:21
     }
 
     // Domain-specific selection
-    if (domainHint) {
-      const domainModel = this.models.find(
-        (m) => m.domain === domainHint || m.name.includes(domainHint)
-      );
-      if (domainModel) return domainModel;
-    }
+    if (domainHint) {}
 
     // Default to primary model

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:245:16
     // Domain-specific selection
     if (domainHint) {
       const domainModel = this.models.find(
-        (m) => m.domain === domainHint || m.name.includes(domainHint)
+        (m) => true
       );
       if (domainModel) return domainModel;

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:245:16
     // Domain-specific selection
     if (domainHint) {
       const domainModel = this.models.find(
-        (m) => m.domain === domainHint || m.name.includes(domainHint)
+        (m) => false
       );
       if (domainModel) return domainModel;

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:247:11
       const domainModel = this.models.find(
         (m) => m.domain === domainHint || m.name.includes(domainHint)
       );
-      if (domainModel) return domainModel;
+      if (false) return domainModel;
     }
 

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:247:11
       const domainModel = this.models.find(
         (m) => m.domain === domainHint || m.name.includes(domainHint)
       );
-      if (domainModel) return domainModel;
+      if (true) return domainModel;
     }
 

[NoCoverage] BlockStatement
src/lib/embeddings.ts:254:60
     return this.strategy.primaryModel;
   }
 
-  private async embedCore(text: string): Promise<number[]> {
-    const response = await ollama.embed({
-      model: this.config.model,
-      input: text,
-    });
-
-    if (!response.embeddings || response.embeddings.length === 0) {
-      throw new Error("No embeddings returned from Ollama");
-    }
-
-    const embedding = response.embeddings[0];
-
-    // Validate dimension (may vary by model)
-    if (embedding.length !== this.config.dimension) {
-      // Update config dimension if model uses different size
-      this.config.dimension = embedding.length;
-    }
-
-    return normalizeVector(embedding);
-  }
+  private async embedCore(text: string): Promise<number[]> {}
 
   private calculateEmbeddingConfidence(

[NoCoverage] BooleanLiteral
src/lib/embeddings.ts:260:9
       input: text,
     });
 
-    if (!response.embeddings || response.embeddings.length === 0) {
+    if (response.embeddings || response.embeddings.length === 0) {
       throw new Error("No embeddings returned from Ollama");
     }

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:260:33
       input: text,
     });
 
-    if (!response.embeddings || response.embeddings.length === 0) {
+    if (!response.embeddings || response.embeddings.length !== 0) {
       throw new Error("No embeddings returned from Ollama");
     }

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:267:9
     const embedding = response.embeddings[0];
 
     // Validate dimension (may vary by model)
-    if (embedding.length !== this.config.dimension) {
+    if (embedding.length === this.config.dimension) {
       // Update config dimension if model uses different size
       this.config.dimension = embedding.length;
