[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:267:9
     const embedding = response.embeddings[0];
 
     // Validate dimension (may vary by model)
-    if (embedding.length !== this.config.dimension) {
+    if (true) {
       // Update config dimension if model uses different size
       this.config.dimension = embedding.length;

[NoCoverage] BlockStatement
src/lib/embeddings.ts:278:13
   private calculateEmbeddingConfidence(
     embedding: number[],
     text: string
-  ): number {
-    // Simple confidence metric based on embedding properties
-    const magnitude = Math.sqrt(embedding.reduce((sum, x) => sum + x * x, 0));
-    const sparsity =
-      embedding.filter((x) => Math.abs(x) < 0.01).length / embedding.length;
-
-    // High magnitude and low sparsity indicate good embeddings
-    let confidence = Math.min(magnitude / 2.0, 1.0); // Normalized magnitude
-    confidence *= 1.0 - sparsity * 0.5; // Penalty for sparsity
-
-    // Boost confidence for Obsidian-specific content patterns
-    if (text.includes("[[") || text.includes("#")) {
-      confidence *= 1.1; // Boost for wikilinks and tags
-    }
-
-    return Math.max(0.1, Math.min(1.0, confidence));
-  }
+  ): number {}
 
   async testConnection(): Promise<{

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:280:62
     text: string
   ): number {
     // Simple confidence metric based on embedding properties
-    const magnitude = Math.sqrt(embedding.reduce((sum, x) => sum + x * x, 0));
+    const magnitude = Math.sqrt(embedding.reduce((sum, x) => sum - x * x, 0));
     const sparsity =
       embedding.filter((x) => Math.abs(x) < 0.01).length / embedding.length;

[NoCoverage] ArrowFunction
src/lib/embeddings.ts:280:50
     text: string
   ): number {
     // Simple confidence metric based on embedding properties
-    const magnitude = Math.sqrt(embedding.reduce((sum, x) => sum + x * x, 0));
+    const magnitude = Math.sqrt(embedding.reduce(() => undefined, 0));
     const sparsity =
       embedding.filter((x) => Math.abs(x) < 0.01).length / embedding.length;

[NoCoverage] MethodExpression
src/lib/embeddings.ts:282:7
     // Simple confidence metric based on embedding properties
     const magnitude = Math.sqrt(embedding.reduce((sum, x) => sum + x * x, 0));
     const sparsity =
-      embedding.filter((x) => Math.abs(x) < 0.01).length / embedding.length;
+      embedding.length / embedding.length;
 
     // High magnitude and low sparsity indicate good embeddings

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:282:7
     // Simple confidence metric based on embedding properties
     const magnitude = Math.sqrt(embedding.reduce((sum, x) => sum + x * x, 0));
     const sparsity =
-      embedding.filter((x) => Math.abs(x) < 0.01).length / embedding.length;
+      embedding.filter(x => Math.abs(x) < 0.01).length * embedding.length;
 
     // High magnitude and low sparsity indicate good embeddings

[NoCoverage] MethodExpression
src/lib/embeddings.ts:285:22
       embedding.filter((x) => Math.abs(x) < 0.01).length / embedding.length;
 
     // High magnitude and low sparsity indicate good embeddings
-    let confidence = Math.min(magnitude / 2.0, 1.0); // Normalized magnitude
+    let confidence = Math.max(magnitude / 2.0, 1.0); // Normalized magnitude
     confidence *= 1.0 - sparsity * 0.5; // Penalty for sparsity
 

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:285:31
       embedding.filter((x) => Math.abs(x) < 0.01).length / embedding.length;
 
     // High magnitude and low sparsity indicate good embeddings
-    let confidence = Math.min(magnitude / 2.0, 1.0); // Normalized magnitude
+    let confidence = Math.min(magnitude * 2.0, 1.0); // Normalized magnitude
     confidence *= 1.0 - sparsity * 0.5; // Penalty for sparsity
 

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:286:19
 
     // High magnitude and low sparsity indicate good embeddings
     let confidence = Math.min(magnitude / 2.0, 1.0); // Normalized magnitude
-    confidence *= 1.0 - sparsity * 0.5; // Penalty for sparsity
+    confidence *= 1.0 + sparsity * 0.5; // Penalty for sparsity
 
     // Boost confidence for Obsidian-specific content patterns

[NoCoverage] AssignmentOperator
src/lib/embeddings.ts:286:5
 
     // High magnitude and low sparsity indicate good embeddings
     let confidence = Math.min(magnitude / 2.0, 1.0); // Normalized magnitude
-    confidence *= 1.0 - sparsity * 0.5; // Penalty for sparsity
+    confidence /= 1.0 - sparsity * 0.5; // Penalty for sparsity
 
     // Boost confidence for Obsidian-specific content patterns

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:289:9
     confidence *= 1.0 - sparsity * 0.5; // Penalty for sparsity
 
     // Boost confidence for Obsidian-specific content patterns
-    if (text.includes("[[") || text.includes("#")) {
+    if (false) {
       confidence *= 1.1; // Boost for wikilinks and tags
     }

[NoCoverage] BlockStatement
src/lib/embeddings.ts:289:52
     confidence *= 1.0 - sparsity * 0.5; // Penalty for sparsity
 
     // Boost confidence for Obsidian-specific content patterns
-    if (text.includes("[[") || text.includes("#")) {
-      confidence *= 1.1; // Boost for wikilinks and tags
-    }
+    if (text.includes("[[") || text.includes("#")) {}
 
     return Math.max(0.1, Math.min(1.0, confidence));

[NoCoverage] AssignmentOperator
src/lib/embeddings.ts:290:7
 
     // Boost confidence for Obsidian-specific content patterns
     if (text.includes("[[") || text.includes("#")) {
-      confidence *= 1.1; // Boost for wikilinks and tags
+      confidence /= 1.1; // Boost for wikilinks and tags
     }
 

[NoCoverage] MethodExpression
src/lib/embeddings.ts:293:12
       confidence *= 1.1; // Boost for wikilinks and tags
     }
 
-    return Math.max(0.1, Math.min(1.0, confidence));
+    return Math.min(0.1, Math.min(1.0, confidence));
   }
 

[NoCoverage] MethodExpression
src/lib/embeddings.ts:293:26
       confidence *= 1.1; // Boost for wikilinks and tags
     }
 
-    return Math.max(0.1, Math.min(1.0, confidence));
+    return Math.max(0.1, Math.max(1.0, confidence));
   }
 

[NoCoverage] BlockStatement
src/lib/embeddings.ts:300:6
     success: boolean;
     dimension: number;
     model: string;
-  }> {
-    try {
-      const testText = "This is a test embedding for Obsidian knowledge base.";
-      const embedding = await this.embed(testText);
-
-      return {
-        success: true,
-        dimension: embedding.length,
-        model: this.config.model,
-      };
-    } catch (error) {
-      console.error(`❌ Embedding service test failed: ${error}`);
-      return {
-        success: false,
-        dimension: 0,
-        model: this.config.model,
-      };
-    }
-  }
+  }> {}
 
   clearCache(): void {

[NoCoverage] BlockStatement
src/lib/embeddings.ts:301:9
     dimension: number;
     model: string;
   }> {
-    try {
-      const testText = "This is a test embedding for Obsidian knowledge base.";
-      const embedding = await this.embed(testText);
-
-      return {
-        success: true,
-        dimension: embedding.length,
-        model: this.config.model,
-      };
-    } catch (error) {
+    try {} catch (error) {
       console.error(`❌ Embedding service test failed: ${error}`);
       return {

[NoCoverage] StringLiteral
src/lib/embeddings.ts:302:24
     model: string;
   }> {
     try {
-      const testText = "This is a test embedding for Obsidian knowledge base.";
+      const testText = "";
       const embedding = await this.embed(testText);
 

[NoCoverage] BlockStatement
src/lib/embeddings.ts:310:21
         dimension: embedding.length,
         model: this.config.model,
       };
-    } catch (error) {
-      console.error(`❌ Embedding service test failed: ${error}`);
-      return {
-        success: false,
-        dimension: 0,
-        model: this.config.model,
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/lib/embeddings.ts:320:22
     }
   }
 
-  clearCache(): void {
-    this.cache.clear();
-  }
+  clearCache(): void {}
 
   updateStrategy(newStrategy: Partial<EmbeddingStrategy>): void {

[NoCoverage] BlockStatement
src/lib/embeddings.ts:324:65
     this.cache.clear();
   }
 
-  updateStrategy(newStrategy: Partial<EmbeddingStrategy>): void {
-    this.strategy = { ...this.strategy, ...newStrategy };
-    console.log(`🔄 Updated embedding strategy:`, {
-      primary: this.strategy.primaryModel.name,
-      fallbacks: this.strategy.fallbackModels.map((m) => m.name),
-      overrides: Object.keys(this.strategy.contentTypeOverrides),
-    });
-  }
+  updateStrategy(newStrategy: Partial<EmbeddingStrategy>): void {}
 
   getCurrentStrategy(): EmbeddingStrategy {

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:325:21
   }
 
   updateStrategy(newStrategy: Partial<EmbeddingStrategy>): void {
-    this.strategy = { ...this.strategy, ...newStrategy };
+    this.strategy = {};
     console.log(`🔄 Updated embedding strategy:`, {
       primary: this.strategy.primaryModel.name,

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:326:51
 
   updateStrategy(newStrategy: Partial<EmbeddingStrategy>): void {
     this.strategy = { ...this.strategy, ...newStrategy };
-    console.log(`🔄 Updated embedding strategy:`, {
-      primary: this.strategy.primaryModel.name,
-      fallbacks: this.strategy.fallbackModels.map((m) => m.name),
-      overrides: Object.keys(this.strategy.contentTypeOverrides),
-    });
+    console.log(`🔄 Updated embedding strategy:`, {{});
   }
 

[NoCoverage] ArrowFunction
src/lib/embeddings.ts:328:51
     this.strategy = { ...this.strategy, ...newStrategy };
     console.log(`🔄 Updated embedding strategy:`, {
       primary: this.strategy.primaryModel.name,
-      fallbacks: this.strategy.fallbackModels.map((m) => m.name),
+      fallbacks: this.strategy.fallbackModels.map(() => undefined),
       overrides: Object.keys(this.strategy.contentTypeOverrides),
     });

[NoCoverage] BlockStatement
src/lib/embeddings.ts:333:43
     });
   }
 
-  getCurrentStrategy(): EmbeddingStrategy {
-    return { ...this.strategy };
-  }
+  getCurrentStrategy(): EmbeddingStrategy {}
 
   getAvailableModels(): EmbeddingModel[] {

[NoCoverage] BlockStatement
src/lib/embeddings.ts:337:42
     return { ...this.strategy };
   }
 
-  getAvailableModels(): EmbeddingModel[] {
-    return [...this.models];
-  }
+  getAvailableModels(): EmbeddingModel[] {}
 
   getCacheStats(): { size: number; keys: string[] } {

[NoCoverage] BlockStatement
src/lib/embeddings.ts:341:53
     return [...this.models];
   }
 
-  getCacheStats(): { size: number; keys: string[] } {
-    return {
-      size: this.cache.size,
-      keys: Array.from(this.cache.keys()).slice(0, 10), // First 10 keys for debugging
-    };
-  }
+  getCacheStats(): { size: number; keys: string[] } {}
 }
 

[NoCoverage] MethodExpression
src/lib/embeddings.ts:344:13
   getCacheStats(): { size: number; keys: string[] } {
     return {
       size: this.cache.size,
-      keys: Array.from(this.cache.keys()).slice(0, 10), // First 10 keys for debugging
+      keys: Array.from(this.cache.keys()), // First 10 keys for debugging
     };
   }
