[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:89:49
  * Utility functions for Obsidian document processing
  */
 export class ObsidianUtils {
-  static cleanMarkdown(content: string): string {
-    return content
-      .replace(/^---[\s\S]*?---\n?/m, "")
-      .replace(
-        /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g,
-        (_, target, display) => display || target
-      )
-      .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
-      .replace(/(\*\*|__)(.*?)\1/g, "$1")
-      .replace(/(\*|_)(.*?)\1/g, "$1")
-      .replace(/`([^`]+)`/g, "$1")
-      .replace(/~~(.*?)~~/g, "$1")
-      .replace(/^#{1,6}\s+(.*)$/gm, "$1")
-      .replace(/\n{3,}/g, "\n\n")
-      .trim();
-  }
+  static cleanMarkdown(content: string): string {}
 
   static extractWikilinks(content: string): string[] {

[NoCoverage] StringLiteral
src/lib/obsidian-models.ts:91:39
 export class ObsidianUtils {
   static cleanMarkdown(content: string): string {
     return content
-      .replace(/^---[\s\S]*?---\n?/m, "")
+      .replace(/^---[\s\S]*?---\n?/m, "Stryker was here!")
       .replace(
         /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g,

[NoCoverage] Regex
src/lib/obsidian-models.ts:91:16
 export class ObsidianUtils {
   static cleanMarkdown(content: string): string {
     return content
-      .replace(/^---[\s\S]*?---\n?/m, "")
+      .replace(/^---[\S\S]*?---\n?/m, "")
       .replace(
         /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g,

[NoCoverage] Regex
src/lib/obsidian-models.ts:93:9
     return content
       .replace(/^---[\s\S]*?---\n?/m, "")
       .replace(
-        /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g,
+        /\[\[([\]|]+)(?:\|([^\]]+))?\]\]/g,
         (_, target, display) => display || target
       )

[NoCoverage] Regex
src/lib/obsidian-models.ts:93:9
     return content
       .replace(/^---[\s\S]*?---\n?/m, "")
       .replace(
-        /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g,
+        /\[\[([^\]|]+)(?:\|([^\]]))?\]\]/g,
         (_, target, display) => display || target
       )

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:94:33
       .replace(/^---[\s\S]*?---\n?/m, "")
       .replace(
         /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g,
-        (_, target, display) => display || target
+        (_, target, display) => false
       )
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:94:33
       .replace(/^---[\s\S]*?---\n?/m, "")
       .replace(
         /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g,
-        (_, target, display) => display || target
+        (_, target, display) => true
       )
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")

[NoCoverage] Regex
src/lib/obsidian-models.ts:97:16
         (_, target, display) => display || target
       )
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
-      .replace(/(\*\*|__)(.*?)\1/g, "$1")
+      .replace(/(\*\*|__)(.)\1/g, "$1")
       .replace(/(\*|_)(.*?)\1/g, "$1")
       .replace(/`([^`]+)`/g, "$1")

[NoCoverage] Regex
src/lib/obsidian-models.ts:99:16
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
       .replace(/(\*\*|__)(.*?)\1/g, "$1")
       .replace(/(\*|_)(.*?)\1/g, "$1")
-      .replace(/`([^`]+)`/g, "$1")
+      .replace(/`([^`])`/g, "$1")
       .replace(/~~(.*?)~~/g, "$1")
       .replace(/^#{1,6}\s+(.*)$/gm, "$1")

[NoCoverage] Regex
src/lib/obsidian-models.ts:99:16
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
       .replace(/(\*\*|__)(.*?)\1/g, "$1")
       .replace(/(\*|_)(.*?)\1/g, "$1")
-      .replace(/`([^`]+)`/g, "$1")
+      .replace(/`([`]+)`/g, "$1")
       .replace(/~~(.*?)~~/g, "$1")
       .replace(/^#{1,6}\s+(.*)$/gm, "$1")

[NoCoverage] StringLiteral
src/lib/obsidian-models.ts:100:30
       .replace(/(\*\*|__)(.*?)\1/g, "$1")
       .replace(/(\*|_)(.*?)\1/g, "$1")
       .replace(/`([^`]+)`/g, "$1")
-      .replace(/~~(.*?)~~/g, "$1")
+      .replace(/~~(.*?)~~/g, "")
       .replace(/^#{1,6}\s+(.*)$/gm, "$1")
       .replace(/\n{3,}/g, "\n\n")

[NoCoverage] Regex
src/lib/obsidian-models.ts:100:16
       .replace(/(\*\*|__)(.*?)\1/g, "$1")
       .replace(/(\*|_)(.*?)\1/g, "$1")
       .replace(/`([^`]+)`/g, "$1")
-      .replace(/~~(.*?)~~/g, "$1")
+      .replace(/~~(.)~~/g, "$1")
       .replace(/^#{1,6}\s+(.*)$/gm, "$1")
       .replace(/\n{3,}/g, "\n\n")

[NoCoverage] Regex
src/lib/obsidian-models.ts:101:16
       .replace(/(\*|_)(.*?)\1/g, "$1")
       .replace(/`([^`]+)`/g, "$1")
       .replace(/~~(.*?)~~/g, "$1")
-      .replace(/^#{1,6}\s+(.*)$/gm, "$1")
+      .replace(/^#{1,6}\s(.*)$/gm, "$1")
       .replace(/\n{3,}/g, "\n\n")
       .trim();

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:106:54
       .trim();
   }
 
-  static extractWikilinks(content: string): string[] {
-    const wikilinkRegex = /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g;
-    const links: string[] = [];
-    let match;
-
-    while ((match = wikilinkRegex.exec(content)) !== null) {
-      links.push(match[2] || match[1]);
-    }
-
-    return [...new Set(links)];
-  }
+  static extractWikilinks(content: string): string[] {}
 
   static extractTags(content: string): string[] {

[NoCoverage] Regex
src/lib/obsidian-models.ts:107:27
   }
 
   static extractWikilinks(content: string): string[] {
-    const wikilinkRegex = /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g;
+    const wikilinkRegex = /\[\[([^\]|]+)(?:\|([^\]]+))\]\]/g;
     const links: string[] = [];
     let match;

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:111:12
     const links: string[] = [];
     let match;
 
-    while ((match = wikilinkRegex.exec(content)) !== null) {
+    while (false) {
       links.push(match[2] || match[1]);
     }

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:111:60
     const links: string[] = [];
     let match;
 
-    while ((match = wikilinkRegex.exec(content)) !== null) {
-      links.push(match[2] || match[1]);
-    }
+    while ((match = wikilinkRegex.exec(content)) !== null) {}
 
     return [...new Set(links)];

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:112:18
     let match;
 
     while ((match = wikilinkRegex.exec(content)) !== null) {
-      links.push(match[2] || match[1]);
+      links.push(true);
     }
 

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:112:18
     let match;
 
     while ((match = wikilinkRegex.exec(content)) !== null) {
-      links.push(match[2] || match[1]);
+      links.push(false);
     }
 

[NoCoverage] ArrayDeclaration
src/lib/obsidian-models.ts:115:12
       links.push(match[2] || match[1]);
     }
 
-    return [...new Set(links)];
+    return [];
   }
 

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:118:49
     return [...new Set(links)];
   }
 
-  static extractTags(content: string): string[] {
-    const tagRegex = /#([a-zA-Z0-9_-]+)/g;
-    const tags: string[] = [];
-    let match;
-
-    while ((match = tagRegex.exec(content)) !== null) {
-      tags.push(match[1]);
-    }
-
-    return [...new Set(tags)];
-  }
+  static extractTags(content: string): string[] {}
 
   static parseFrontmatter(content: string): Record<string, any> {

[NoCoverage] Regex
src/lib/obsidian-models.ts:119:22
   }
 
   static extractTags(content: string): string[] {
-    const tagRegex = /#([a-zA-Z0-9_-]+)/g;
+    const tagRegex = /#([^a-zA-Z0-9_-]+)/g;
     const tags: string[] = [];
     let match;

[NoCoverage] ArrayDeclaration
src/lib/obsidian-models.ts:120:28
 
   static extractTags(content: string): string[] {
     const tagRegex = /#([a-zA-Z0-9_-]+)/g;
-    const tags: string[] = [];
+    const tags: string[] = ["Stryker was here"];
     let match;
 

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:123:55
     const tags: string[] = [];
     let match;
 
-    while ((match = tagRegex.exec(content)) !== null) {
-      tags.push(match[1]);
-    }
+    while ((match = tagRegex.exec(content)) !== null) {}
 
     return [...new Set(tags)];

[NoCoverage] EqualityOperator
src/lib/obsidian-models.ts:123:12
     const tags: string[] = [];
     let match;
 
-    while ((match = tagRegex.exec(content)) !== null) {
+    while ((match = tagRegex.exec(content)) === null) {
       tags.push(match[1]);
     }

[NoCoverage] ArrayDeclaration
src/lib/obsidian-models.ts:127:12
       tags.push(match[1]);
     }
 
-    return [...new Set(tags)];
+    return [];
   }
 

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:130:65
     return [...new Set(tags)];
   }
 
-  static parseFrontmatter(content: string): Record<string, any> {
-    const frontmatterRegex = /^---\n([\s\S]*?)\n---/;
-    const match = content.match(frontmatterRegex);
-
-    if (!match) return {};
-
-    try {
-      // Simple YAML-like parsing (for now)
-      const frontmatter: Record<string, any> = {};
-      const lines = match[1].split("\n");
-
-      for (const line of lines) {
-        const [key, ...valueParts] = line.split(":");
-        if (key && valueParts.length > 0) {
-          const value = valueParts.join(":").trim();
-          // Remove quotes if present
-          frontmatter[key.trim()] = value.replace(/^["']|["']$/g, "");
-        }
-      }
-
-      return frontmatter;
-    } catch {
-      return {};
-    }
-  }
+  static parseFrontmatter(content: string): Record<string, any> {}
 
   static generateFileChecksum(content: string): string {

[NoCoverage] Regex
src/lib/obsidian-models.ts:131:30
   }
 
   static parseFrontmatter(content: string): Record<string, any> {
-    const frontmatterRegex = /^---\n([\s\S]*?)\n---/;
+    const frontmatterRegex = /^---\n([^\s\S]*?)\n---/;
     const match = content.match(frontmatterRegex);
 

[NoCoverage] Regex
src/lib/obsidian-models.ts:131:30
   }
 
   static parseFrontmatter(content: string): Record<string, any> {
-    const frontmatterRegex = /^---\n([\s\S]*?)\n---/;
+    const frontmatterRegex = /^---\n([\s\S])\n---/;
     const match = content.match(frontmatterRegex);
 

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:134:9
     const frontmatterRegex = /^---\n([\s\S]*?)\n---/;
     const match = content.match(frontmatterRegex);
 
-    if (!match) return {};
+    if (false) return {};
 
     try {

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:134:9
     const frontmatterRegex = /^---\n([\s\S]*?)\n---/;
     const match = content.match(frontmatterRegex);
 
-    if (!match) return {};
+    if (true) return {};
 
     try {

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:136:9
 
     if (!match) return {};
 
-    try {
-      // Simple YAML-like parsing (for now)
-      const frontmatter: Record<string, any> = {};
-      const lines = match[1].split("\n");
-
-      for (const line of lines) {
-        const [key, ...valueParts] = line.split(":");
-        if (key && valueParts.length > 0) {
-          const value = valueParts.join(":").trim();
-          // Remove quotes if present
-          frontmatter[key.trim()] = value.replace(/^["']|["']$/g, "");
-        }
-      }
-
-      return frontmatter;
-    } catch {
+    try {} catch {
       return {};
     }

[NoCoverage] StringLiteral
src/lib/obsidian-models.ts:139:36
     try {
       // Simple YAML-like parsing (for now)
       const frontmatter: Record<string, any> = {};
-      const lines = match[1].split("\n");
+      const lines = match[1].split("");
 
       for (const line of lines) {

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:141:33
       const frontmatter: Record<string, any> = {};
       const lines = match[1].split("\n");
 
-      for (const line of lines) {
-        const [key, ...valueParts] = line.split(":");
-        if (key && valueParts.length > 0) {
-          const value = valueParts.join(":").trim();
-          // Remove quotes if present
-          frontmatter[key.trim()] = value.replace(/^["']|["']$/g, "");
-        }
-      }
+      for (const line of lines) {}
 
       return frontmatter;

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:143:43
 
       for (const line of lines) {
         const [key, ...valueParts] = line.split(":");
-        if (key && valueParts.length > 0) {
-          const value = valueParts.join(":").trim();
-          // Remove quotes if present
-          frontmatter[key.trim()] = value.replace(/^["']|["']$/g, "");
-        }
+        if (key && valueParts.length > 0) {}
       }
 

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:143:13
 
       for (const line of lines) {
         const [key, ...valueParts] = line.split(":");
-        if (key && valueParts.length > 0) {
+        if (true) {
           const value = valueParts.join(":").trim();
           // Remove quotes if present

[NoCoverage] MethodExpression
src/lib/obsidian-models.ts:144:25
       for (const line of lines) {
         const [key, ...valueParts] = line.split(":");
         if (key && valueParts.length > 0) {
-          const value = valueParts.join(":").trim();
+          const value = valueParts.join(":");
           // Remove quotes if present
           frontmatter[key.trim()] = value.replace(/^["']|["']$/g, "");

[NoCoverage] MethodExpression
src/lib/obsidian-models.ts:146:23
         if (key && valueParts.length > 0) {
           const value = valueParts.join(":").trim();
           // Remove quotes if present
-          frontmatter[key.trim()] = value.replace(/^["']|["']$/g, "");
+          frontmatter[key] = value.replace(/^["']|["']$/g, "");
         }
       }

[NoCoverage] Regex
src/lib/obsidian-models.ts:146:51
         if (key && valueParts.length > 0) {
           const value = valueParts.join(":").trim();
           // Remove quotes if present
-          frontmatter[key.trim()] = value.replace(/^["']|["']$/g, "");
+          frontmatter[key.trim()] = value.replace(/^["']|["']/g, "");
         }
       }

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:151:13
       }
 
       return frontmatter;
-    } catch {
-      return {};
-    }
+    } catch {}
   }
 

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:156:56
     }
   }
 
-  static generateFileChecksum(content: string): string {
-    const crypto = require("crypto");
-    return crypto.createHash("sha256").update(content).digest("hex");
-  }
+  static generateFileChecksum(content: string): string {}
 
   static determineContentType(

[NoCoverage] BlockStatement
src/lib/obsidian-models.ts:165:13
     filePath: string,
     vaultPath: string,
     frontmatter: Record<string, any>
-  ): string {
-    const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
-
-    // Path-based classification
-    if (relativePath.includes("MOCs/")) return "moc";
-    if (relativePath.includes("Articles/")) return "article";
-    if (relativePath.includes("AIChats/")) return "conversation";
-    if (relativePath.includes("Books/")) return "book-note";
-    if (relativePath.includes("templates/")) return "template";
-
-    // Check frontmatter type
-    if (frontmatter.type) {
-      return frontmatter.type;
-    }
-
-    return "note";
-  }
+  ): string {}
 }
 

[NoCoverage] StringLiteral
src/lib/obsidian-models.ts:166:74
     vaultPath: string,
     frontmatter: Record<string, any>
   ): string {
-    const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
+    const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "Stryker was here!");
 
     // Path-based classification

[NoCoverage] Regex
src/lib/obsidian-models.ts:166:66
     vaultPath: string,
     frontmatter: Record<string, any>
   ): string {
-    const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
+    const relativePath = filePath.replace(vaultPath, "").replace(/\/+/, "");
 
     // Path-based classification

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:169:9
     const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
 
     // Path-based classification
-    if (relativePath.includes("MOCs/")) return "moc";
+    if (true) return "moc";
     if (relativePath.includes("Articles/")) return "article";
     if (relativePath.includes("AIChats/")) return "conversation";

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:169:9
     const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
 
     // Path-based classification
-    if (relativePath.includes("MOCs/")) return "moc";
+    if (false) return "moc";
     if (relativePath.includes("Articles/")) return "article";
     if (relativePath.includes("AIChats/")) return "conversation";

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:170:9
 
     // Path-based classification
     if (relativePath.includes("MOCs/")) return "moc";
-    if (relativePath.includes("Articles/")) return "article";
+    if (true) return "article";
     if (relativePath.includes("AIChats/")) return "conversation";
     if (relativePath.includes("Books/")) return "book-note";

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:170:9
 
     // Path-based classification
     if (relativePath.includes("MOCs/")) return "moc";
-    if (relativePath.includes("Articles/")) return "article";
+    if (false) return "article";
     if (relativePath.includes("AIChats/")) return "conversation";
     if (relativePath.includes("Books/")) return "book-note";

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:171:9
     // Path-based classification
     if (relativePath.includes("MOCs/")) return "moc";
     if (relativePath.includes("Articles/")) return "article";
-    if (relativePath.includes("AIChats/")) return "conversation";
+    if (true) return "conversation";
     if (relativePath.includes("Books/")) return "book-note";
     if (relativePath.includes("templates/")) return "template";

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:171:9
     // Path-based classification
     if (relativePath.includes("MOCs/")) return "moc";
     if (relativePath.includes("Articles/")) return "article";
-    if (relativePath.includes("AIChats/")) return "conversation";
+    if (false) return "conversation";
     if (relativePath.includes("Books/")) return "book-note";
     if (relativePath.includes("templates/")) return "template";

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:172:9
     if (relativePath.includes("MOCs/")) return "moc";
     if (relativePath.includes("Articles/")) return "article";
     if (relativePath.includes("AIChats/")) return "conversation";
-    if (relativePath.includes("Books/")) return "book-note";
+    if (true) return "book-note";
     if (relativePath.includes("templates/")) return "template";
 

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:172:9
     if (relativePath.includes("MOCs/")) return "moc";
     if (relativePath.includes("Articles/")) return "article";
     if (relativePath.includes("AIChats/")) return "conversation";
-    if (relativePath.includes("Books/")) return "book-note";
+    if (false) return "book-note";
     if (relativePath.includes("templates/")) return "template";
 

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:173:9
     if (relativePath.includes("Articles/")) return "article";
     if (relativePath.includes("AIChats/")) return "conversation";
     if (relativePath.includes("Books/")) return "book-note";
-    if (relativePath.includes("templates/")) return "template";
+    if (true) return "template";
 
     // Check frontmatter type

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:173:9
     if (relativePath.includes("Articles/")) return "article";
     if (relativePath.includes("AIChats/")) return "conversation";
     if (relativePath.includes("Books/")) return "book-note";
-    if (relativePath.includes("templates/")) return "template";
+    if (false) return "template";
 
     // Check frontmatter type

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:176:9
     if (relativePath.includes("templates/")) return "template";
 
     // Check frontmatter type
-    if (frontmatter.type) {
+    if (true) {
       return frontmatter.type;
     }

[NoCoverage] ConditionalExpression
src/lib/obsidian-models.ts:176:9
     if (relativePath.includes("templates/")) return "template";
 
     // Check frontmatter type
-    if (frontmatter.type) {
+    if (false) {
       return frontmatter.type;
     }
