[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:26:37
   /**
    * Initialize the OCR worker
    */
-  async initialize(): Promise<void> {
-    if (!this.worker) {
-      this.worker = await createWorker("eng"); // Default to English
-    }
-  }
+  async initialize(): Promise<void> {}
 
   /**
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR Error: OCR worker not initi…' to be 'This is a test document with clear te…' // Object.is equality

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:27:23
    * Initialize the OCR worker
    */
   async initialize(): Promise<void> {
-    if (!this.worker) {
-      this.worker = await createWorker("eng"); // Default to English
-    }
+    if (!this.worker) {}
   }
 
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR Error: OCR worker not initi…' to be 'This is a test document with clear te…' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:27:9
    * Initialize the OCR worker
    */
   async initialize(): Promise<void> {
-    if (!this.worker) {
+    if (true) {
       this.worker = await createWorker("eng"); // Default to English
     }
killedBy: OCRProcessor Worker management should reuse initialized worker
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:48:11
     try {
       await this.initialize();
 
-      if (!this.worker) {
+      if (true) {
         throw new Error("OCR worker not initialized");
       }
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR Error: OCR worker not initi…' to be 'This is a test document with clear te…' // Object.is equality

[Killed] BooleanLiteral
src/lib/processors/ocr-processor.ts:48:11
     try {
       await this.initialize();
 
-      if (!this.worker) {
+      if (this.worker) {
         throw new Error("OCR worker not initialized");
       }
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR Error: OCR worker not initi…' to be 'This is a test document with clear te…' // Object.is equality

[Survived] ConditionalExpression
src/lib/processors/ocr-processor.ts:53:11
       }
 
       // Load language if specified
-      if (options.language && options.language !== "eng") {
+      if (false) {
         await this.worker.setParameters({
           tessedit_ocr_engine_mode: "1", // Use LSTM OCR engine

[NoCoverage] ConditionalExpression
src/lib/processors/ocr-processor.ts:53:31
       }
 
       // Load language if specified
-      if (options.language && options.language !== "eng") {
+      if (options.language && true) {
         await this.worker.setParameters({
           tessedit_ocr_engine_mode: "1", // Use LSTM OCR engine

[NoCoverage] StringLiteral
src/lib/processors/ocr-processor.ts:55:37
       // Load language if specified
       if (options.language && options.language !== "eng") {
         await this.worker.setParameters({
-          tessedit_ocr_engine_mode: "1", // Use LSTM OCR engine
+          tessedit_ocr_engine_mode: "", // Use LSTM OCR engine
         });
       }

[Survived] ArithmeticOperator
src/lib/processors/ocr-processor.ts:64:30
       // Perform OCR
       const result = await this.worker.recognize(buffer);
 
-      const processingTime = Date.now() - startTime;
+      const processingTime = Date.now() + startTime;
       const text = result.data.text.trim();
       const confidence = result.data.confidence;

[Survived] MethodExpression
src/lib/processors/ocr-processor.ts:65:20
       const result = await this.worker.recognize(buffer);
 
       const processingTime = Date.now() - startTime;
-      const text = result.data.text.trim();
+      const text = result.data.text;
       const confidence = result.data.confidence;
 

[Killed] ArrowFunction
src/lib/processors/ocr-processor.ts:69:46
       const confidence = result.data.confidence;
 
       // Analyze extracted text
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter(() => undefined);
       const hasText = text.length > 0 && words.length > 0;
 
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR: No text detected' to be 'This is a test document with clear te…' // Object.is equality

[Killed] MethodExpression
src/lib/processors/ocr-processor.ts:69:21
       const confidence = result.data.confidence;
 
       // Analyze extracted text
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/);
       const hasText = text.length > 0 && words.length > 0;
 
killedBy: OCRProcessor extractTextFromBuffer should handle images with no text
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:70:23
 
       // Analyze extracted text
       const words = text.split(/\s+/).filter((word) => word.length > 0);
-      const hasText = text.length > 0 && words.length > 0;
+      const hasText = true;
 
       // Check if confidence meets minimum threshold
killedBy: OCRProcessor extractTextFromBuffer should handle images with no text
statusReason: expected 'Image OCR: Low confidence (0.0%)' to contain 'No text detected'

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:70:23
 
       // Analyze extracted text
       const words = text.split(/\s+/).filter((word) => word.length > 0);
-      const hasText = text.length > 0 && words.length > 0;
+      const hasText = false;
 
       // Check if confidence meets minimum threshold
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR: No text detected' to be 'This is a test document with clear te…' // Object.is equality

[Killed] LogicalOperator
src/lib/processors/ocr-processor.ts:73:29
       const hasText = text.length > 0 && words.length > 0;
 
       // Check if confidence meets minimum threshold
-      const minConfidence = options.confidence || 30; // Default minimum confidence
+      const minConfidence = options.confidence && 30; // Default minimum confidence
       const isConfident = confidence >= minConfidence;
 
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR: Low confidence (85.0%)' to be 'This is a test document with clear te…' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:73:29
       const hasText = text.length > 0 && words.length > 0;
 
       // Check if confidence meets minimum threshold
-      const minConfidence = options.confidence || 30; // Default minimum confidence
+      const minConfidence = true; // Default minimum confidence
       const isConfident = confidence >= minConfidence;
 
killedBy: OCRProcessor extractTextFromBuffer should handle low confidence OCR results
statusReason: expected 'unclear text' to contain 'Low confidence'

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:74:27
 
       // Check if confidence meets minimum threshold
       const minConfidence = options.confidence || 30; // Default minimum confidence
-      const isConfident = confidence >= minConfidence;
+      const isConfident = false;
 
       const ocrMetadata: OCRMetadata = {
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR: Low confidence (85.0%)' to be 'This is a test document with clear te…' // Object.is equality

[Killed] EqualityOperator
src/lib/processors/ocr-processor.ts:74:27
 
       // Check if confidence meets minimum threshold
       const minConfidence = options.confidence || 30; // Default minimum confidence
-      const isConfident = confidence >= minConfidence;
+      const isConfident = confidence < minConfidence;
 
       const ocrMetadata: OCRMetadata = {
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR: Low confidence (85.0%)' to be 'This is a test document with clear te…' // Object.is equality

[Killed] LogicalOperator
src/lib/processors/ocr-processor.ts:79:19
       const ocrMetadata: OCRMetadata = {
         confidence,
         processingTime,
-        language: options.language || "eng",
+        language: options.language && "eng",
         version: "tesseract.js",
       };
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected undefined to be 'eng' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:79:19
       const ocrMetadata: OCRMetadata = {
         confidence,
         processingTime,
-        language: options.language || "eng",
+        language: true,
         version: "tesseract.js",
       };
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected true to be 'eng' // Object.is equality

[Killed] ObjectLiteral
src/lib/processors/ocr-processor.ts:83:51
         version: "tesseract.js",
       };
 
-      const contentMetadata: OCRContentMetadata = {
-        type: ContentType.RASTER_IMAGE,
-        language: this.detectLanguage(text),
-        encoding: "utf-8",
-        confidence,
-        hasText: hasText && isConfident,
-        wordCount: words.length,
-        characterCount: text.length,
-        ocrMetadata,
-      };
+      const contentMetadata: OCRContentMetadata = {};
 
       // Return appropriate text based on confidence
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected undefined to be 85 // Object.is equality

[Survived] StringLiteral
src/lib/processors/ocr-processor.ts:86:19
       const contentMetadata: OCRContentMetadata = {
         type: ContentType.RASTER_IMAGE,
         language: this.detectLanguage(text),
-        encoding: "utf-8",
+        encoding: "",
         confidence,
         hasText: hasText && isConfident,

[Killed] LogicalOperator
src/lib/processors/ocr-processor.ts:88:18
         language: this.detectLanguage(text),
         encoding: "utf-8",
         confidence,
-        hasText: hasText && isConfident,
+        hasText: hasText || isConfident,
         wordCount: words.length,
         characterCount: text.length,
killedBy: OCRProcessor extractTextFromBuffer should handle low confidence OCR results
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:88:18
         language: this.detectLanguage(text),
         encoding: "utf-8",
         confidence,
-        hasText: hasText && isConfident,
+        hasText: true,
         wordCount: words.length,
         characterCount: text.length,
killedBy: OCRProcessor extractTextFromBuffer should handle low confidence OCR results
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:96:9
 
       // Return appropriate text based on confidence
       const finalText =
-        isConfident && hasText
+        false
           ? text
           : `Image OCR: ${
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected 'Image OCR: Low confidence (85.0%)' to be 'This is a test document with clear te…' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:96:9
 
       // Return appropriate text based on confidence
       const finalText =
-        isConfident && hasText
+        true
           ? text
           : `Image OCR: ${
killedBy: OCRProcessor extractTextFromBuffer should handle low confidence OCR results
statusReason: expected 'unclear text' to contain 'Low confidence'

[Killed] StringLiteral
src/lib/processors/ocr-processor.ts:98:13
       const finalText =
         isConfident && hasText
           ? text
-          : `Image OCR: ${
-              hasText
-                ? `Low confidence (${confidence.toFixed(1)}%)`
-                : "No text detected"
-            }`;
+          : ``;
 
       return {
killedBy: OCRProcessor extractTextFromBuffer should handle low confidence OCR results
statusReason: expected '' to contain 'Low confidence'

[Killed] StringLiteral
src/lib/processors/ocr-processor.ts:101:19
           : `Image OCR: ${
               hasText
                 ? `Low confidence (${confidence.toFixed(1)}%)`
-                : "No text detected"
+                : ""
             }`;
 
killedBy: OCRProcessor extractTextFromBuffer should handle images with no text
statusReason: expected 'Image OCR: ' to contain 'No text detected'

[Killed] ObjectLiteral
src/lib/processors/ocr-processor.ts:104:14
                 : "No text detected"
             }`;
 
-      return {
-        text: finalText,
-        metadata: contentMetadata,
-      };
+      return {};
     } catch (error) {
       const errorMessage =
killedBy: OCRProcessor extractTextFromBuffer should extract text with high confidence
statusReason: expected undefined to be 'This is a test document with clear te…' // Object.is equality

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:108:21
         text: finalText,
         metadata: contentMetadata,
       };
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OCRContentMetadata = {
-        type: ContentType.RASTER_IMAGE,
-        language: "unknown",
-        encoding: "unknown",
-        confidence: 0,
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Image OCR Error: ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 
killedBy: OCRProcessor extractTextFromBuffer should handle OCR errors gracefully
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ObjectLiteral
src/lib/processors/ocr-processor.ts:112:51
       const errorMessage =
         error instanceof Error ? error.message : String(error);
 
-      const contentMetadata: OCRContentMetadata = {
-        type: ContentType.RASTER_IMAGE,
-        language: "unknown",
-        encoding: "unknown",
-        confidence: 0,
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
+      const contentMetadata: OCRContentMetadata = {};
 
       return {
killedBy: OCRProcessor extractTextFromBuffer should handle OCR errors gracefully
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BooleanLiteral
src/lib/processors/ocr-processor.ts:117:18
         language: "unknown",
         encoding: "unknown",
         confidence: 0,
-        hasText: false,
+        hasText: true,
         wordCount: 0,
         characterCount: 0,
killedBy: OCRProcessor extractTextFromBuffer should handle OCR errors gracefully
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:141:6
   ): Promise<{
     text: string;
     metadata: OCRContentMetadata;
-  }> {
-    try {
-      const buffer = fs.readFileSync(filePath);
-      return await this.extractTextFromBuffer(buffer, options);
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OCRContentMetadata = {
-        type: ContentType.RASTER_IMAGE,
-        language: "unknown",
-        encoding: "unknown",
-        confidence: 0,
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Image OCR Error: Failed to read file - ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
-  }
+  }> {}
 
   /**
killedBy: OCRProcessor extractTextFromFile should read file and perform OCR
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:142:9
     text: string;
     metadata: OCRContentMetadata;
   }> {
-    try {
-      const buffer = fs.readFileSync(filePath);
-      return await this.extractTextFromBuffer(buffer, options);
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : String(error);
killedBy: OCRProcessor extractTextFromFile should read file and perform OCR
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:145:21
     try {
       const buffer = fs.readFileSync(filePath);
       return await this.extractTextFromBuffer(buffer, options);
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OCRContentMetadata = {
-        type: ContentType.RASTER_IMAGE,
-        language: "unknown",
-        encoding: "unknown",
-        confidence: 0,
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Image OCR Error: Failed to read file - ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 
killedBy: OCRProcessor extractTextFromFile should handle file read errors
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:169:45
   /**
    * Check if an image format is supported for OCR
    */
-  isSupportedImage(buffer: Buffer): boolean {
-    // Check common image signatures
-    const signatures = [
-      Buffer.from([0xff, 0xd8, 0xff]), // JPEG
-      Buffer.from([0x89, 0x50, 0x4e, 0x47]), // PNG
-      Buffer.from([0x42, 0x4d]), // BMP
-      Buffer.from([0x49, 0x49, 0x2a, 0x00]), // TIFF (little-endian)
-      Buffer.from([0x4d, 0x4d, 0x00, 0x2a]), // TIFF (big-endian)
-      Buffer.from([0x52, 0x49, 0x46, 0x46]), // WEBP (starts with RIFF)
-    ];
-
-    return signatures.some((signature) =>
-      buffer.subarray(0, signature.length).equals(signature)
-    );
-  }
+  isSupportedImage(buffer: Buffer): boolean {}
 
   /**
killedBy: OCRProcessor isSupportedImage should validate JPEG images
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/processors/ocr-processor.ts:173:19
     // Check common image signatures
     const signatures = [
       Buffer.from([0xff, 0xd8, 0xff]), // JPEG
-      Buffer.from([0x89, 0x50, 0x4e, 0x47]), // PNG
+      Buffer.from([]), // PNG
       Buffer.from([0x42, 0x4d]), // BMP
       Buffer.from([0x49, 0x49, 0x2a, 0x00]), // TIFF (little-endian)
killedBy: OCRProcessor isSupportedImage should reject unsupported formats
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/lib/processors/ocr-processor.ts:177:19
       Buffer.from([0x42, 0x4d]), // BMP
       Buffer.from([0x49, 0x49, 0x2a, 0x00]), // TIFF (little-endian)
       Buffer.from([0x4d, 0x4d, 0x00, 0x2a]), // TIFF (big-endian)
-      Buffer.from([0x52, 0x49, 0x46, 0x46]), // WEBP (starts with RIFF)
+      Buffer.from([]), // WEBP (starts with RIFF)
     ];
 
killedBy: OCRProcessor isSupportedImage should reject unsupported formats
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/lib/processors/ocr-processor.ts:180:12
       Buffer.from([0x52, 0x49, 0x46, 0x46]), // WEBP (starts with RIFF)
     ];
 
-    return signatures.some((signature) =>
-      buffer.subarray(0, signature.length).equals(signature)
-    );
+    return signatures.every(signature => buffer.subarray(0, signature.length).equals(signature));
   }
 
killedBy: OCRProcessor isSupportedImage should validate JPEG images
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/processors/ocr-processor.ts:180:28
       Buffer.from([0x52, 0x49, 0x46, 0x46]), // WEBP (starts with RIFF)
     ];
 
-    return signatures.some((signature) =>
-      buffer.subarray(0, signature.length).equals(signature)
+    return signatures.some(() => undefined
     );
   }
killedBy: OCRProcessor isSupportedImage should validate JPEG images
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:188:48
   /**
    * Detect language from OCR text (simple heuristic)
    */
-  private detectLanguage(text: string): string {
-    if (!text || text.length === 0) return "unknown";
-
-    // Simple heuristics for language detection
-    const englishWords = /\b(the|and|or|but|in|on|at|to|for|of|with|by)\b/gi;
-    const spanishWords =
-      /\b(el|la|los|las|y|o|pero|en|sobre|a|para|de|con|por)\b/gi;
-    const frenchWords =
-      /\b(le|la|les|et|ou|mais|dans|sur|à|pour|de|avec|par)\b/gi;
-
-    const englishMatches = (text.match(englishWords) || []).length;
-    const spanishMatches = (text.match(spanishWords) || []).length;
-    const frenchMatches = (text.match(frenchWords) || []).length;
-
-    const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
-
-    if (maxMatches === 0) return "unknown";
-    if (maxMatches === englishMatches) return "en";
-    if (maxMatches === spanishMatches) return "es";
-    if (maxMatches === frenchMatches) return "fr";
-
-    return "unknown";
-  }
+  private detectLanguage(text: string): string {}
 
   /**
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected undefined to be 'en' // Object.is equality

[Killed] EqualityOperator
src/lib/processors/ocr-processor.ts:189:18
    * Detect language from OCR text (simple heuristic)
    */
   private detectLanguage(text: string): string {
-    if (!text || text.length === 0) return "unknown";
+    if (!text || text.length !== 0) return "unknown";
 
     // Simple heuristics for language detection
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:189:9
    * Detect language from OCR text (simple heuristic)
    */
   private detectLanguage(text: string): string {
-    if (!text || text.length === 0) return "unknown";
+    if (true) return "unknown";
 
     // Simple heuristics for language detection
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] LogicalOperator
src/lib/processors/ocr-processor.ts:198:29
     const frenchWords =
       /\b(le|la|les|et|ou|mais|dans|sur|à|pour|de|avec|par)\b/gi;
 
-    const englishMatches = (text.match(englishWords) || []).length;
+    const englishMatches = (text.match(englishWords) && []).length;
     const spanishMatches = (text.match(spanishWords) || []).length;
     const frenchMatches = (text.match(frenchWords) || []).length;
killedBy: OCRProcessor extractTextFromBuffer should handle low confidence OCR results
statusReason: expected 'Image OCR Error: Cannot read properti…' to contain 'Low confidence'

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:198:29
     const frenchWords =
       /\b(le|la|les|et|ou|mais|dans|sur|à|pour|de|avec|par)\b/gi;
 
-    const englishMatches = (text.match(englishWords) || []).length;
+    const englishMatches = (true).length;
     const spanishMatches = (text.match(spanishWords) || []).length;
     const frenchMatches = (text.match(frenchWords) || []).length;
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] LogicalOperator
src/lib/processors/ocr-processor.ts:199:29
       /\b(le|la|les|et|ou|mais|dans|sur|à|pour|de|avec|par)\b/gi;
 
     const englishMatches = (text.match(englishWords) || []).length;
-    const spanishMatches = (text.match(spanishWords) || []).length;
+    const spanishMatches = (text.match(spanishWords) && []).length;
     const frenchMatches = (text.match(frenchWords) || []).length;
 
killedBy: OCRProcessor extractTextFromBuffer should handle low confidence OCR results
statusReason: expected 'Image OCR Error: Cannot read properti…' to contain 'Low confidence'

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:199:29
       /\b(le|la|les|et|ou|mais|dans|sur|à|pour|de|avec|par)\b/gi;
 
     const englishMatches = (text.match(englishWords) || []).length;
-    const spanishMatches = (text.match(spanishWords) || []).length;
+    const spanishMatches = (false).length;
     const frenchMatches = (text.match(frenchWords) || []).length;
 
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:200:28
 
     const englishMatches = (text.match(englishWords) || []).length;
     const spanishMatches = (text.match(spanishWords) || []).length;
-    const frenchMatches = (text.match(frenchWords) || []).length;
+    const frenchMatches = (false).length;
 
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:200:28
 
     const englishMatches = (text.match(englishWords) || []).length;
     const spanishMatches = (text.match(spanishWords) || []).length;
-    const frenchMatches = (text.match(frenchWords) || []).length;
+    const frenchMatches = (true).length;
 
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] MethodExpression
src/lib/processors/ocr-processor.ts:202:24
     const spanishMatches = (text.match(spanishWords) || []).length;
     const frenchMatches = (text.match(frenchWords) || []).length;
 
-    const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
+    const maxMatches = Math.min(englishMatches, spanishMatches, frenchMatches);
 
     if (maxMatches === 0) return "unknown";
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:204:9
 
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
 
-    if (maxMatches === 0) return "unknown";
+    if (false) return "unknown";
     if (maxMatches === englishMatches) return "en";
     if (maxMatches === spanishMatches) return "es";
killedBy: OCRProcessor Language detection should return unknown for ambiguous text
statusReason: expected 'en' to be 'unknown' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:204:9
 
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
 
-    if (maxMatches === 0) return "unknown";
+    if (true) return "unknown";
     if (maxMatches === englishMatches) return "en";
     if (maxMatches === spanishMatches) return "es";
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:205:9
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
 
     if (maxMatches === 0) return "unknown";
-    if (maxMatches === englishMatches) return "en";
+    if (false) return "en";
     if (maxMatches === spanishMatches) return "es";
     if (maxMatches === frenchMatches) return "fr";
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] EqualityOperator
src/lib/processors/ocr-processor.ts:205:9
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
 
     if (maxMatches === 0) return "unknown";
-    if (maxMatches === englishMatches) return "en";
+    if (maxMatches !== englishMatches) return "en";
     if (maxMatches === spanishMatches) return "es";
     if (maxMatches === frenchMatches) return "fr";
killedBy: OCRProcessor Language detection should detect English text
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:206:9
 
     if (maxMatches === 0) return "unknown";
     if (maxMatches === englishMatches) return "en";
-    if (maxMatches === spanishMatches) return "es";
+    if (false) return "es";
     if (maxMatches === frenchMatches) return "fr";
 
killedBy: OCRProcessor Language detection should detect Spanish text
statusReason: expected 'unknown' to be 'es' // Object.is equality

[Killed] EqualityOperator
src/lib/processors/ocr-processor.ts:206:9
 
     if (maxMatches === 0) return "unknown";
     if (maxMatches === englishMatches) return "en";
-    if (maxMatches === spanishMatches) return "es";
+    if (maxMatches !== spanishMatches) return "es";
     if (maxMatches === frenchMatches) return "fr";
 
killedBy: OCRProcessor Language detection should detect Spanish text
statusReason: expected 'unknown' to be 'es' // Object.is equality
