[NoCoverage] EqualityOperator
src/lib/processors/ocr-processor.ts:207:9
     if (maxMatches === 0) return "unknown";
     if (maxMatches === englishMatches) return "en";
     if (maxMatches === spanishMatches) return "es";
-    if (maxMatches === frenchMatches) return "fr";
+    if (maxMatches !== frenchMatches) return "fr";
 
     return "unknown";

[NoCoverage] ConditionalExpression
src/lib/processors/ocr-processor.ts:207:9
     if (maxMatches === 0) return "unknown";
     if (maxMatches === englishMatches) return "en";
     if (maxMatches === spanishMatches) return "es";
-    if (maxMatches === frenchMatches) return "fr";
+    if (false) return "fr";
 
     return "unknown";

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:215:36
   /**
    * Clean up OCR worker
    */
-  async terminate(): Promise<void> {
-    if (this.worker) {
-      await this.worker.terminate();
-      this.worker = null;
-    }
-  }
+  async terminate(): Promise<void> {}
 
   /**
killedBy: OCRProcessor Worker management should terminate worker
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:216:22
    * Clean up OCR worker
    */
   async terminate(): Promise<void> {
-    if (this.worker) {
-      await this.worker.terminate();
-      this.worker = null;
-    }
+    if (this.worker) {}
   }
 
killedBy: OCRProcessor Worker management should terminate worker
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/lib/processors/ocr-processor.ts:216:9
    * Clean up OCR worker
    */
   async terminate(): Promise<void> {
-    if (this.worker) {
+    if (false) {
       await this.worker.terminate();
       this.worker = null;
killedBy: OCRProcessor Worker management should terminate worker
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/lib/processors/ocr-processor.ts:225:37
   /**
    * Get supported languages (basic list)
    */
-  getSupportedLanguages(): string[] {
-    return [
-      "eng", // English
-      "spa", // Spanish
-      "fra", // French
-      "deu", // German
-      "ita", // Italian
-      "por", // Portuguese
-      "rus", // Russian
-      "ara", // Arabic
-      "chi_sim", // Chinese Simplified
-      "jpn", // Japanese
-    ];
-  }
+  getSupportedLanguages(): string[] {}
 }
 
killedBy: OCRProcessor Supported languages should return list of supported languages
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
src/lib/processors/ocr-processor.ts:229:7
     return [
       "eng", // English
       "spa", // Spanish
-      "fra", // French
+      "", // French
       "deu", // German
       "ita", // Italian
killedBy: OCRProcessor Supported languages should return list of supported languages
statusReason: expected [ Array(10) ] to include 'fra'

[Survived] StringLiteral
src/lib/processors/ocr-processor.ts:232:7
       "fra", // French
       "deu", // German
       "ita", // Italian
-      "por", // Portuguese
+      "", // Portuguese
       "rus", // Russian
       "ara", // Arabic

[Survived] StringLiteral
src/lib/processors/ocr-processor.ts:235:7
       "por", // Portuguese
       "rus", // Russian
       "ara", // Arabic
-      "chi_sim", // Chinese Simplified
+      "", // Chinese Simplified
       "jpn", // Japanese
     ];
