[Killed] BlockStatement
src/lib/processors/office-processor.ts:36:9
     text: string;
     metadata: OfficeContentMetadata;
   }> {
-    try {
-      switch (contentType) {
-        case ContentType.OFFICE_DOC:
-          return await this.extractDocxFromBuffer(buffer);
-        case ContentType.OFFICE_SHEET:
-          return await this.extractXlsxFromBuffer(buffer);
-        case ContentType.OFFICE_PRESENTATION:
-          return await this.extractPptxFromBuffer(buffer);
-        default:
-          throw new Error(`Unsupported Office document type: ${contentType}`);
-      }
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : String(error);
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:38:9
   }> {
     try {
       switch (contentType) {
-        case ContentType.OFFICE_DOC:
-          return await this.extractDocxFromBuffer(buffer);
+        case ContentType.OFFICE_DOC:
         case ContentType.OFFICE_SHEET:
           return await this.extractXlsxFromBuffer(buffer);
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'Excel Document Error: Cannot read pro…' to be 'This is the content of a Word documen…' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:40:9
       switch (contentType) {
         case ContentType.OFFICE_DOC:
           return await this.extractDocxFromBuffer(buffer);
-        case ContentType.OFFICE_SHEET:
-          return await this.extractXlsxFromBuffer(buffer);
+        case ContentType.OFFICE_SHEET:
         case ContentType.OFFICE_PRESENTATION:
           return await this.extractPptxFromBuffer(buffer);
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should extract data from a valid XLSX buffer
statusReason: expected 'PowerPoint Presentation: Text extract…' to contain '=== Sheet1 ==='

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:42:9
           return await this.extractDocxFromBuffer(buffer);
         case ContentType.OFFICE_SHEET:
           return await this.extractXlsxFromBuffer(buffer);
-        case ContentType.OFFICE_PRESENTATION:
-          return await this.extractPptxFromBuffer(buffer);
+        case ContentType.OFFICE_PRESENTATION:
         default:
           throw new Error(`Unsupported Office document type: ${contentType}`);
killedBy: OfficeProcessor extractTextFromBuffer - PPTX should handle PPTX files (placeholder implementation)
statusReason: expected 'Office Document Error: Unsupported Of…' to contain 'Text extraction not yet implemented f…'

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:44:9
           return await this.extractXlsxFromBuffer(buffer);
         case ContentType.OFFICE_PRESENTATION:
           return await this.extractPptxFromBuffer(buffer);
-        default:
-          throw new Error(`Unsupported Office document type: ${contentType}`);
+        default:
       }
     } catch (error) {
killedBy: OfficeProcessor Error handling should handle unsupported Office document types
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/office-processor.ts:47:21
         default:
           throw new Error(`Unsupported Office document type: ${contentType}`);
       }
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OfficeContentMetadata = {
-        type: contentType,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Office Document Error: ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 
killedBy: OfficeProcessor Error handling should handle unsupported Office document types
statusReason: Cannot read properties of undefined (reading 'text')

[Survived] StringLiteral
src/lib/processors/office-processor.ts:53:19
 
       const contentMetadata: OfficeContentMetadata = {
         type: contentType,
-        language: "unknown",
+        language: "",
         encoding: "unknown",
         hasText: false,

[Killed] BooleanLiteral
src/lib/processors/office-processor.ts:55:18
         type: contentType,
         language: "unknown",
         encoding: "unknown",
-        hasText: false,
+        hasText: true,
         wordCount: 0,
         characterCount: 0,
killedBy: OfficeProcessor Error handling should handle unsupported Office document types
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/processors/office-processor.ts:76:6
   ): Promise<{
     text: string;
     metadata: OfficeContentMetadata;
-  }> {
-    try {
-      const buffer = fs.readFileSync(filePath);
-      return await this.extractTextFromBuffer(buffer, contentType);
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OfficeContentMetadata = {
-        type: contentType,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Office Document Error: Failed to read file - ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
-  }
+  }> {}
 
   /**
killedBy: OfficeProcessor extractTextFromFile should read file and process Office document
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/office-processor.ts:77:9
     text: string;
     metadata: OfficeContentMetadata;
   }> {
-    try {
-      const buffer = fs.readFileSync(filePath);
-      return await this.extractTextFromBuffer(buffer, contentType);
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : String(error);
killedBy: OfficeProcessor extractTextFromFile should read file and process Office document
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/office-processor.ts:80:21
     try {
       const buffer = fs.readFileSync(filePath);
       return await this.extractTextFromBuffer(buffer, contentType);
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OfficeContentMetadata = {
-        type: contentType,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Office Document Error: Failed to read file - ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 
killedBy: OfficeProcessor extractTextFromFile should handle file read errors
statusReason: Cannot read properties of undefined (reading 'text')

[Survived] MethodExpression
src/lib/processors/office-processor.ts:110:20
     try {
       const result = await mammoth.extractRawText({ buffer });
 
-      const text = result.value.trim();
+      const text = result.value;
       const words = text.split(/\s+/).filter((word) => word.length > 0);
       const hasText = text.length > 0 && words.length > 0;

[Killed] EqualityOperator
src/lib/processors/office-processor.ts:111:56
       const result = await mammoth.extractRawText({ buffer });
 
       const text = result.value.trim();
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter((word) => word.length <= 0);
       const hasText = text.length > 0 && words.length > 0;
 
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'Word Document: No readable text conte…' to be 'This is the content of a Word documen…' // Object.is equality

[Killed] ArrowFunction
src/lib/processors/office-processor.ts:111:46
       const result = await mammoth.extractRawText({ buffer });
 
       const text = result.value.trim();
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter(() => undefined);
       const hasText = text.length > 0 && words.length > 0;
 
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'Word Document: No readable text conte…' to be 'This is the content of a Word documen…' // Object.is equality

[Killed] EqualityOperator
src/lib/processors/office-processor.ts:112:42
 
       const text = result.value.trim();
       const words = text.split(/\s+/).filter((word) => word.length > 0);
-      const hasText = text.length > 0 && words.length > 0;
+      const hasText = text.length > 0 && words.length <= 0;
 
       // Try to extract some basic metadata from the XML structure
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'Word Document: No readable text conte…' to be 'This is the content of a Word documen…' // Object.is equality

[Killed] EqualityOperator
src/lib/processors/office-processor.ts:112:23
 
       const text = result.value.trim();
       const words = text.split(/\s+/).filter((word) => word.length > 0);
-      const hasText = text.length > 0 && words.length > 0;
+      const hasText = text.length <= 0 && words.length > 0;
 
       // Try to extract some basic metadata from the XML structure
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'Word Document: No readable text conte…' to be 'This is the content of a Word documen…' // Object.is equality

[Killed] BlockStatement
src/lib/processors/office-processor.ts:138:21
         text: finalText,
         metadata: contentMetadata,
       };
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OfficeContentMetadata = {
-        type: ContentType.OFFICE_DOC,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Word Document Error: ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should handle DOCX processing errors
statusReason: Cannot read properties of undefined (reading 'text')

[Survived] StringLiteral
src/lib/processors/office-processor.ts:166:50
     metadata: OfficeContentMetadata;
   }> {
     try {
-      const workbook = XLSX.read(buffer, { type: "buffer" });
+      const workbook = XLSX.read(buffer, { type: "" });
 
       let allText = "";

[Killed] StringLiteral
src/lib/processors/office-processor.ts:168:21
     try {
       const workbook = XLSX.read(buffer, { type: "buffer" });
 
-      let allText = "";
+      let allText = "Stryker was here!";
       const sheetNames: string[] = [];
       let totalCells = 0;
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should handle XLSX files with no data
statusReason: expected 'Stryker was here!' to contain 'Excel Spreadsheet'

[Killed] BlockStatement
src/lib/processors/office-processor.ts:173:50
       let totalCells = 0;
 
       // Extract text from all worksheets
-      workbook.SheetNames.forEach((sheetName) => {
-        sheetNames.push(sheetName);
-        const worksheet = workbook.Sheets[sheetName];
-
-        // Convert sheet to CSV-like text
-        const csvText = XLSX.utils.sheet_to_csv(worksheet);
-        if (csvText.trim()) {
-          allText += `\n=== ${sheetName} ===\n${csvText}\n`;
-        }
-
-        // Count cells with content
-        const range = XLSX.utils.decode_range(worksheet["!ref"] || "A1:A1");
-        for (let row = range.s.r; row <= range.e.r; row++) {
-          for (let col = range.s.c; col <= range.e.c; col++) {
-            const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });
-            if (
-              worksheet[cellAddress] &&
-              worksheet[cellAddress].v !== undefined
-            ) {
-              totalCells++;
-            }
-          }
-        }
-      });
+      workbook.SheetNames.forEach((sheetName) => {});
 
       const text = allText.trim();
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should extract data from a valid XLSX buffer
statusReason: expected 'Excel Spreadsheet: 0 sheet(s), 0 cell…' to contain '=== Sheet1 ==='

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:179:13
 
         // Convert sheet to CSV-like text
         const csvText = XLSX.utils.sheet_to_csv(worksheet);
-        if (csvText.trim()) {
+        if (true) {
           allText += `\n=== ${sheetName} ===\n${csvText}\n`;
         }
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should handle XLSX files with no data
statusReason: expected '=== Sheet1 ===' to contain 'Excel Spreadsheet'

[Killed] BlockStatement
src/lib/processors/office-processor.ts:179:29
 
         // Convert sheet to CSV-like text
         const csvText = XLSX.utils.sheet_to_csv(worksheet);
-        if (csvText.trim()) {
-          allText += `\n=== ${sheetName} ===\n${csvText}\n`;
-        }
+        if (csvText.trim()) {}
 
         // Count cells with content
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should extract data from a valid XLSX buffer
statusReason: expected 'Excel Spreadsheet: 2 sheet(s), 0 cell…' to contain '=== Sheet1 ==='

[Survived] LogicalOperator
src/lib/processors/office-processor.ts:184:47
         }
 
         // Count cells with content
-        const range = XLSX.utils.decode_range(worksheet["!ref"] || "A1:A1");
+        const range = XLSX.utils.decode_range(worksheet["!ref"] && "A1:A1");
         for (let row = range.s.r; row <= range.e.r; row++) {
           for (let col = range.s.c; col <= range.e.c; col++) {

[Survived] ConditionalExpression
src/lib/processors/office-processor.ts:184:47
         }
 
         // Count cells with content
-        const range = XLSX.utils.decode_range(worksheet["!ref"] || "A1:A1");
+        const range = XLSX.utils.decode_range(false);
         for (let row = range.s.r; row <= range.e.r; row++) {
           for (let col = range.s.c; col <= range.e.c; col++) {

[Survived] ConditionalExpression
src/lib/processors/office-processor.ts:185:35
 
         // Count cells with content
         const range = XLSX.utils.decode_range(worksheet["!ref"] || "A1:A1");
-        for (let row = range.s.r; row <= range.e.r; row++) {
+        for (let row = range.s.r; false; row++) {
           for (let col = range.s.c; col <= range.e.c; col++) {
             const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });

[Survived] EqualityOperator
src/lib/processors/office-processor.ts:185:35
 
         // Count cells with content
         const range = XLSX.utils.decode_range(worksheet["!ref"] || "A1:A1");
-        for (let row = range.s.r; row <= range.e.r; row++) {
+        for (let row = range.s.r; row > range.e.r; row++) {
           for (let col = range.s.c; col <= range.e.c; col++) {
             const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });

[Timeout] UpdateOperator
src/lib/processors/office-processor.ts:186:55
         // Count cells with content
         const range = XLSX.utils.decode_range(worksheet["!ref"] || "A1:A1");
         for (let row = range.s.r; row <= range.e.r; row++) {
-          for (let col = range.s.c; col <= range.e.c; col++) {
+          for (let col = range.s.c; col <= range.e.c; col--) {
             const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });
             if (

[Survived] ConditionalExpression
src/lib/processors/office-processor.ts:186:37
         // Count cells with content
         const range = XLSX.utils.decode_range(worksheet["!ref"] || "A1:A1");
         for (let row = range.s.r; row <= range.e.r; row++) {
-          for (let col = range.s.c; col <= range.e.c; col++) {
+          for (let col = range.s.c; false; col++) {
             const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });
             if (

[Killed] LogicalOperator
src/lib/processors/office-processor.ts:189:15
           for (let col = range.s.c; col <= range.e.c; col++) {
             const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });
             if (
-              worksheet[cellAddress] &&
-              worksheet[cellAddress].v !== undefined
+              worksheet[cellAddress] || worksheet[cellAddress].v !== undefined
             ) {
               totalCells++;
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should extract data from a valid XLSX buffer
statusReason: expected 'Excel Document Error: Cannot read pro…' to contain '=== Sheet1 ==='

[Survived] ConditionalExpression
src/lib/processors/office-processor.ts:189:15
           for (let col = range.s.c; col <= range.e.c; col++) {
             const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });
             if (
-              worksheet[cellAddress] &&
-              worksheet[cellAddress].v !== undefined
+              false
             ) {
               totalCells++;

[NoCoverage] ConditionalExpression
src/lib/processors/office-processor.ts:190:15
             const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });
             if (
               worksheet[cellAddress] &&
-              worksheet[cellAddress].v !== undefined
+              true
             ) {
               totalCells++;

[NoCoverage] EqualityOperator
src/lib/processors/office-processor.ts:190:15
             const cellAddress = XLSX.utils.encode_cell({ r: row, c: col });
             if (
               worksheet[cellAddress] &&
-              worksheet[cellAddress].v !== undefined
+              worksheet[cellAddress].v === undefined
             ) {
               totalCells++;

[NoCoverage] BlockStatement
src/lib/processors/office-processor.ts:191:15
             if (
               worksheet[cellAddress] &&
               worksheet[cellAddress].v !== undefined
-            ) {
-              totalCells++;
-            }
+            ) {}
           }
         }

[NoCoverage] UpdateOperator
src/lib/processors/office-processor.ts:192:15
               worksheet[cellAddress] &&
               worksheet[cellAddress].v !== undefined
             ) {
-              totalCells++;
+              totalCells--;
             }
           }

[Survived] MethodExpression
src/lib/processors/office-processor.ts:198:20
         }
       });
 
-      const text = allText.trim();
+      const text = allText;
       const words = text.split(/\s+/).filter((word) => word.length > 0);
       const hasText = text.length > 0 && words.length > 0;

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:199:56
       });
 
       const text = allText.trim();
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter((word) => false);
       const hasText = text.length > 0 && words.length > 0;
 
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should extract data from a valid XLSX buffer
statusReason: expected 'Excel Spreadsheet: 2 sheet(s), 0 cell…' to contain '=== Sheet1 ==='

[Killed] ArrowFunction
src/lib/processors/office-processor.ts:199:46
       });
 
       const text = allText.trim();
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter(() => undefined);
       const hasText = text.length > 0 && words.length > 0;
 
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should extract data from a valid XLSX buffer
statusReason: expected 'Excel Spreadsheet: 2 sheet(s), 0 cell…' to contain '=== Sheet1 ==='

[Killed] ObjectLiteral
src/lib/processors/office-processor.ts:208:54
         application: "Microsoft Excel",
       };
 
-      const contentMetadata: OfficeContentMetadata = {
-        type: ContentType.OFFICE_SHEET,
-        language: this.detectLanguage(text),
-        encoding: "utf-8",
-        hasText,
-        wordCount: words.length,
-        characterCount: text.length,
-        officeMetadata,
-      };
+      const contentMetadata: OfficeContentMetadata = {};
 
       const finalText = hasText
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should extract data from a valid XLSX buffer
statusReason: expected undefined to be 'office_spreadsheet' // Object.is equality

[Killed] StringLiteral
src/lib/processors/office-processor.ts:220:11
 
       const finalText = hasText
         ? text
-        : `Excel Spreadsheet: ${sheetNames.length} sheet(s), ${totalCells} cells with content`;
+        : ``;
 
       return {
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should handle XLSX files with no data
statusReason: expected '' to contain 'Excel Spreadsheet'

[Killed] BlockStatement
src/lib/processors/office-processor.ts:226:21
         text: finalText,
         metadata: contentMetadata,
       };
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OfficeContentMetadata = {
-        type: ContentType.OFFICE_SHEET,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Excel Document Error: ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 
killedBy: OfficeProcessor extractTextFromBuffer - XLSX should handle XLSX processing errors
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/office-processor.ts:253:9
     text: string;
     metadata: OfficeContentMetadata;
   }> {
-    try {
-      // For now, provide basic PPTX handling
-      // A full implementation would require extracting text from slide XML files
-      // This is a placeholder that could be enhanced with additional libraries
-
-      const contentMetadata: OfficeContentMetadata = {
-        type: ContentType.OFFICE_PRESENTATION,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-        officeMetadata: {
-          application: "Microsoft PowerPoint",
-        },
-      };
-
-      return {
-        text: "PowerPoint Presentation: Text extraction not yet implemented for PPTX files",
-        metadata: contentMetadata,
-      };
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : String(error);
killedBy: OfficeProcessor extractTextFromBuffer - PPTX should handle PPTX files (placeholder implementation)
statusReason: Cannot read properties of undefined (reading 'text')

[Survived] StringLiteral
src/lib/processors/office-processor.ts:260:19
 
       const contentMetadata: OfficeContentMetadata = {
         type: ContentType.OFFICE_PRESENTATION,
-        language: "unknown",
+        language: "",
         encoding: "unknown",
         hasText: false,

[Survived] StringLiteral
src/lib/processors/office-processor.ts:261:19
       const contentMetadata: OfficeContentMetadata = {
         type: ContentType.OFFICE_PRESENTATION,
         language: "unknown",
-        encoding: "unknown",
+        encoding: "",
         hasText: false,
         wordCount: 0,

[Survived] ObjectLiteral
src/lib/processors/office-processor.ts:265:25
         hasText: false,
         wordCount: 0,
         characterCount: 0,
-        officeMetadata: {
-          application: "Microsoft PowerPoint",
-        },
+        officeMetadata: {},
       };
 

[NoCoverage] BlockStatement
src/lib/processors/office-processor.ts:274:21
         text: "PowerPoint Presentation: Text extraction not yet implemented for PPTX files",
         metadata: contentMetadata,
       };
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: OfficeContentMetadata = {
-        type: ContentType.OFFICE_PRESENTATION,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `PowerPoint Document Error: ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 

[Killed] ArrayDeclaration
src/lib/processors/office-processor.ts:302:24
     type?: ContentType;
   } {
     // Office document signatures
-    const signatures = [
-      { signature: Buffer.from([0x50, 0x4b, 0x03, 0x04]), type: "zip-based" }, // PK.. (ZIP/OFFICE)
-    ];
+    const signatures = [];
 
     const isZipBased = signatures.some((sig) =>
killedBy: OfficeProcessor isSupportedOfficeDocument should validate DOCX files
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/processors/office-processor.ts:303:7
   } {
     // Office document signatures
     const signatures = [
-      { signature: Buffer.from([0x50, 0x4b, 0x03, 0x04]), type: "zip-based" }, // PK.. (ZIP/OFFICE)
+      {}, // PK.. (ZIP/OFFICE)
     ];
 
killedBy: OfficeProcessor isSupportedOfficeDocument should validate DOCX files
statusReason: The "otherBuffer" argument must be an instance of Buffer or Uint8Array. Received undefined

[Killed] ArrowFunction
src/lib/processors/office-processor.ts:306:40
       { signature: Buffer.from([0x50, 0x4b, 0x03, 0x04]), type: "zip-based" }, // PK.. (ZIP/OFFICE)
     ];
 
-    const isZipBased = signatures.some((sig) =>
-      buffer.subarray(0, 4).equals(sig.signature)
+    const isZipBased = signatures.some(() => undefined
     );
 
killedBy: OfficeProcessor isSupportedOfficeDocument should validate DOCX files
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/lib/processors/office-processor.ts:306:24
       { signature: Buffer.from([0x50, 0x4b, 0x03, 0x04]), type: "zip-based" }, // PK.. (ZIP/OFFICE)
     ];
 
-    const isZipBased = signatures.some((sig) =>
-      buffer.subarray(0, 4).equals(sig.signature)
-    );
+    const isZipBased = signatures.every(sig => buffer.subarray(0, 4).equals(sig.signature));
 
     if (!isZipBased) {

[Killed] BooleanLiteral
src/lib/processors/office-processor.ts:310:9
       buffer.subarray(0, 4).equals(sig.signature)
     );
 
-    if (!isZipBased) {
+    if (isZipBased) {
       return { supported: false };
     }
killedBy: OfficeProcessor isSupportedOfficeDocument should validate DOCX files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:310:9
       buffer.subarray(0, 4).equals(sig.signature)
     );
 
-    if (!isZipBased) {
+    if (true) {
       return { supported: false };
     }
killedBy: OfficeProcessor isSupportedOfficeDocument should validate DOCX files
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/processors/office-processor.ts:311:27
     );
 
     if (!isZipBased) {
-      return { supported: false };
+      return { supported: true };
     }
 
killedBy: OfficeProcessor isSupportedOfficeDocument should reject non-Office files
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/lib/processors/office-processor.ts:311:14
     );
 
     if (!isZipBased) {
-      return { supported: false };
+      return {};
     }
 
killedBy: OfficeProcessor isSupportedOfficeDocument should reject non-Office files
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
src/lib/processors/office-processor.ts:317:52
     // Check for Office document content types by examining ZIP structure
     // This is a simplified check - in production, you'd parse the ZIP and check [Content_Types].xml
     const docxMarker = buffer.includes(Buffer.from("word/"));
-    const xlsxMarker = buffer.includes(Buffer.from("xl/"));
+    const xlsxMarker = buffer.includes(Buffer.from(""));
     const pptxMarker = buffer.includes(Buffer.from("ppt/"));
 
killedBy: OfficeProcessor isSupportedOfficeDocument should validate PPTX files
statusReason: expected 'office_spreadsheet' to be 'office_presentation' // Object.is equality

[Survived] StringLiteral
src/lib/processors/office-processor.ts:318:52
     // This is a simplified check - in production, you'd parse the ZIP and check [Content_Types].xml
     const docxMarker = buffer.includes(Buffer.from("word/"));
     const xlsxMarker = buffer.includes(Buffer.from("xl/"));
-    const pptxMarker = buffer.includes(Buffer.from("ppt/"));
+    const pptxMarker = buffer.includes(Buffer.from(""));
 
     if (docxMarker) {

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:320:9
     const xlsxMarker = buffer.includes(Buffer.from("xl/"));
     const pptxMarker = buffer.includes(Buffer.from("ppt/"));
 
-    if (docxMarker) {
+    if (true) {
       return { supported: true, type: ContentType.OFFICE_DOC };
     } else if (xlsxMarker) {
killedBy: OfficeProcessor isSupportedOfficeDocument should validate XLSX files
statusReason: expected 'office_document' to be 'office_spreadsheet' // Object.is equality
