[Killed] BlockStatement
src/lib/processors/office-processor.ts:320:21
     const xlsxMarker = buffer.includes(Buffer.from("xl/"));
     const pptxMarker = buffer.includes(Buffer.from("ppt/"));
 
-    if (docxMarker) {
-      return { supported: true, type: ContentType.OFFICE_DOC };
-    } else if (xlsxMarker) {
+    if (docxMarker) {} else if (xlsxMarker) {
       return { supported: true, type: ContentType.OFFICE_SHEET };
     } else if (pptxMarker) {
killedBy: OfficeProcessor isSupportedOfficeDocument should validate DOCX files
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/processors/office-processor.ts:321:27
     const pptxMarker = buffer.includes(Buffer.from("ppt/"));
 
     if (docxMarker) {
-      return { supported: true, type: ContentType.OFFICE_DOC };
+      return { supported: false, type: ContentType.OFFICE_DOC };
     } else if (xlsxMarker) {
       return { supported: true, type: ContentType.OFFICE_SHEET };
killedBy: OfficeProcessor isSupportedOfficeDocument should validate DOCX files
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/processors/office-processor.ts:322:28
 
     if (docxMarker) {
       return { supported: true, type: ContentType.OFFICE_DOC };
-    } else if (xlsxMarker) {
-      return { supported: true, type: ContentType.OFFICE_SHEET };
-    } else if (pptxMarker) {
+    } else if (xlsxMarker) {} else if (pptxMarker) {
       return { supported: true, type: ContentType.OFFICE_PRESENTATION };
     }
killedBy: OfficeProcessor isSupportedOfficeDocument should validate XLSX files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:322:16
 
     if (docxMarker) {
       return { supported: true, type: ContentType.OFFICE_DOC };
-    } else if (xlsxMarker) {
+    } else if (true) {
       return { supported: true, type: ContentType.OFFICE_SHEET };
     } else if (pptxMarker) {
killedBy: OfficeProcessor isSupportedOfficeDocument should validate PPTX files
statusReason: expected 'office_spreadsheet' to be 'office_presentation' // Object.is equality

[Killed] BooleanLiteral
src/lib/processors/office-processor.ts:323:27
     if (docxMarker) {
       return { supported: true, type: ContentType.OFFICE_DOC };
     } else if (xlsxMarker) {
-      return { supported: true, type: ContentType.OFFICE_SHEET };
+      return { supported: false, type: ContentType.OFFICE_SHEET };
     } else if (pptxMarker) {
       return { supported: true, type: ContentType.OFFICE_PRESENTATION };
killedBy: OfficeProcessor isSupportedOfficeDocument should validate XLSX files
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/processors/office-processor.ts:324:28
       return { supported: true, type: ContentType.OFFICE_DOC };
     } else if (xlsxMarker) {
       return { supported: true, type: ContentType.OFFICE_SHEET };
-    } else if (pptxMarker) {
-      return { supported: true, type: ContentType.OFFICE_PRESENTATION };
-    }
+    } else if (pptxMarker) {}
 
     return { supported: false };
killedBy: OfficeProcessor isSupportedOfficeDocument should validate PPTX files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:324:16
       return { supported: true, type: ContentType.OFFICE_DOC };
     } else if (xlsxMarker) {
       return { supported: true, type: ContentType.OFFICE_SHEET };
-    } else if (pptxMarker) {
+    } else if (false) {
       return { supported: true, type: ContentType.OFFICE_PRESENTATION };
     }
killedBy: OfficeProcessor isSupportedOfficeDocument should validate PPTX files
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/processors/office-processor.ts:325:27
     } else if (xlsxMarker) {
       return { supported: true, type: ContentType.OFFICE_SHEET };
     } else if (pptxMarker) {
-      return { supported: true, type: ContentType.OFFICE_PRESENTATION };
+      return { supported: false, type: ContentType.OFFICE_PRESENTATION };
     }
 
killedBy: OfficeProcessor isSupportedOfficeDocument should validate PPTX files
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/lib/processors/office-processor.ts:328:25
       return { supported: true, type: ContentType.OFFICE_PRESENTATION };
     }
 
-    return { supported: false };
+    return { supported: true };
   }
 

[NoCoverage] ObjectLiteral
src/lib/processors/office-processor.ts:328:12
       return { supported: true, type: ContentType.OFFICE_PRESENTATION };
     }
 
-    return { supported: false };
+    return {};
   }
 

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:344:29
     const frenchWords =
       /\b(le|la|les|et|ou|mais|dans|sur|à|pour|de|avec|par)\b/gi;
 
-    const englishMatches = (text.match(englishWords) || []).length;
+    const englishMatches = (false).length;
     const spanishMatches = (text.match(spanishWords) || []).length;
     const frenchMatches = (text.match(frenchWords) || []).length;
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/office-processor.ts:345:29
       /\b(le|la|les|et|ou|mais|dans|sur|à|pour|de|avec|par)\b/gi;
 
     const englishMatches = (text.match(englishWords) || []).length;
-    const spanishMatches = (text.match(spanishWords) || []).length;
+    const spanishMatches = (true).length;
     const frenchMatches = (text.match(frenchWords) || []).length;
 
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'unknown' to be 'en' // Object.is equality

[Killed] LogicalOperator
src/lib/processors/office-processor.ts:346:28
 
     const englishMatches = (text.match(englishWords) || []).length;
     const spanishMatches = (text.match(spanishWords) || []).length;
-    const frenchMatches = (text.match(frenchWords) || []).length;
+    const frenchMatches = (text.match(frenchWords) && []).length;
 
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'Word Document Error: Cannot read prop…' to be 'This is the content of a Word documen…' // Object.is equality

[Killed] EqualityOperator
src/lib/processors/office-processor.ts:350:9
 
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
 
-    if (maxMatches === 0) return "unknown";
+    if (maxMatches !== 0) return "unknown";
     if (maxMatches === englishMatches) return "en";
     if (maxMatches === spanishMatches) return "es";
killedBy: OfficeProcessor extractTextFromBuffer - DOCX should extract text from a valid DOCX buffer
statusReason: expected 'unknown' to be 'en' // Object.is equality

[NoCoverage] ConditionalExpression
src/lib/processors/office-processor.ts:353:9
     if (maxMatches === 0) return "unknown";
     if (maxMatches === englishMatches) return "en";
     if (maxMatches === spanishMatches) return "es";
-    if (maxMatches === frenchMatches) return "fr";
+    if (true) return "fr";
 
     return "unknown";

[NoCoverage] StringLiteral
src/lib/processors/office-processor.ts:355:12
     if (maxMatches === spanishMatches) return "es";
     if (maxMatches === frenchMatches) return "fr";
 
-    return "unknown";
+    return "";
   }
 }
