[Killed] BooleanLiteral
src/lib/processors/speech-processor.ts:30:25
 export class SpeechProcessor {
   private model: any = null;
   private recognizer: any = null;
-  private initialized = false;
+  private initialized = true;
 
   /**
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: Speech recognition model not a…' to be 'This is a test transcription.' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:36:9
    * Initialize the speech recognition model
    */
   async initialize(): Promise<void> {
-    if (this.initialized) return;
+    if (true) return;
 
     try {
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: Speech recognition model not a…' to be 'This is a test transcription.' // Object.is equality

[Survived] ConditionalExpression
src/lib/processors/speech-processor.ts:36:9
    * Initialize the speech recognition model
    */
   async initialize(): Promise<void> {
-    if (this.initialized) return;
+    if (false) return;
 
     try {

[Survived] StringLiteral
src/lib/processors/speech-processor.ts:49:11
         joiner:
           "./models/sherpa-onnx-streaming-zipformer-en-2023-06-26/joiner-epoch-99-avg-1.onnx",
         tokens:
-          "./models/sherpa-onnx-streaming-zipformer-en-2023-06-26/tokens.txt",
+          "",
         numThreads: 2,
         provider: "cpu",

[Survived] ObjectLiteral
src/lib/processors/speech-processor.ts:54:50
         provider: "cpu",
       };
 
-      const recognizerConfig: RecognizerConfig = {
-        modelConfig,
-        decodingMethod: "greedy_search",
-        maxActivePaths: 4,
-        enableEndpoint: true,
-        rule1MinTrailingSilence: 2.4,
-        rule2MinTrailingSilence: 1.2,
-        rule3MinUtteranceLength: 20,
-      };
+      const recognizerConfig: RecognizerConfig = {};
 
       // Create model and recognizer

[Survived] BooleanLiteral
src/lib/processors/speech-processor.ts:58:25
         modelConfig,
         decodingMethod: "greedy_search",
         maxActivePaths: 4,
-        enableEndpoint: true,
+        enableEndpoint: false,
         rule1MinTrailingSilence: 2.4,
         rule2MinTrailingSilence: 1.2,

[Killed] BooleanLiteral
src/lib/processors/speech-processor.ts:68:26
       this.model = createModel(modelConfig);
       this.recognizer = createRecognizer(recognizerConfig);
 
-      this.initialized = true;
+      this.initialized = false;
     } catch (error) {
       console.warn("Speech recognition model initialization failed:", error);
killedBy: SpeechProcessor Initialization and cleanup should initialize on first use
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/lib/processors/speech-processor.ts:69:21
       this.recognizer = createRecognizer(recognizerConfig);
 
       this.initialized = true;
-    } catch (error) {
-      console.warn("Speech recognition model initialization failed:", error);
-      // Continue with limited functionality
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/lib/processors/speech-processor.ts:70:20
 
       this.initialized = true;
     } catch (error) {
-      console.warn("Speech recognition model initialization failed:", error);
+      console.warn("", error);
       // Continue with limited functionality
     }

[Killed] BooleanLiteral
src/lib/processors/speech-processor.ts:94:11
       const startTime = Date.now();
 
       // If we don't have a working model, return a placeholder
-      if (!this.recognizer) {
+      if (this.recognizer) {
         return this.createFallbackResult(
           "Speech recognition model not available",
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: Speech recognition model not a…' to be 'This is a test transcription.' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:94:11
       const startTime = Date.now();
 
       // If we don't have a working model, return a placeholder
-      if (!this.recognizer) {
+      if (true) {
         return this.createFallbackResult(
           "Speech recognition model not available",
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: Speech recognition model not a…' to be 'This is a test transcription.' // Object.is equality

[Killed] BooleanLiteral
src/lib/processors/speech-processor.ts:105:11
       // This is a simplified implementation - in practice, you'd need proper audio decoding
       const audioData = this.convertBufferToAudioData(buffer);
 
-      if (!audioData) {
+      if (audioData) {
         return this.createFallbackResult("Unsupported audio format", startTime);
       }
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: Unsupported audio format' to be 'This is a test transcription.' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:105:11
       // This is a simplified implementation - in practice, you'd need proper audio decoding
       const audioData = this.convertBufferToAudioData(buffer);
 
-      if (!audioData) {
+      if (false) {
         return this.createFallbackResult("Unsupported audio format", startTime);
       }
killedBy: SpeechProcessor transcribeFromBuffer should handle unsupported audio formats
statusReason: expected 'Audio: Speech processing error: Canno…' to contain 'Unsupported audio format'

[Timeout] AssignmentOperator
src/lib/processors/speech-processor.ts:116:45
       const stream = this.recognizer.createStream();
       const samplesPerChunk = 1024; // Process in chunks
 
-      for (let i = 0; i < audioData.length; i += samplesPerChunk) {
+      for (let i = 0; i < audioData.length; i -= samplesPerChunk) {
         const chunk = audioData.slice(i, i + samplesPerChunk);
         stream.acceptWaveform(chunk);

[Survived] ConditionalExpression
src/lib/processors/speech-processor.ts:116:23
       const stream = this.recognizer.createStream();
       const samplesPerChunk = 1024; // Process in chunks
 
-      for (let i = 0; i < audioData.length; i += samplesPerChunk) {
+      for (let i = 0; false; i += samplesPerChunk) {
         const chunk = audioData.slice(i, i + samplesPerChunk);
         stream.acceptWaveform(chunk);

[Survived] MethodExpression
src/lib/processors/speech-processor.ts:117:23
       const samplesPerChunk = 1024; // Process in chunks
 
       for (let i = 0; i < audioData.length; i += samplesPerChunk) {
-        const chunk = audioData.slice(i, i + samplesPerChunk);
+        const chunk = audioData;
         stream.acceptWaveform(chunk);
       }

[Survived] ArithmeticOperator
src/lib/processors/speech-processor.ts:117:42
       const samplesPerChunk = 1024; // Process in chunks
 
       for (let i = 0; i < audioData.length; i += samplesPerChunk) {
-        const chunk = audioData.slice(i, i + samplesPerChunk);
+        const chunk = audioData.slice(i, i - samplesPerChunk);
         stream.acceptWaveform(chunk);
       }

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:126:20
       const result = this.recognizer.getResult();
 
       const processingTime = Date.now() - startTime;
-      const text = result.text?.trim() || "";
+      const text = false;
       const words = text.split(/\s+/).filter((word) => word.length > 0);
       const hasText = text.length > 0 && words.length > 0;
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: Speech processing error: text.…' to be 'This is a test transcription.' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:126:20
       const result = this.recognizer.getResult();
 
       const processingTime = Date.now() - startTime;
-      const text = result.text?.trim() || "";
+      const text = true;
       const words = text.split(/\s+/).filter((word) => word.length > 0);
       const hasText = text.length > 0 && words.length > 0;
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: Speech processing error: text.…' to be 'This is a test transcription.' // Object.is equality

[Killed] ArrowFunction
src/lib/processors/speech-processor.ts:127:46
 
       const processingTime = Date.now() - startTime;
       const text = result.text?.trim() || "";
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter(() => undefined);
       const hasText = text.length > 0 && words.length > 0;
 
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: No speech detected or transcri…' to be 'This is a test transcription.' // Object.is equality

[Killed] EqualityOperator
src/lib/processors/speech-processor.ts:127:56
 
       const processingTime = Date.now() - startTime;
       const text = result.text?.trim() || "";
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter((word) => word.length <= 0);
       const hasText = text.length > 0 && words.length > 0;
 
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected 'Audio: No speech detected or transcri…' to be 'This is a test transcription.' // Object.is equality

[Survived] ArithmeticOperator
src/lib/processors/speech-processor.ts:134:19
       const confidence = hasText ? 0.8 : 0.0;
 
       const speechMetadata: SpeechMetadata = {
-        duration: audioData.length / (options.sampleRate || 16000), // Estimate duration
+        duration: audioData.length * (options.sampleRate || 16000), // Estimate duration
         sampleRate: options.sampleRate || 16000,
         channels: 1, // Assume mono

[Survived] ConditionalExpression
src/lib/processors/speech-processor.ts:134:39
       const confidence = hasText ? 0.8 : 0.0;
 
       const speechMetadata: SpeechMetadata = {
-        duration: audioData.length / (options.sampleRate || 16000), // Estimate duration
+        duration: audioData.length / (false), // Estimate duration
         sampleRate: options.sampleRate || 16000,
         channels: 1, // Assume mono

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:135:21
 
       const speechMetadata: SpeechMetadata = {
         duration: audioData.length / (options.sampleRate || 16000), // Estimate duration
-        sampleRate: options.sampleRate || 16000,
+        sampleRate: false,
         channels: 1, // Assume mono
         confidence,
killedBy: SpeechProcessor Processing metadata should estimate audio duration
statusReason: expected false to be 16000 // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:135:21
 
       const speechMetadata: SpeechMetadata = {
         duration: audioData.length / (options.sampleRate || 16000), // Estimate duration
-        sampleRate: options.sampleRate || 16000,
+        sampleRate: true,
         channels: 1, // Assume mono
         confidence,
killedBy: SpeechProcessor Processing metadata should estimate audio duration
statusReason: expected true to be 16000 // Object.is equality

[Killed] LogicalOperator
src/lib/processors/speech-processor.ts:139:19
         channels: 1, // Assume mono
         confidence,
         processingTime,
-        language: options.language || "en",
+        language: options.language && "en",
         engine: "sherpa-onnx",
       };
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected undefined to be 'en' // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:139:19
         channels: 1, // Assume mono
         confidence,
         processingTime,
-        language: options.language || "en",
+        language: false,
         engine: "sherpa-onnx",
       };
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected false to be 'en' // Object.is equality

[Killed] StringLiteral
src/lib/processors/speech-processor.ts:140:17
         confidence,
         processingTime,
         language: options.language || "en",
-        engine: "sherpa-onnx",
+        engine: "",
       };
 
killedBy: SpeechProcessor transcribeFromBuffer should transcribe audio successfully
statusReason: expected '' to be 'sherpa-onnx' // Object.is equality

[Killed] StringLiteral
src/lib/processors/speech-processor.ts:156:13
       return {
         text: hasText
           ? text
-          : "Audio: No speech detected or transcription failed",
+          : "",
         metadata: contentMetadata,
       };
killedBy: SpeechProcessor transcribeFromBuffer should handle audio with no speech
statusReason: expected '' to contain 'No speech detected'

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:159:21
           : "Audio: No speech detected or transcription failed",
         metadata: contentMetadata,
       };
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-      return this.createFallbackResult(
-        `Speech processing error: ${errorMessage}`,
-        Date.now()
-      );
-    }
+    } catch (error) {}
   }
 
killedBy: SpeechProcessor transcribeFromBuffer should handle transcription errors gracefully
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:181:6
   ): Promise<{
     text: string;
     metadata: SpeechContentMetadata;
-  }> {
-    try {
-      const buffer = fs.readFileSync(filePath);
-      return await this.transcribeFromBuffer(buffer, options);
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: SpeechContentMetadata = {
-        type: ContentType.AUDIO,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Audio File Error: Failed to read file - ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
-  }
+  }> {}
 
   /**
killedBy: SpeechProcessor transcribeFromFile should read file and transcribe audio
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:182:9
     text: string;
     metadata: SpeechContentMetadata;
   }> {
-    try {
-      const buffer = fs.readFileSync(filePath);
-      return await this.transcribeFromBuffer(buffer, options);
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage =
         error instanceof Error ? error.message : String(error);
killedBy: SpeechProcessor transcribeFromFile should read file and transcribe audio
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:185:21
     try {
       const buffer = fs.readFileSync(filePath);
       return await this.transcribeFromBuffer(buffer, options);
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-
-      const contentMetadata: SpeechContentMetadata = {
-        type: ContentType.AUDIO,
-        language: "unknown",
-        encoding: "unknown",
-        hasText: false,
-        wordCount: 0,
-        characterCount: 0,
-      };
-
-      return {
-        text: `Audio File Error: Failed to read file - ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 
killedBy: SpeechProcessor transcribeFromFile should handle file read errors
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] StringLiteral
src/lib/processors/speech-processor.ts:199:15
       };
 
       return {
-        text: `Audio File Error: Failed to read file - ${errorMessage}`,
+        text: ``,
         metadata: contentMetadata,
       };
killedBy: SpeechProcessor transcribeFromFile should handle file read errors
statusReason: expected '' to contain 'Failed to read file'

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:208:51
   /**
    * Check if a file format is supported for speech recognition
    */
-  isSupportedAudioFormat(buffer: Buffer): boolean {
-    // Check common audio file signatures
-    const signatures = [
-      Buffer.from([0x52, 0x49, 0x46, 0x46]), // RIFF (WAV)
-      Buffer.from([0x66, 0x74, 0x79, 0x70]), // ftyp (MP4/M4A)
-      Buffer.from([0x49, 0x44, 0x33]), // ID3 (MP3)
-      Buffer.from([0x4f, 0x67, 0x67, 0x53]), // OggS (OGG)
-      Buffer.from([0x66, 0x4c, 0x61, 0x43]), // fLaC (FLAC)
-    ];
-
-    return signatures.some(
-      (signature) =>
-        buffer.subarray(0, 4).equals(signature) ||
-        buffer.subarray(0, signature.length).equals(signature)
-    );
-  }
+  isSupportedAudioFormat(buffer: Buffer): boolean {}
 
   /**
killedBy: SpeechProcessor isSupportedAudioFormat should validate WAV files
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/processors/speech-processor.ts:214:19
       Buffer.from([0x52, 0x49, 0x46, 0x46]), // RIFF (WAV)
       Buffer.from([0x66, 0x74, 0x79, 0x70]), // ftyp (MP4/M4A)
       Buffer.from([0x49, 0x44, 0x33]), // ID3 (MP3)
-      Buffer.from([0x4f, 0x67, 0x67, 0x53]), // OggS (OGG)
+      Buffer.from([]), // OggS (OGG)
       Buffer.from([0x66, 0x4c, 0x61, 0x43]), // fLaC (FLAC)
     ];
killedBy: SpeechProcessor isSupportedAudioFormat should reject unsupported formats
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/lib/processors/speech-processor.ts:215:19
       Buffer.from([0x66, 0x74, 0x79, 0x70]), // ftyp (MP4/M4A)
       Buffer.from([0x49, 0x44, 0x33]), // ID3 (MP3)
       Buffer.from([0x4f, 0x67, 0x67, 0x53]), // OggS (OGG)
-      Buffer.from([0x66, 0x4c, 0x61, 0x43]), // fLaC (FLAC)
+      Buffer.from([]), // fLaC (FLAC)
     ];
 
killedBy: SpeechProcessor isSupportedAudioFormat should reject unsupported formats
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/lib/processors/speech-processor.ts:218:12
       Buffer.from([0x66, 0x4c, 0x61, 0x43]), // fLaC (FLAC)
     ];
 
-    return signatures.some(
-      (signature) =>
-        buffer.subarray(0, 4).equals(signature) ||
-        buffer.subarray(0, signature.length).equals(signature)
-    );
+    return signatures.every(signature => buffer.subarray(0, 4).equals(signature) || buffer.subarray(0, signature.length).equals(signature));
   }
 
killedBy: SpeechProcessor isSupportedAudioFormat should validate WAV files
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/processors/speech-processor.ts:219:7
     ];
 
     return signatures.some(
-      (signature) =>
-        buffer.subarray(0, 4).equals(signature) ||
-        buffer.subarray(0, signature.length).equals(signature)
+      () => undefined
     );
   }
killedBy: SpeechProcessor isSupportedAudioFormat should validate WAV files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:220:9
 
     return signatures.some(
       (signature) =>
-        buffer.subarray(0, 4).equals(signature) ||
-        buffer.subarray(0, signature.length).equals(signature)
+        true
     );
   }
killedBy: SpeechProcessor isSupportedAudioFormat should reject unsupported formats
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:220:9
 
     return signatures.some(
       (signature) =>
-        buffer.subarray(0, 4).equals(signature) ||
-        buffer.subarray(0, signature.length).equals(signature)
+        false
     );
   }
killedBy: SpeechProcessor isSupportedAudioFormat should validate WAV files
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/lib/processors/speech-processor.ts:229:73
    * Convert audio buffer to float32 array (simplified implementation)
    * In practice, you'd need proper audio decoding based on format
    */
-  private convertBufferToAudioData(buffer: Buffer): Float32Array | null {
-    try {
-      // This is a very simplified implementation
-      // In practice, you'd need to:
-      // 1. Detect audio format (WAV, MP3, etc.)
-      // 2. Decode the audio to raw PCM data
-      // 3. Convert to Float32Array
-
-      // For now, return null to indicate unsupported format
-      // This would need to be implemented with proper audio decoding libraries
-      return null;
-    } catch (error) {
-      return null;
-    }
-  }
+  private convertBufferToAudioData(buffer: Buffer): Float32Array | null {}
 
   /**

[Survived] BlockStatement
src/lib/processors/speech-processor.ts:230:9
    * In practice, you'd need proper audio decoding based on format
    */
   private convertBufferToAudioData(buffer: Buffer): Float32Array | null {
-    try {
-      // This is a very simplified implementation
-      // In practice, you'd need to:
-      // 1. Detect audio format (WAV, MP3, etc.)
-      // 2. Decode the audio to raw PCM data
-      // 3. Convert to Float32Array
-
-      // For now, return null to indicate unsupported format
-      // This would need to be implemented with proper audio decoding libraries
-      return null;
-    } catch (error) {
+    try {} catch (error) {
       return null;
     }

[NoCoverage] BlockStatement
src/lib/processors/speech-processor.ts:240:21
       // For now, return null to indicate unsupported format
       // This would need to be implemented with proper audio decoding libraries
       return null;
-    } catch (error) {
-      return null;
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:254:5
   ): {
     text: string;
     metadata: SpeechContentMetadata;
-  } {
-    const contentMetadata: SpeechContentMetadata = {
-      type: ContentType.AUDIO,
-      language: "unknown",
-      encoding: "unknown",
-      hasText: false,
-      wordCount: 0,
-      characterCount: 0,
-      speechMetadata: {
-        processingTime: Date.now() - startTime,
-        language: "unknown",
-        engine: "none",
-      },
-    };
-
-    return {
-      text: `Audio: ${reason}`,
-      metadata: contentMetadata,
-    };
-  }
+  } {}
 
   /**
killedBy: SpeechProcessor transcribeFromBuffer should handle transcription errors gracefully
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ObjectLiteral
src/lib/processors/speech-processor.ts:255:52
     text: string;
     metadata: SpeechContentMetadata;
   } {
-    const contentMetadata: SpeechContentMetadata = {
-      type: ContentType.AUDIO,
-      language: "unknown",
-      encoding: "unknown",
-      hasText: false,
-      wordCount: 0,
-      characterCount: 0,
-      speechMetadata: {
-        processingTime: Date.now() - startTime,
-        language: "unknown",
-        engine: "none",
-      },
-    };
+    const contentMetadata: SpeechContentMetadata = {};
 
     return {
killedBy: SpeechProcessor transcribeFromBuffer should handle transcription errors gracefully
statusReason: expected undefined to be false // Object.is equality

[Survived] ArithmeticOperator
src/lib/processors/speech-processor.ts:263:25
       wordCount: 0,
       characterCount: 0,
       speechMetadata: {
-        processingTime: Date.now() - startTime,
+        processingTime: Date.now() + startTime,
         language: "unknown",
         engine: "none",

[Survived] StringLiteral
src/lib/processors/speech-processor.ts:264:19
       characterCount: 0,
       speechMetadata: {
         processingTime: Date.now() - startTime,
-        language: "unknown",
+        language: "",
         engine: "none",
       },

[Survived] StringLiteral
src/lib/processors/speech-processor.ts:265:17
       speechMetadata: {
         processingTime: Date.now() - startTime,
         language: "unknown",
-        engine: "none",
+        engine: "",
       },
     };

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:295:9
     const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
 
     if (maxMatches === 0) return "unknown";
-    if (maxMatches === englishMatches) return "en";
+    if (true) return "en";
     if (maxMatches === spanishMatches) return "es";
     if (maxMatches === frenchMatches) return "fr";
killedBy: SpeechProcessor Language detection should detect Spanish in transcription
statusReason: expected 'en' to be 'es' // Object.is equality

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:305:34
   /**
    * Clean up resources
    */
-  async cleanup(): Promise<void> {
-    if (this.recognizer) {
-      this.recognizer.free();
-      this.recognizer = null;
-    }
-    if (this.model) {
-      this.model.free();
-      this.model = null;
-    }
-    this.initialized = false;
-  }
+  async cleanup(): Promise<void> {}
 
   /**
killedBy: SpeechProcessor Initialization and cleanup should cleanup resources
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:306:26
    * Clean up resources
    */
   async cleanup(): Promise<void> {
-    if (this.recognizer) {
-      this.recognizer.free();
-      this.recognizer = null;
-    }
+    if (this.recognizer) {}
     if (this.model) {
       this.model.free();
killedBy: SpeechProcessor Initialization and cleanup should cleanup resources
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:306:9
    * Clean up resources
    */
   async cleanup(): Promise<void> {
-    if (this.recognizer) {
+    if (false) {
       this.recognizer.free();
       this.recognizer = null;
killedBy: SpeechProcessor Initialization and cleanup should cleanup resources
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:310:21
       this.recognizer.free();
       this.recognizer = null;
     }
-    if (this.model) {
-      this.model.free();
-      this.model = null;
-    }
+    if (this.model) {}
     this.initialized = false;
   }
killedBy: SpeechProcessor Initialization and cleanup should cleanup resources
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:310:9
       this.recognizer.free();
       this.recognizer = null;
     }
-    if (this.model) {
+    if (false) {
       this.model.free();
       this.model = null;
killedBy: SpeechProcessor Initialization and cleanup should cleanup resources
statusReason: expected "spy" to be called at least once

[Survived] BooleanLiteral
src/lib/processors/speech-processor.ts:314:24
       this.model.free();
       this.model = null;
     }
-    this.initialized = false;
+    this.initialized = true;
   }
 

[Killed] BlockStatement
src/lib/processors/speech-processor.ts:320:22
   /**
    * Check if the speech processor is ready
    */
-  isReady(): boolean {
-    return this.initialized && this.recognizer !== null;
-  }
+  isReady(): boolean {}
 }
 
killedBy: SpeechProcessor Initialization and cleanup should initialize on first use
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:321:12
    * Check if the speech processor is ready
    */
   isReady(): boolean {
-    return this.initialized && this.recognizer !== null;
+    return true;
   }
 }
killedBy: SpeechProcessor Initialization and cleanup should cleanup resources
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/processors/speech-processor.ts:321:12
    * Check if the speech processor is ready
    */
   isReady(): boolean {
-    return this.initialized && this.recognizer !== null;
+    return false;
   }
 }
killedBy: SpeechProcessor Initialization and cleanup should initialize on first use
statusReason: expected false to be true // Object.is equality
