[Killed] BlockStatement
src/lib/utils.ts:7:49
  * Normalize text for consistent embedding and caching
  * Following the best practices from the instructions
  */
-export function normalize(text: string): string {
-  console.log("normalize called with:", text);
-  return text
-    .normalize("NFC")
-    .replace(/\r\n?/g, "\n")
-    .replace(/[ \t]+/g, " ")
-    .replace(/\u200B|\u200C|\u200D|\uFEFF/g, "") // zero-widths
-    .trim();
-}
+export function normalize(text: string): string {}
 
 /**
killedBy: normalize should normalize basic text
statusReason: expected undefined to be 'Hello World' // Object.is equality

[Killed] MethodExpression
src/lib/utils.ts:9:10
  */
 export function normalize(text: string): string {
   console.log("normalize called with:", text);
-  return text
-    .normalize("NFC")
-    .replace(/\r\n?/g, "\n")
-    .replace(/[ \t]+/g, " ")
-    .replace(/\u200B|\u200C|\u200D|\uFEFF/g, "") // zero-widths
-    .trim();
+  return text.normalize("NFC").replace(/\r\n?/g, "\n").replace(/[ \t]+/g, " ").replace(/\u200B|\u200C|\u200D|\uFEFF/g, "") // zero-widths;
 }
 
killedBy: normalize should normalize basic text
statusReason: expected ' Hello World ' to be 'Hello World' // Object.is equality

[Killed] StringLiteral
src/lib/utils.ts:10:16
 export function normalize(text: string): string {
   console.log("normalize called with:", text);
   return text
-    .normalize("NFC")
+    .normalize("")
     .replace(/\r\n?/g, "\n")
     .replace(/[ \t]+/g, " ")
killedBy: normalize should normalize basic text
statusReason: The normalization form should be one of NFC, NFD, NFKC, NFKD.

[Survived] StringLiteral
src/lib/utils.ts:13:46
     .normalize("NFC")
     .replace(/\r\n?/g, "\n")
     .replace(/[ \t]+/g, " ")
-    .replace(/\u200B|\u200C|\u200D|\uFEFF/g, "") // zero-widths
+    .replace(/\u200B|\u200C|\u200D|\uFEFF/g, "Stryker was here!") // zero-widths
     .trim();
 }

[Survived] BlockStatement
src/lib/utils.ts:20:57
 /**
  * Create a stable content hash for deterministic IDs
  */
-export function createContentHash(text: string): string {
-  const normalized = normalize(text);
-  return crypto.createHash("sha256").update(normalized).digest("hex");
-}
+export function createContentHash(text: string): string {}
 
 /**

[Killed] StringLiteral
src/lib/utils.ts:22:64
  */
 export function createContentHash(text: string): string {
   const normalized = normalize(text);
-  return crypto.createHash("sha256").update(normalized).digest("hex");
+  return crypto.createHash("sha256").update(normalized).digest("");
 }
 
killedBy: createContentHash should create consistent hashes for same content
statusReason: expected Buffer[ 165, 145, 166, 212, 11, …(-211) ] to be Buffer[ 165, 145, 166, 212, 11, …(-211) ] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Buffer[ 165, 145, 166, 212, 11, …(-211) ]
Received: serializes to the same string

[Killed] BlockStatement
src/lib/utils.ts:28:61
 /**
  * L2 normalize a vector (ensures cosine similarity is in [-1, 1] range)
  */
-export function normalizeVector(vector: number[]): number[] {
-  const norm = Math.sqrt(vector.reduce((sum, x) => sum + x * x, 0));
-  if (norm === 0) return vector; // Avoid division by zero for zero vectors
-  return vector.map((x) => x / norm);
-}
+export function normalizeVector(vector: number[]): number[] {}
 
 /**
killedBy: normalizeVector should normalize a vector to unit length
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] ArrowFunction
src/lib/utils.ts:29:40
  * L2 normalize a vector (ensures cosine similarity is in [-1, 1] range)
  */
 export function normalizeVector(vector: number[]): number[] {
-  const norm = Math.sqrt(vector.reduce((sum, x) => sum + x * x, 0));
+  const norm = Math.sqrt(vector.reduce(() => undefined, 0));
   if (norm === 0) return vector; // Avoid division by zero for zero vectors
   return vector.map((x) => x / norm);
killedBy: normalizeVector should normalize a vector to unit length
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 5e-11

[Killed] ArithmeticOperator
src/lib/utils.ts:29:58
  * L2 normalize a vector (ensures cosine similarity is in [-1, 1] range)
  */
 export function normalizeVector(vector: number[]): number[] {
-  const norm = Math.sqrt(vector.reduce((sum, x) => sum + x * x, 0));
+  const norm = Math.sqrt(vector.reduce((sum, x) => sum + x / x, 0));
   if (norm === 0) return vector; // Avoid division by zero for zero vectors
   return vector.map((x) => x / norm);
killedBy: normalizeVector should normalize a vector to unit length
statusReason: expected 3.5355339059327373 to be close to 1, received difference is 2.5355339059327373, but expected 5e-11

[Killed] EqualityOperator
src/lib/utils.ts:30:7
  */
 export function normalizeVector(vector: number[]): number[] {
   const norm = Math.sqrt(vector.reduce((sum, x) => sum + x * x, 0));
-  if (norm === 0) return vector; // Avoid division by zero for zero vectors
+  if (norm !== 0) return vector; // Avoid division by zero for zero vectors
   return vector.map((x) => x / norm);
 }
killedBy: normalizeVector should normalize a vector to unit length
statusReason: expected 5 to be close to 1, received difference is 4, but expected 5e-11

[Killed] ConditionalExpression
src/lib/utils.ts:30:7
  */
 export function normalizeVector(vector: number[]): number[] {
   const norm = Math.sqrt(vector.reduce((sum, x) => sum + x * x, 0));
-  if (norm === 0) return vector; // Avoid division by zero for zero vectors
+  if (true) return vector; // Avoid division by zero for zero vectors
   return vector.map((x) => x / norm);
 }
killedBy: normalizeVector should normalize a vector to unit length
statusReason: expected 5 to be close to 1, received difference is 4, but expected 5e-11

[Killed] ArithmeticOperator
src/lib/utils.ts:31:28
 export function normalizeVector(vector: number[]): number[] {
   const norm = Math.sqrt(vector.reduce((sum, x) => sum + x * x, 0));
   if (norm === 0) return vector; // Avoid division by zero for zero vectors
-  return vector.map((x) => x / norm);
+  return vector.map((x) => x * norm);
 }
 
killedBy: normalizeVector should normalize a vector to unit length
statusReason: expected 25 to be close to 1, received difference is 24, but expected 5e-11

[Killed] ArrowFunction
src/lib/utils.ts:31:21
 export function normalizeVector(vector: number[]): number[] {
   const norm = Math.sqrt(vector.reduce((sum, x) => sum + x * x, 0));
   if (norm === 0) return vector; // Avoid division by zero for zero vectors
-  return vector.map((x) => x / norm);
+  return vector.map(() => undefined);
 }
 
killedBy: normalizeVector should normalize a vector to unit length
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 5e-11

[Killed] BlockStatement
src/lib/utils.ts:37:74
 /**
  * Calculate cosine similarity between two normalized vectors
  */
-export function cosineSimilarity(vecA: number[], vecB: number[]): number {
-  if (vecA.length !== vecB.length) {
-    throw new Error("Vectors must have the same dimension");
-  }
-
-  let dotProduct = 0;
-  let normA = 0;
-  let normB = 0;
-
-  for (let i = 0; i < vecA.length; i++) {
-    dotProduct += vecA[i] * vecB[i];
-    normA += vecA[i] * vecA[i];
-    normB += vecB[i] * vecB[i];
-  }
-
-  normA = Math.sqrt(normA);
-  normB = Math.sqrt(normB);
-
-  if (normA === 0 || normB === 0) return 0;
-
-  return dotProduct / (normA * normB);
-}
+export function cosineSimilarity(vecA: number[], vecB: number[]): number {}
 
 /**
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected undefined to be close to 1, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/lib/utils.ts:38:7
  * Calculate cosine similarity between two normalized vectors
  */
 export function cosineSimilarity(vecA: number[], vecB: number[]): number {
-  if (vecA.length !== vecB.length) {
+  if (true) {
     throw new Error("Vectors must have the same dimension");
   }
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: Vectors must have the same dimension

[Killed] EqualityOperator
src/lib/utils.ts:38:7
  * Calculate cosine similarity between two normalized vectors
  */
 export function cosineSimilarity(vecA: number[], vecB: number[]): number {
-  if (vecA.length !== vecB.length) {
+  if (vecA.length === vecB.length) {
     throw new Error("Vectors must have the same dimension");
   }
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: Vectors must have the same dimension

[NoCoverage] StringLiteral
src/lib/utils.ts:39:21
  */
 export function cosineSimilarity(vecA: number[], vecB: number[]): number {
   if (vecA.length !== vecB.length) {
-    throw new Error("Vectors must have the same dimension");
+    throw new Error("");
   }
 

[Killed] EqualityOperator
src/lib/utils.ts:46:19
   let normA = 0;
   let normB = 0;
 
-  for (let i = 0; i < vecA.length; i++) {
+  for (let i = 0; i <= vecA.length; i++) {
     dotProduct += vecA[i] * vecB[i];
     normA += vecA[i] * vecA[i];
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 5e-11

[Killed] EqualityOperator
src/lib/utils.ts:46:19
   let normA = 0;
   let normB = 0;
 
-  for (let i = 0; i < vecA.length; i++) {
+  for (let i = 0; i >= vecA.length; i++) {
     dotProduct += vecA[i] * vecB[i];
     normA += vecA[i] * vecA[i];
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected +0 to be close to 1, received difference is 1, but expected 5e-11

[Killed] ArithmeticOperator
src/lib/utils.ts:47:19
   let normB = 0;
 
   for (let i = 0; i < vecA.length; i++) {
-    dotProduct += vecA[i] * vecB[i];
+    dotProduct += vecA[i] / vecB[i];
     normA += vecA[i] * vecA[i];
     normB += vecB[i] * vecB[i];
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected 0.21428571428571427 to be close to 1, received difference is 0.7857142857142857, but expected 5e-11

[Killed] AssignmentOperator
src/lib/utils.ts:47:5
   let normB = 0;
 
   for (let i = 0; i < vecA.length; i++) {
-    dotProduct += vecA[i] * vecB[i];
+    dotProduct -= vecA[i] * vecB[i];
     normA += vecA[i] * vecA[i];
     normB += vecB[i] * vecB[i];
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected -1 to be close to 1, received difference is 2, but expected 5e-11

[Killed] AssignmentOperator
src/lib/utils.ts:48:5
 
   for (let i = 0; i < vecA.length; i++) {
     dotProduct += vecA[i] * vecB[i];
-    normA += vecA[i] * vecA[i];
+    normA -= vecA[i] * vecA[i];
     normB += vecB[i] * vecB[i];
   }
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 5e-11

[Killed] ArithmeticOperator
src/lib/utils.ts:48:14
 
   for (let i = 0; i < vecA.length; i++) {
     dotProduct += vecA[i] * vecB[i];
-    normA += vecA[i] * vecA[i];
+    normA += vecA[i] / vecA[i];
     normB += vecB[i] * vecB[i];
   }
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected 2.160246899469287 to be close to 1, received difference is 1.160246899469287, but expected 5e-11

[Killed] ArithmeticOperator
src/lib/utils.ts:49:14
   for (let i = 0; i < vecA.length; i++) {
     dotProduct += vecA[i] * vecB[i];
     normA += vecA[i] * vecA[i];
-    normB += vecB[i] * vecB[i];
+    normB += vecB[i] / vecB[i];
   }
 
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected 2.160246899469287 to be close to 1, received difference is 1.160246899469287, but expected 5e-11

[Killed] AssignmentOperator
src/lib/utils.ts:49:5
   for (let i = 0; i < vecA.length; i++) {
     dotProduct += vecA[i] * vecB[i];
     normA += vecA[i] * vecA[i];
-    normB += vecB[i] * vecB[i];
+    normB -= vecB[i] * vecB[i];
   }
 
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/lib/utils.ts:55:7
   normA = Math.sqrt(normA);
   normB = Math.sqrt(normB);
 
-  if (normA === 0 || normB === 0) return 0;
+  if (true) return 0;
 
   return dotProduct / (normA * normB);
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected +0 to be close to 1, received difference is 1, but expected 5e-11

[Killed] EqualityOperator
src/lib/utils.ts:55:22
   normA = Math.sqrt(normA);
   normB = Math.sqrt(normB);
 
-  if (normA === 0 || normB === 0) return 0;
+  if (normA === 0 || normB !== 0) return 0;
 
   return dotProduct / (normA * normB);
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected +0 to be close to 1, received difference is 1, but expected 5e-11

[Killed] ArithmeticOperator
src/lib/utils.ts:57:24
 
   if (normA === 0 || normB === 0) return 0;
 
-  return dotProduct / (normA * normB);
+  return dotProduct / (normA / normB);
 }
 
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected 14 to be close to 1, received difference is 13, but expected 5e-11

[Killed] ArithmeticOperator
src/lib/utils.ts:57:10
 
   if (normA === 0 || normB === 0) return 0;
 
-  return dotProduct / (normA * normB);
+  return dotProduct * (normA * normB);
 }
 
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected 196 to be close to 1, received difference is 195, but expected 5e-11

[Killed] BlockStatement
src/lib/utils.ts:63:54
 /**
  * Estimate token count (crude approximation: words/0.75)
  */
-export function estimateTokens(text: string): number {
-  return Math.ceil(text.split(/\s+/).length / 0.75);
-}
+export function estimateTokens(text: string): number {}
 
 /**
killedBy: estimateTokens should estimate tokens based on word count
statusReason: expected undefined to be 7 // Object.is equality

[Killed] ArithmeticOperator
src/lib/utils.ts:64:20
  * Estimate token count (crude approximation: words/0.75)
  */
 export function estimateTokens(text: string): number {
-  return Math.ceil(text.split(/\s+/).length / 0.75);
+  return Math.ceil(text.split(/\s+/).length * 0.75);
 }
 
killedBy: estimateTokens should estimate tokens based on word count
statusReason: expected 4 to be 7 // Object.is equality

[NoCoverage] BlockStatement
src/lib/utils.ts:70:50
 /**
  * Sleep utility for rate limiting
  */
-export function sleep(ms: number): Promise<void> {
-  return new Promise((resolve) => setTimeout(resolve, ms));
-}
+export function sleep(ms: number): Promise<void> {}
 
 /**

[NoCoverage] ArrowFunction
src/lib/utils.ts:71:22
  * Sleep utility for rate limiting
  */
 export function sleep(ms: number): Promise<void> {
-  return new Promise((resolve) => setTimeout(resolve, ms));
+  return new Promise(() => undefined);
 }
 

[Killed] BlockStatement
src/lib/utils.ts:77:58
 /**
  * Extract Obsidian wikilinks from text
  */
-export function extractWikilinks(text: string): string[] {
-  const wikilinkRegex = /\[\[([^\]]+)\]\]/g;
-  const wikilinks: string[] = [];
-  let match;
-  while ((match = wikilinkRegex.exec(text)) !== null) {
-    wikilinks.push(match[1]);
-  }
-  return [...new Set(wikilinks)]; // Remove duplicates
-}
+export function extractWikilinks(text: string): string[] {}
 
 /**
killedBy: extractWikilinks should extract wikilinks from text
statusReason: expected undefined to deeply equal [ 'link', 'link2' ]

[Killed] EqualityOperator
src/lib/utils.ts:81:10
   const wikilinkRegex = /\[\[([^\]]+)\]\]/g;
   const wikilinks: string[] = [];
   let match;
-  while ((match = wikilinkRegex.exec(text)) !== null) {
+  while ((match = wikilinkRegex.exec(text)) === null) {
     wikilinks.push(match[1]);
   }
killedBy: extractWikilinks should extract wikilinks from text
statusReason: expected [] to deeply equal [ 'link', 'link2' ]

[Killed] BlockStatement
src/lib/utils.ts:81:55
   const wikilinkRegex = /\[\[([^\]]+)\]\]/g;
   const wikilinks: string[] = [];
   let match;
-  while ((match = wikilinkRegex.exec(text)) !== null) {
-    wikilinks.push(match[1]);
-  }
+  while ((match = wikilinkRegex.exec(text)) !== null) {}
   return [...new Set(wikilinks)]; // Remove duplicates
 }
killedBy: extractWikilinks should extract wikilinks from text
statusReason: expected [] to deeply equal [ 'link', 'link2' ]

[Killed] BlockStatement
src/lib/utils.ts:90:57
 /**
  * Extract hashtags from text
  */
-export function extractHashtags(text: string): string[] {
-  const tagRegex = /#([a-zA-Z0-9_/-]+)/g;
-  const tags: string[] = [];
-  let match;
-  while ((match = tagRegex.exec(text)) !== null) {
-    tags.push(match[1]);
-  }
-  return [...new Set(tags)]; // Remove duplicates
-}
+export function extractHashtags(text: string): string[] {}
 
 /**
killedBy: extractHashtags should extract hashtags from text
statusReason: expected undefined to deeply equal [ 'tag', 'tag2' ]

[Killed] EqualityOperator
src/lib/utils.ts:94:10
   const tagRegex = /#([a-zA-Z0-9_/-]+)/g;
   const tags: string[] = [];
   let match;
-  while ((match = tagRegex.exec(text)) !== null) {
+  while ((match = tagRegex.exec(text)) === null) {
     tags.push(match[1]);
   }
killedBy: extractHashtags should extract hashtags from text
statusReason: expected [] to deeply equal [ 'tag', 'tag2' ]

[Killed] BlockStatement
src/lib/utils.ts:94:50
   const tagRegex = /#([a-zA-Z0-9_/-]+)/g;
   const tags: string[] = [];
   let match;
-  while ((match = tagRegex.exec(text)) !== null) {
-    tags.push(match[1]);
-  }
+  while ((match = tagRegex.exec(text)) !== null) {}
   return [...new Set(tags)]; // Remove duplicates
 }
killedBy: extractHashtags should extract hashtags from text
statusReason: expected [] to deeply equal [ 'tag', 'tag2' ]

[Killed] ArrayDeclaration
src/lib/utils.ts:97:10
   while ((match = tagRegex.exec(text)) !== null) {
     tags.push(match[1]);
   }
-  return [...new Set(tags)]; // Remove duplicates
+  return []; // Remove duplicates
 }
 
killedBy: extractHashtags should extract hashtags from text
statusReason: expected [] to deeply equal [ 'tag', 'tag2' ]

[Killed] BlockStatement
src/lib/utils.ts:103:53
 /**
  * Clean markdown content for better embedding
  */
-export function cleanMarkdown(text: string): string {
-  return (
-    text
-      // Remove frontmatter
-      .replace(/^---[\s\S]*?---\n?/, "")
-      // Remove wikilinks but keep the text
-      .replace(/\[\[([^\]]+)\]\]/g, "$1")
-      // Remove markdown links but keep the text
-      .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
-      // Remove markdown formatting
-      .replace(/[*_`~]/g, "")
-      // Remove headers
-      .replace(/^#+\s+/gm, "")
-      // Clean up extra whitespace
-      .replace(/\n\s*\n/g, "\n\n")
-      .trim()
-  );
-}
+export function cleanMarkdown(text: string): string {}
 
 /**
killedBy: cleanMarkdown should remove frontmatter
statusReason: expected undefined to be 'This is content' // Object.is equality

[Survived] MethodExpression
src/lib/utils.ts:105:5
  */
 export function cleanMarkdown(text: string): string {
   return (
-    text
-      // Remove frontmatter
-      .replace(/^---[\s\S]*?---\n?/, "")
-      // Remove wikilinks but keep the text
-      .replace(/\[\[([^\]]+)\]\]/g, "$1")
-      // Remove markdown links but keep the text
-      .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
-      // Remove markdown formatting
-      .replace(/[*_`~]/g, "")
-      // Remove headers
-      .replace(/^#+\s+/gm, "")
-      // Clean up extra whitespace
-      .replace(/\n\s*\n/g, "\n\n")
-      .trim()
+    text
+// Remove frontmatter
+.replace(/^---[\s\S]*?---\n?/, "")
+// Remove wikilinks but keep the text
+.replace(/\[\[([^\]]+)\]\]/g, "$1")
+// Remove markdown links but keep the text
+.replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
+// Remove markdown formatting
+.replace(/[*_`~]/g, "")
+// Remove headers
+.replace(/^#+\s+/gm, "")
+// Clean up extra whitespace
+.replace(/\n\s*\n/g, "\n\n")
   );
 }

[Killed] Regex
src/lib/utils.ts:107:16
   return (
     text
       // Remove frontmatter
-      .replace(/^---[\s\S]*?---\n?/, "")
+      .replace(/^---[\s\s]*?---\n?/, "")
       // Remove wikilinks but keep the text
       .replace(/\[\[([^\]]+)\]\]/g, "$1")
killedBy: cleanMarkdown should remove frontmatter
statusReason: expected '---\ntitle: Test\n---\nThis is content' to be 'This is content' // Object.is equality

[Survived] Regex
src/lib/utils.ts:107:16
   return (
     text
       // Remove frontmatter
-      .replace(/^---[\s\S]*?---\n?/, "")
+      .replace(/---[\s\S]*?---\n?/, "")
       // Remove wikilinks but keep the text
       .replace(/\[\[([^\]]+)\]\]/g, "$1")

[Killed] Regex
src/lib/utils.ts:111:16
       // Remove wikilinks but keep the text
       .replace(/\[\[([^\]]+)\]\]/g, "$1")
       // Remove markdown links but keep the text
-      .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
+      .replace(/\[([^\]]+)\]\([)]+\)/g, "$1")
       // Remove markdown formatting
       .replace(/[*_`~]/g, "")
killedBy: cleanMarkdown should remove markdown links but keep text
statusReason: expected 'This is a [link](url) in text' to be 'This is a link in text' // Object.is equality

[Survived] Regex
src/lib/utils.ts:115:16
       // Remove markdown formatting
       .replace(/[*_`~]/g, "")
       // Remove headers
-      .replace(/^#+\s+/gm, "")
+      .replace(/#+\s+/gm, "")
       // Clean up extra whitespace
       .replace(/\n\s*\n/g, "\n\n")

[Killed] BlockStatement
src/lib/utils.ts:128:13
 export function generateBreadcrumbs(
   filePath: string,
   vaultPath: string
-): string[] {
-  const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
-  const pathParts = relativePath.split("/");
-  pathParts.pop(); // Remove filename
-  return pathParts.length > 0 ? pathParts : ["Root"];
-}
+): string[] {}
 
 /**
killedBy: generateBreadcrumbs should generate breadcrumbs from file path
statusReason: expected undefined to deeply equal [ 'folder' ]

[Survived] Regex
src/lib/utils.ts:129:64
   filePath: string,
   vaultPath: string
 ): string[] {
-  const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
+  const relativePath = filePath.replace(vaultPath, "").replace(/^\//, "");
   const pathParts = relativePath.split("/");
   pathParts.pop(); // Remove filename

[Survived] Regex
src/lib/utils.ts:129:64
   filePath: string,
   vaultPath: string
 ): string[] {
-  const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
+  const relativePath = filePath.replace(vaultPath, "").replace(/\/+/, "");
   const pathParts = relativePath.split("/");
   pathParts.pop(); // Remove filename

[Killed] ConditionalExpression
src/lib/utils.ts:132:10
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
   const pathParts = relativePath.split("/");
   pathParts.pop(); // Remove filename
-  return pathParts.length > 0 ? pathParts : ["Root"];
+  return false ? pathParts : ["Root"];
 }
 
killedBy: generateBreadcrumbs should generate breadcrumbs from file path
statusReason: expected [ 'Root' ] to deeply equal [ 'folder' ]

[Killed] EqualityOperator
src/lib/utils.ts:132:10
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
   const pathParts = relativePath.split("/");
   pathParts.pop(); // Remove filename
-  return pathParts.length > 0 ? pathParts : ["Root"];
+  return pathParts.length <= 0 ? pathParts : ["Root"];
 }
 
killedBy: generateBreadcrumbs should generate breadcrumbs from file path
statusReason: expected [ 'Root' ] to deeply equal [ 'folder' ]

[Killed] BlockStatement
src/lib/utils.ts:142:11
   filePath: string,
   vaultPath: string,
   frontmatter: Record<string, any>
-): string {
-  const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
-
-  if (relativePath.startsWith("MOCs/")) return "moc";
-  if (relativePath.startsWith("Articles/")) return "article";
-  if (relativePath.startsWith("AIChats/")) return "conversation";
-  if (relativePath.startsWith("Books/")) return "book-note";
-  if (relativePath.startsWith("templates/")) return "template";
-
-  // Check frontmatter type
-  if (frontmatter.type) {
-    return frontmatter.type;
-  }
-
-  return "note";
-}
+): string {}
 
killedBy: determineContentType should detect MOC content type
statusReason: expected undefined to be 'moc' // Object.is equality

[Killed] StringLiteral
src/lib/utils.ts:143:52
   vaultPath: string,
   frontmatter: Record<string, any>
 ): string {
-  const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
+  const relativePath = filePath.replace(vaultPath, "Stryker was here!").replace(/^\/+/, "");
 
   if (relativePath.startsWith("MOCs/")) return "moc";
killedBy: determineContentType should detect MOC content type
statusReason: expected 'note' to be 'moc' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils.ts:145:7
 ): string {
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
 
-  if (relativePath.startsWith("MOCs/")) return "moc";
+  if (false) return "moc";
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
killedBy: determineContentType should detect MOC content type
statusReason: expected 'note' to be 'moc' // Object.is equality

[Killed] MethodExpression
src/lib/utils.ts:145:7
 ): string {
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
 
-  if (relativePath.startsWith("MOCs/")) return "moc";
+  if (relativePath.endsWith("MOCs/")) return "moc";
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
killedBy: determineContentType should detect MOC content type
statusReason: expected 'note' to be 'moc' // Object.is equality

[Killed] MethodExpression
src/lib/utils.ts:146:7
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
 
   if (relativePath.startsWith("MOCs/")) return "moc";
-  if (relativePath.startsWith("Articles/")) return "article";
+  if (relativePath.endsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
   if (relativePath.startsWith("Books/")) return "book-note";
killedBy: determineContentType should detect article content type
statusReason: expected 'note' to be 'article' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils.ts:146:7
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
 
   if (relativePath.startsWith("MOCs/")) return "moc";
-  if (relativePath.startsWith("Articles/")) return "article";
+  if (false) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
   if (relativePath.startsWith("Books/")) return "book-note";
killedBy: determineContentType should detect article content type
statusReason: expected 'note' to be 'article' // Object.is equality

[Killed] MethodExpression
src/lib/utils.ts:147:7
 
   if (relativePath.startsWith("MOCs/")) return "moc";
   if (relativePath.startsWith("Articles/")) return "article";
-  if (relativePath.startsWith("AIChats/")) return "conversation";
+  if (relativePath.endsWith("AIChats/")) return "conversation";
   if (relativePath.startsWith("Books/")) return "book-note";
   if (relativePath.startsWith("templates/")) return "template";
killedBy: determineContentType should detect conversation content type
statusReason: expected 'note' to be 'conversation' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils.ts:147:7
 
   if (relativePath.startsWith("MOCs/")) return "moc";
   if (relativePath.startsWith("Articles/")) return "article";
-  if (relativePath.startsWith("AIChats/")) return "conversation";
+  if (false) return "conversation";
   if (relativePath.startsWith("Books/")) return "book-note";
   if (relativePath.startsWith("templates/")) return "template";
killedBy: determineContentType should detect conversation content type
statusReason: expected 'note' to be 'conversation' // Object.is equality

[Killed] MethodExpression
src/lib/utils.ts:148:7
   if (relativePath.startsWith("MOCs/")) return "moc";
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
-  if (relativePath.startsWith("Books/")) return "book-note";
+  if (relativePath.endsWith("Books/")) return "book-note";
   if (relativePath.startsWith("templates/")) return "template";
 
killedBy: determineContentType should detect book-note content type
statusReason: expected 'note' to be 'book-note' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils.ts:148:7
   if (relativePath.startsWith("MOCs/")) return "moc";
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
-  if (relativePath.startsWith("Books/")) return "book-note";
+  if (true) return "book-note";
   if (relativePath.startsWith("templates/")) return "template";
 
killedBy: determineContentType should detect template content type
statusReason: expected 'book-note' to be 'template' // Object.is equality
