[Killed] MethodExpression
src/lib/utils.ts:149:7
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
   if (relativePath.startsWith("Books/")) return "book-note";
-  if (relativePath.startsWith("templates/")) return "template";
+  if (relativePath.endsWith("templates/")) return "template";
 
   // Check frontmatter type
killedBy: determineContentType should detect template content type
statusReason: expected 'note' to be 'template' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils.ts:149:7
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
   if (relativePath.startsWith("Books/")) return "book-note";
-  if (relativePath.startsWith("templates/")) return "template";
+  if (false) return "template";
 
   // Check frontmatter type
killedBy: determineContentType should detect template content type
statusReason: expected 'note' to be 'template' // Object.is equality

[Killed] BlockStatement
src/lib/utils.ts:152:25
   if (relativePath.startsWith("templates/")) return "template";
 
   // Check frontmatter type
-  if (frontmatter.type) {
-    return frontmatter.type;
-  }
+  if (frontmatter.type) {}
 
   return "note";
killedBy: determineContentType should use frontmatter type if available
statusReason: expected 'note' to be 'custom' // Object.is equality

[Killed] StringLiteral
src/lib/utils.ts:156:10
     return frontmatter.type;
   }
 
-  return "note";
+  return "";
 }
 
killedBy: determineContentType should default to note type
statusReason: expected '' to be 'note' // Object.is equality
