[Survived] ObjectLiteral
src/lib/database.ts:16:7
     searchLatency: number[];
     totalQueries: number;
     slowQueries: number;
-  } = {
-    searchLatency: [],
-    totalQueries: 0,
-    slowQueries: 0,
-  };
+  } = {};
 
   constructor(connectionString: string) {

[Killed] BlockStatement
src/lib/database.ts:22:41
     slowQueries: 0,
   };
 
-  constructor(connectionString: string) {
-    this.pool = new Pool({
-      connectionString,
-      max: 20, // Increased for better concurrency
-      min: 5, // Keep minimum connections for faster response
-      idleTimeoutMillis: 30000,
-      connectionTimeoutMillis: 2000,
-      allowExitOnIdle: true,
-    });
-  }
+  constructor(connectionString: string) {}
 
   async initialize(): Promise<void> {
killedBy: ObsidianDatabase should initialize successfully
statusReason: Cannot read properties of undefined (reading 'end')

[Survived] BooleanLiteral
src/lib/database.ts:29:24
       min: 5, // Keep minimum connections for faster response
       idleTimeoutMillis: 30000,
       connectionTimeoutMillis: 2000,
-      allowExitOnIdle: true,
+      allowExitOnIdle: false,
     });
   }

[Killed] ConditionalExpression
src/lib/database.ts:92:9
   }
 
   async upsertChunk(chunk: DocumentChunk): Promise<void> {
-    if (!chunk.embedding || chunk.embedding.length !== this.dimension) {
+    if (true) {
       throw new Error(
         `Embedding dimension mismatch: expected ${this.dimension}, got ${
killedBy: ObsidianDatabase upsertChunk should insert new chunk successfully
statusReason: Embedding dimension mismatch: expected 768, got 768

[Survived] LogicalOperator
src/lib/database.ts:95:11
     if (!chunk.embedding || chunk.embedding.length !== this.dimension) {
       throw new Error(
         `Embedding dimension mismatch: expected ${this.dimension}, got ${
-          chunk.embedding?.length || 0
+          chunk.embedding?.length && 0
         }`
       );

[NoCoverage] StringLiteral
src/lib/database.ts:126:26
 
     const client = await this.pool.connect();
     try {
-      await client.query("BEGIN");
+      await client.query("");
 
       for (const chunk of chunks) {

[Killed] ConditionalExpression
src/lib/database.ts:154:9
       minSimilarity?: number;
     } = {}
   ): Promise<SearchResult[]> {
-    if (queryEmbedding.length !== this.dimension) {
+    if (false) {
       throw new Error(
         `Query embedding dimension mismatch: expected ${this.dimension}, got ${queryEmbedding.length}`
killedBy: ObsidianDatabase search should reject queries with wrong embedding dimension
statusReason: expected [Function] to throw error including 'Query embedding dimension mismatch' but got 'role "postgres" does not exist'

[Survived] UpdateOperator
src/lib/database.ts:161:5
     }
 
     const startTime = performance.now();
-    this.performanceMetrics.totalQueries++;
+    this.performanceMetrics.totalQueries--;
 
     const client = await this.pool.connect();

[NoCoverage] StringLiteral
src/lib/database.ts:165:29
 
     const client = await this.pool.connect();
     try {
-      const vectorLiteral = `'[${queryEmbedding.join(",")}]'`;
+      const vectorLiteral = ``;
 
       // Performance optimization: Use a single, optimized query with conditional clauses

[NoCoverage] StringLiteral
src/lib/database.ts:169:21
 
       // Performance optimization: Use a single, optimized query with conditional clauses
       // This reduces query planning time and improves cacheability
-      const query = `
-        SELECT
-          id,
-          text,
-          meta,
-          1 - (v <#> ${vectorLiteral}::vector) AS cosine_similarity
-        FROM ${this.tableName}
-        WHERE ($2::text[] IS NULL OR meta->>'contentType' = ANY($2))
-          AND ($3::text[] IS NULL OR meta->'obsidianFile'->'tags' ?| $3)
-          AND ($4::text[] IS NULL OR EXISTS (
-            SELECT 1 FROM unnest($4::text[]) AS folder_pattern
-            WHERE meta->'obsidianFile'->>'filePath' LIKE '%' || folder_pattern || '%'
-          ))
-          AND ($5::boolean IS NULL OR (
-            CASE $5
-              WHEN true THEN jsonb_array_length(meta->'obsidianFile'->'wikilinks') > 0
-              ELSE meta->'obsidianFile'->'wikilinks' IS NULL OR jsonb_array_length(meta->'obsidianFile'->'wikilinks') = 0
-            END
-          ))
-          AND ($6::timestamptz IS NULL OR (meta->>'updatedAt')::timestamp >= $6)
-          AND ($7::timestamptz IS NULL OR (meta->>'updatedAt')::timestamp <= $7)
-          AND 1 - (v <#> ${vectorLiteral}::vector) >= COALESCE($8, 0)
-        ORDER BY v <#> ${vectorLiteral}::vector
-        LIMIT $1
-      `;
+      const query = ``;
 
       const params: any[] = [

[NoCoverage] OptionalChaining
src/lib/database.ts:201:9
         options.tags,
         options.folders,
         options.hasWikilinks,
-        options.dateRange?.start,
+        options.dateRange.start,
         options.dateRange?.end,
         options.minSimilarity

[NoCoverage] OptionalChaining
src/lib/database.ts:202:9
         options.folders,
         options.hasWikilinks,
         options.dateRange?.start,
-        options.dateRange?.end,
+        options.dateRange.end,
         options.minSimilarity
       ];

[NoCoverage] ArrowFunction
src/lib/database.ts:208:39
 
       const result = await client.query(query, params);
 
-      const results = result.rows.map((row, index) => ({
-        id: row.id,
-        text: row.text,
-        meta: row.meta as DocumentMetadata,
-        cosineSimilarity: parseFloat(row.cosine_similarity),
-        rank: index + 1,
-      }));
+      const results = result.rows.map(() => undefined);
 
       // Performance monitoring

[NoCoverage] ArithmeticOperator
src/lib/database.ts:218:23
 
       // Performance monitoring
       const endTime = performance.now();
-      const latency = endTime - startTime;
+      const latency = endTime + startTime;
       this.performanceMetrics.searchLatency.push(latency);
 

[NoCoverage] ConditionalExpression
src/lib/database.ts:222:11
       this.performanceMetrics.searchLatency.push(latency);
 
       // Track slow queries (over 500ms target)
-      if (latency > 500) {
+      if (false) {
         this.performanceMetrics.slowQueries++;
         console.warn(`⚠️ Slow search query detected: ${latency.toFixed(2)}ms (target: 500ms)`);

[NoCoverage] EqualityOperator
src/lib/database.ts:222:11
       this.performanceMetrics.searchLatency.push(latency);
 
       // Track slow queries (over 500ms target)
-      if (latency > 500) {
+      if (latency >= 500) {
         this.performanceMetrics.slowQueries++;
         console.warn(`⚠️ Slow search query detected: ${latency.toFixed(2)}ms (target: 500ms)`);

[NoCoverage] UpdateOperator
src/lib/database.ts:223:9
 
       // Track slow queries (over 500ms target)
       if (latency > 500) {
-        this.performanceMetrics.slowQueries++;
+        this.performanceMetrics.slowQueries--;
         console.warn(`⚠️ Slow search query detected: ${latency.toFixed(2)}ms (target: 500ms)`);
       }

[NoCoverage] EqualityOperator
src/lib/database.ts:228:11
       }
 
       // Keep only last 1000 measurements for memory efficiency
-      if (this.performanceMetrics.searchLatency.length > 1000) {
+      if (this.performanceMetrics.searchLatency.length >= 1000) {
         this.performanceMetrics.searchLatency = this.performanceMetrics.searchLatency.slice(-500);
       }

[NoCoverage] BlockStatement
src/lib/database.ts:228:64
       }
 
       // Keep only last 1000 measurements for memory efficiency
-      if (this.performanceMetrics.searchLatency.length > 1000) {
-        this.performanceMetrics.searchLatency = this.performanceMetrics.searchLatency.slice(-500);
-      }
+      if (this.performanceMetrics.searchLatency.length > 1000) {}
 
       return results;

[NoCoverage] MethodExpression
src/lib/database.ts:229:49
 
       // Keep only last 1000 measurements for memory efficiency
       if (this.performanceMetrics.searchLatency.length > 1000) {
-        this.performanceMetrics.searchLatency = this.performanceMetrics.searchLatency.slice(-500);
+        this.performanceMetrics.searchLatency = this.performanceMetrics.searchLatency;
       }
 

[NoCoverage] UnaryOperator
src/lib/database.ts:229:93
 
       // Keep only last 1000 measurements for memory efficiency
       if (this.performanceMetrics.searchLatency.length > 1000) {
-        this.performanceMetrics.searchLatency = this.performanceMetrics.searchLatency.slice(-500);
+        this.performanceMetrics.searchLatency = this.performanceMetrics.searchLatency.slice(+500);
       }
 

[NoCoverage] StringLiteral
src/lib/database.ts:358:26
   async clearAll(): Promise<void> {
     const client = await this.pool.connect();
     try {
-      await client.query(`DELETE FROM ${this.tableName}`);
+      await client.query(``);
       console.log(`🗑️  Cleared all data from ${this.tableName}`);
     } finally {

[NoCoverage] StringLiteral
src/lib/database.ts:369:9
     const client = await this.pool.connect();
     try {
       const result = await client.query(
-        `
-        DELETE FROM ${this.tableName}
-        WHERE meta->'obsidianFile'->>'fileName' = $1
-        `,
+        ``,
         [fileName]
       );

[NoCoverage] BlockStatement
src/lib/database.ts:392:27
    * Get performance metrics for monitoring API latency requirements
    * @returns Performance statistics including p95 latency and slow query count
    */
-  getPerformanceMetrics() {
-    if (this.performanceMetrics.searchLatency.length === 0) {
-      return {
-        totalQueries: this.performanceMetrics.totalQueries,
-        slowQueries: this.performanceMetrics.slowQueries,
-        p95Latency: 0,
-        averageLatency: 0,
-        minLatency: 0,
-        maxLatency: 0,
-      };
-    }
-
-    const sorted = [...this.performanceMetrics.searchLatency].sort((a, b) => a - b);
-    const p95Index = Math.floor(sorted.length * 0.95);
-
-    return {
-      totalQueries: this.performanceMetrics.totalQueries,
-      slowQueries: this.performanceMetrics.slowQueries,
-      p95Latency: sorted[p95Index] || 0,
-      averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
-      minLatency: sorted[0],
-      maxLatency: sorted[sorted.length - 1],
-    };
-  }
+  getPerformanceMetrics() {}
 }
 

[NoCoverage] EqualityOperator
src/lib/database.ts:393:9
    * @returns Performance statistics including p95 latency and slow query count
    */
   getPerformanceMetrics() {
-    if (this.performanceMetrics.searchLatency.length === 0) {
+    if (this.performanceMetrics.searchLatency.length !== 0) {
       return {
         totalQueries: this.performanceMetrics.totalQueries,

[NoCoverage] ConditionalExpression
src/lib/database.ts:393:9
    * @returns Performance statistics including p95 latency and slow query count
    */
   getPerformanceMetrics() {
-    if (this.performanceMetrics.searchLatency.length === 0) {
+    if (true) {
       return {
         totalQueries: this.performanceMetrics.totalQueries,

[NoCoverage] ObjectLiteral
src/lib/database.ts:394:14
    */
   getPerformanceMetrics() {
     if (this.performanceMetrics.searchLatency.length === 0) {
-      return {
-        totalQueries: this.performanceMetrics.totalQueries,
-        slowQueries: this.performanceMetrics.slowQueries,
-        p95Latency: 0,
-        averageLatency: 0,
-        minLatency: 0,
-        maxLatency: 0,
-      };
+      return {};
     }
 

[NoCoverage] MethodExpression
src/lib/database.ts:404:20
       };
     }
 
-    const sorted = [...this.performanceMetrics.searchLatency].sort((a, b) => a - b);
+    const sorted = [...this.performanceMetrics.searchLatency];
     const p95Index = Math.floor(sorted.length * 0.95);
 

[NoCoverage] ArrowFunction
src/lib/database.ts:404:68
       };
     }
 
-    const sorted = [...this.performanceMetrics.searchLatency].sort((a, b) => a - b);
+    const sorted = [...this.performanceMetrics.searchLatency].sort(() => undefined);
     const p95Index = Math.floor(sorted.length * 0.95);
 

[NoCoverage] ArithmeticOperator
src/lib/database.ts:405:33
     }
 
     const sorted = [...this.performanceMetrics.searchLatency].sort((a, b) => a - b);
-    const p95Index = Math.floor(sorted.length * 0.95);
+    const p95Index = Math.floor(sorted.length / 0.95);
 
     return {

[NoCoverage] ConditionalExpression
src/lib/database.ts:410:19
     return {
       totalQueries: this.performanceMetrics.totalQueries,
       slowQueries: this.performanceMetrics.slowQueries,
-      p95Latency: sorted[p95Index] || 0,
+      p95Latency: false,
       averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
       minLatency: sorted[0],

[NoCoverage] ConditionalExpression
src/lib/database.ts:410:19
     return {
       totalQueries: this.performanceMetrics.totalQueries,
       slowQueries: this.performanceMetrics.slowQueries,
-      p95Latency: sorted[p95Index] || 0,
+      p95Latency: true,
       averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
       minLatency: sorted[0],

[NoCoverage] ArithmeticOperator
src/lib/database.ts:411:23
       totalQueries: this.performanceMetrics.totalQueries,
       slowQueries: this.performanceMetrics.slowQueries,
       p95Latency: sorted[p95Index] || 0,
-      averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
+      averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) * sorted.length,
       minLatency: sorted[0],
       maxLatency: sorted[sorted.length - 1],

[NoCoverage] ArithmeticOperator
src/lib/database.ts:411:51
       totalQueries: this.performanceMetrics.totalQueries,
       slowQueries: this.performanceMetrics.slowQueries,
       p95Latency: sorted[p95Index] || 0,
-      averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
+      averageLatency: sorted.reduce((sum, lat) => sum - lat, 0) / sorted.length,
       minLatency: sorted[0],
       maxLatency: sorted[sorted.length - 1],

[NoCoverage] ArithmeticOperator
src/lib/database.ts:413:26
       p95Latency: sorted[p95Index] || 0,
       averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
       minLatency: sorted[0],
-      maxLatency: sorted[sorted.length - 1],
+      maxLatency: sorted[sorted.length + 1],
     };
   }
