[Survived] StringLiteral
src/lib/embeddings.ts:67:9
       strengths: [
         "Excellent for general text",
         "Good performance on knowledge tasks",
-        "Handles long documents well",
+        "",
       ],
       limitations: [

[Killed] LogicalOperator
src/lib/embeddings.ts:84:9
   private createObsidianStrategy(): EmbeddingStrategy {
     return {
       primaryModel:
-        this.models.find((m) => m.name === this.config.model) || this.models[0],
+        this.models.find(m => m.name === this.config.model) && this.models[0],
       fallbackModels: this.models.filter((m) => m.name !== this.config.model),
       contentTypeOverrides: {
killedBy: ObsidianEmbeddingService constructor should handle unknown model gracefully
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] MethodExpression
src/lib/embeddings.ts:85:23
     return {
       primaryModel:
         this.models.find((m) => m.name === this.config.model) || this.models[0],
-      fallbackModels: this.models.filter((m) => m.name !== this.config.model),
+      fallbackModels: this.models,
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations
killedBy: ObsidianEmbeddingService constructor should create strategy with default model
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/embeddings.ts:85:49
     return {
       primaryModel:
         this.models.find((m) => m.name === this.config.model) || this.models[0],
-      fallbackModels: this.models.filter((m) => m.name !== this.config.model),
+      fallbackModels: this.models.filter((m) => false),
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations
killedBy: ObsidianEmbeddingService constructor should create strategy with default model
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ObjectLiteral
src/lib/embeddings.ts:86:29
       primaryModel:
         this.models.find((m) => m.name === this.config.model) || this.models[0],
       fallbackModels: this.models.filter((m) => m.name !== this.config.model),
-      contentTypeOverrides: {
-        // Obsidian-specific content type optimizations
-        moc: this.models.find((m) => m.name === "embeddinggemma")!,
-        article: this.models.find((m) => m.name === "embeddinggemma")!,
-        conversation: this.models.find((m) => m.name === "embeddinggemma")!,
-        "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
-        note: this.models.find((m) => m.name === "embeddinggemma")!,
-      },
+      contentTypeOverrides: {},
       qualityThresholds: {
         minSimilarity: 0.3,

[Killed] EqualityOperator
src/lib/embeddings.ts:88:38
       fallbackModels: this.models.filter((m) => m.name !== this.config.model),
       contentTypeOverrides: {
         // Obsidian-specific content type optimizations
-        moc: this.models.find((m) => m.name === "embeddinggemma")!,
+        moc: this.models.find((m) => m.name !== "embeddinggemma")!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,
killedBy: ObsidianEmbeddingService embedWithStrategy should use content type override
statusReason: expected 'nomic-embed-text' to be 'embeddinggemma' // Object.is equality

[Survived] ConditionalExpression
src/lib/embeddings.ts:90:47
         // Obsidian-specific content type optimizations
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
-        conversation: this.models.find((m) => m.name === "embeddinggemma")!,
+        conversation: this.models.find((m) => true)!,
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
         note: this.models.find((m) => m.name === "embeddinggemma")!,

[Survived] ArrowFunction
src/lib/embeddings.ts:90:40
         // Obsidian-specific content type optimizations
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
-        conversation: this.models.find((m) => m.name === "embeddinggemma")!,
+        conversation: this.models.find(() => undefined)!,
         "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
         note: this.models.find((m) => m.name === "embeddinggemma")!,

[Survived] ConditionalExpression
src/lib/embeddings.ts:91:46
         moc: this.models.find((m) => m.name === "embeddinggemma")!,
         article: this.models.find((m) => m.name === "embeddinggemma")!,
         conversation: this.models.find((m) => m.name === "embeddinggemma")!,
-        "book-note": this.models.find((m) => m.name === "embeddinggemma")!,
+        "book-note": this.models.find((m) => false)!,
         note: this.models.find((m) => m.name === "embeddinggemma")!,
       },

[Killed] ConditionalExpression
src/lib/embeddings.ts:116:35
         input: normalizedText,
       });
 
-      if (!response.embeddings || response.embeddings.length === 0) {
+      if (!response.embeddings || false) {
         throw new Error("No embeddings returned from Ollama");
       }
killedBy: ObsidianEmbeddingService embed should handle empty embeddings response
statusReason: expected [Function] to throw error including 'No embeddings returned from Ollama' but got 'Embedding failed: TypeError: Cannot r…'

[Killed] EqualityOperator
src/lib/embeddings.ts:123:11
       const embedding = response.embeddings[0];
 
       // Validate dimension
-      if (embedding.length !== this.config.dimension) {
+      if (embedding.length === this.config.dimension) {
         throw new Error(
           `Embedding dimension mismatch: expected ${this.config.dimension}, got ${embedding.length}`
killedBy: ObsidianEmbeddingService embed should embed text successfully
statusReason: Embedding failed: Error: Embedding dimension mismatch: expected 768, got 768

[Killed] StringLiteral
src/lib/embeddings.ts:125:11
       // Validate dimension
       if (embedding.length !== this.config.dimension) {
         throw new Error(
-          `Embedding dimension mismatch: expected ${this.config.dimension}, got ${embedding.length}`
+          ``
         );
       }
killedBy: ObsidianEmbeddingService embed should validate embedding dimension
statusReason: expected [Function] to throw error including 'Embedding dimension mismatch' but got 'Embedding failed: Error'

[Killed] ConditionalExpression
src/lib/embeddings.ts:145:21
   async embedBatch(texts: string[], batchSize = 5): Promise<number[][]> {
     const results: number[][] = [];
 
-    for (let i = 0; i < texts.length; i += batchSize) {
+    for (let i = 0; false; i += batchSize) {
       const batch = texts.slice(i, i + batchSize);
       const promises = batch.map((text) => this.embed(text));
killedBy: ObsidianEmbeddingService embedBatch should process batch successfully
statusReason: expected [] to have a length of 3 but got +0

[Survived] ConditionalExpression
src/lib/embeddings.ts:152:11
       results.push(...batchResults);
 
       // Rate limiting - small delay between batches
-      if (i + batchSize < texts.length) {
+      if (true) {
         await new Promise((resolve) => setTimeout(resolve, 100));
       }

[Survived] EqualityOperator
src/lib/embeddings.ts:152:11
       results.push(...batchResults);
 
       // Rate limiting - small delay between batches
-      if (i + batchSize < texts.length) {
+      if (i + batchSize <= texts.length) {
         await new Promise((resolve) => setTimeout(resolve, 100));
       }

[Survived] UpdateOperator
src/lib/embeddings.ts:170:5
     confidence: number;
   }> {
     const startTime = performance.now();
-    this.performanceMetrics.totalRequests++;
+    this.performanceMetrics.totalRequests--;
 
     const normalizedText = normalize(text);

[NoCoverage] BlockStatement
src/lib/embeddings.ts:179:35
 
     // Check cache with model-specific key
     const cacheKey = `${selectedModel.name}:${normalizedText}`;
-    if (this.cache.has(cacheKey)) {
-      this.performanceMetrics.cacheHits++;
-      const endTime = performance.now();
-      this.performanceMetrics.embedLatency.push(endTime - startTime);
-      return {
-        embedding: this.cache.get(cacheKey)!,
-        model: selectedModel,
-        confidence: 1.0, // Cached result
-      };
-    }
+    if (this.cache.has(cacheKey)) {}
 
     this.performanceMetrics.cacheMisses++;

[NoCoverage] UpdateOperator
src/lib/embeddings.ts:180:7
     // Check cache with model-specific key
     const cacheKey = `${selectedModel.name}:${normalizedText}`;
     if (this.cache.has(cacheKey)) {
-      this.performanceMetrics.cacheHits++;
+      this.performanceMetrics.cacheHits--;
       const endTime = performance.now();
       this.performanceMetrics.embedLatency.push(endTime - startTime);

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:182:49
     if (this.cache.has(cacheKey)) {
       this.performanceMetrics.cacheHits++;
       const endTime = performance.now();
-      this.performanceMetrics.embedLatency.push(endTime - startTime);
+      this.performanceMetrics.embedLatency.push(endTime + startTime);
       return {
         embedding: this.cache.get(cacheKey)!,

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:183:14
       this.performanceMetrics.cacheHits++;
       const endTime = performance.now();
       this.performanceMetrics.embedLatency.push(endTime - startTime);
-      return {
-        embedding: this.cache.get(cacheKey)!,
-        model: selectedModel,
-        confidence: 1.0, // Cached result
-      };
+      return {};
     }
 

[Survived] UpdateOperator
src/lib/embeddings.ts:190:5
       };
     }
 
-    this.performanceMetrics.cacheMisses++;
+    this.performanceMetrics.cacheMisses--;
 
     try {

[Survived] EqualityOperator
src/lib/embeddings.ts:217:11
       this.performanceMetrics.embedLatency.push(latency);
 
       // Track slow embeddings (over 1000ms target for embedding)
-      if (latency > 1000) {
+      if (latency <= 1000) {
         this.performanceMetrics.slowEmbeds++;
         console.warn(`⚠️ Slow embedding detected: ${latency.toFixed(2)}ms (target: 1000ms)`);

[Survived] ConditionalExpression
src/lib/embeddings.ts:217:11
       this.performanceMetrics.embedLatency.push(latency);
 
       // Track slow embeddings (over 1000ms target for embedding)
-      if (latency > 1000) {
+      if (true) {
         this.performanceMetrics.slowEmbeds++;
         console.warn(`⚠️ Slow embedding detected: ${latency.toFixed(2)}ms (target: 1000ms)`);

[NoCoverage] UpdateOperator
src/lib/embeddings.ts:218:9
 
       // Track slow embeddings (over 1000ms target for embedding)
       if (latency > 1000) {
-        this.performanceMetrics.slowEmbeds++;
+        this.performanceMetrics.slowEmbeds--;
         console.warn(`⚠️ Slow embedding detected: ${latency.toFixed(2)}ms (target: 1000ms)`);
       }

[Survived] ConditionalExpression
src/lib/embeddings.ts:223:11
       }
 
       // Keep only last 1000 measurements for memory efficiency
-      if (this.performanceMetrics.embedLatency.length > 1000) {
+      if (true) {
         this.performanceMetrics.embedLatency = this.performanceMetrics.embedLatency.slice(-500);
       }

[Survived] EqualityOperator
src/lib/embeddings.ts:223:11
       }
 
       // Keep only last 1000 measurements for memory efficiency
-      if (this.performanceMetrics.embedLatency.length > 1000) {
+      if (this.performanceMetrics.embedLatency.length <= 1000) {
         this.performanceMetrics.embedLatency = this.performanceMetrics.embedLatency.slice(-500);
       }

[NoCoverage] UnaryOperator
src/lib/embeddings.ts:224:91
 
       // Keep only last 1000 measurements for memory efficiency
       if (this.performanceMetrics.embedLatency.length > 1000) {
-        this.performanceMetrics.embedLatency = this.performanceMetrics.embedLatency.slice(-500);
+        this.performanceMetrics.embedLatency = this.performanceMetrics.embedLatency.slice(+500);
       }
 

[NoCoverage] MethodExpression
src/lib/embeddings.ts:224:48
 
       // Keep only last 1000 measurements for memory efficiency
       if (this.performanceMetrics.embedLatency.length > 1000) {
-        this.performanceMetrics.embedLatency = this.performanceMetrics.embedLatency.slice(-500);
+        this.performanceMetrics.embedLatency = this.performanceMetrics.embedLatency;
       }
 

[Survived] StringLiteral
src/lib/embeddings.ts:257:24
             confidence: confidence * 0.8, // Penalty for fallback
           };
         } catch (fallbackError) {
-          console.warn(`Fallback model ${fallbackModel.name} also failed`);
+          console.warn(``);
         }
       }

[Killed] ConditionalExpression
src/lib/embeddings.ts:275:9
     domainHint?: string
   ): EmbeddingModel {
     // Content-type specific overrides for Obsidian
-    if (contentType && this.strategy.contentTypeOverrides[contentType]) {
+    if (true) {
       return this.strategy.contentTypeOverrides[contentType];
     }
killedBy: ObsidianEmbeddingService embedWithStrategy should embed with strategy successfully
statusReason: Cannot read properties of undefined (reading 'name')

[Survived] ConditionalExpression
src/lib/embeddings.ts:280:9
     }
 
     // Domain-specific selection
-    if (domainHint) {
+    if (false) {
       const domainModel = this.models.find(
         (m) => m.domain === domainHint || m.name.includes(domainHint)

[Killed] EqualityOperator
src/lib/embeddings.ts:282:16
     // Domain-specific selection
     if (domainHint) {
       const domainModel = this.models.find(
-        (m) => m.domain === domainHint || m.name.includes(domainHint)
+        (m) => m.domain !== domainHint || m.name.includes(domainHint)
       );
       if (domainModel) return domainModel;
killedBy: ObsidianEmbeddingService selectModelForContent should select model based on domain hint
statusReason: expected 'nomic-embed-text' to be 'embeddinggemma' // Object.is equality

[Survived] LogicalOperator
src/lib/embeddings.ts:282:16
     // Domain-specific selection
     if (domainHint) {
       const domainModel = this.models.find(
-        (m) => m.domain === domainHint || m.name.includes(domainHint)
+        (m) => m.domain === domainHint && m.name.includes(domainHint)
       );
       if (domainModel) return domainModel;

[Killed] ConditionalExpression
src/lib/embeddings.ts:297:9
       input: text,
     });
 
-    if (!response.embeddings || response.embeddings.length === 0) {
+    if (true) {
       throw new Error("No embeddings returned from Ollama");
     }
killedBy: ObsidianEmbeddingService embedWithStrategy should embed with strategy successfully
statusReason: All embedding models failed for text: test text...

[NoCoverage] BlockStatement
src/lib/embeddings.ts:304:53
     const embedding = response.embeddings[0];
 
     // Validate dimension (may vary by model)
-    if (embedding.length !== this.config.dimension) {
-      // Update config dimension if model uses different size
-      this.config.dimension = embedding.length;
-    }
+    if (embedding.length !== this.config.dimension) {}
 
     return normalizeVector(embedding);

[Killed] EqualityOperator
src/lib/embeddings.ts:319:31
     // Simple confidence metric based on embedding properties
     const magnitude = Math.sqrt(embedding.reduce((sum, x) => sum + x * x, 0));
     const sparsity =
-      embedding.filter((x) => Math.abs(x) < 0.01).length / embedding.length;
+      embedding.filter((x) => Math.abs(x) >= 0.01).length / embedding.length;
 
     // High magnitude and low sparsity indicate good embeddings
killedBy: ObsidianEmbeddingService calculateEmbeddingConfidence should boost confidence for Obsidian content
statusReason: expected 0.1 to be greater than 0.1

[Killed] ConditionalExpression
src/lib/embeddings.ts:326:9
     confidence *= 1.0 - sparsity * 0.5; // Penalty for sparsity
 
     // Boost confidence for Obsidian-specific content patterns
-    if (text.includes("[[") || text.includes("#")) {
+    if (true) {
       confidence *= 1.1; // Boost for wikilinks and tags
     }
killedBy: ObsidianEmbeddingService calculateEmbeddingConfidence should boost confidence for Obsidian content
statusReason: expected 0.15242047106606238 to be greater than 0.15242047106606238

[Killed] ObjectLiteral
src/lib/embeddings.ts:349:14
       };
     } catch (error) {
       console.error(`❌ Embedding service test failed: ${error}`);
-      return {
-        success: false,
-        dimension: 0,
-        model: this.config.model,
-      };
+      return {};
     }
   }
killedBy: ObsidianEmbeddingService testConnection should handle connection failure
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
src/lib/embeddings.ts:363:17
 
   updateStrategy(newStrategy: Partial<EmbeddingStrategy>): void {
     this.strategy = { ...this.strategy, ...newStrategy };
-    console.log(`🔄 Updated embedding strategy:`, {
+    console.log(`` {
       primary: this.strategy.primaryModel.name,
       fallbacks: this.strategy.fallbackModels.map((m) => m.name),

[NoCoverage] BlockStatement
src/lib/embeddings.ts:390:60
    * @returns Performance statistics including p95 latency, cache hit rate, and slow embed count
    */
   getPerformanceMetrics() {
-    if (this.performanceMetrics.embedLatency.length === 0) {
-      return {
-        totalRequests: this.performanceMetrics.totalRequests,
-        cacheHits: this.performanceMetrics.cacheHits,
-        cacheMisses: this.performanceMetrics.cacheMisses,
-        cacheHitRate: 0,
-        slowEmbeds: this.performanceMetrics.slowEmbeds,
-        p95Latency: 0,
-        averageLatency: 0,
-        minLatency: 0,
-        maxLatency: 0,
-      };
-    }
+    if (this.performanceMetrics.embedLatency.length === 0) {}
 
     const sorted = [...this.performanceMetrics.embedLatency].sort((a, b) => a - b);

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:390:9
    * @returns Performance statistics including p95 latency, cache hit rate, and slow embed count
    */
   getPerformanceMetrics() {
-    if (this.performanceMetrics.embedLatency.length === 0) {
+    if (this.performanceMetrics.embedLatency.length !== 0) {
       return {
         totalRequests: this.performanceMetrics.totalRequests,

[NoCoverage] ArrowFunction
src/lib/embeddings.ts:404:67
       };
     }
 
-    const sorted = [...this.performanceMetrics.embedLatency].sort((a, b) => a - b);
+    const sorted = [...this.performanceMetrics.embedLatency].sort(() => undefined);
     const p95Index = Math.floor(sorted.length * 0.95);
     const cacheHitRate = this.performanceMetrics.totalRequests > 0

[NoCoverage] MethodExpression
src/lib/embeddings.ts:404:20
       };
     }
 
-    const sorted = [...this.performanceMetrics.embedLatency].sort((a, b) => a - b);
+    const sorted = [...this.performanceMetrics.embedLatency];
     const p95Index = Math.floor(sorted.length * 0.95);
     const cacheHitRate = this.performanceMetrics.totalRequests > 0

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:405:33
     }
 
     const sorted = [...this.performanceMetrics.embedLatency].sort((a, b) => a - b);
-    const p95Index = Math.floor(sorted.length * 0.95);
+    const p95Index = Math.floor(sorted.length / 0.95);
     const cacheHitRate = this.performanceMetrics.totalRequests > 0
       ? (this.performanceMetrics.cacheHits / this.performanceMetrics.totalRequests) * 100

[NoCoverage] EqualityOperator
src/lib/embeddings.ts:406:26
 
     const sorted = [...this.performanceMetrics.embedLatency].sort((a, b) => a - b);
     const p95Index = Math.floor(sorted.length * 0.95);
-    const cacheHitRate = this.performanceMetrics.totalRequests > 0
+    const cacheHitRate = this.performanceMetrics.totalRequests <= 0
       ? (this.performanceMetrics.cacheHits / this.performanceMetrics.totalRequests) * 100
       : 0;

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:406:26
 
     const sorted = [...this.performanceMetrics.embedLatency].sort((a, b) => a - b);
     const p95Index = Math.floor(sorted.length * 0.95);
-    const cacheHitRate = this.performanceMetrics.totalRequests > 0
+    const cacheHitRate = false
       ? (this.performanceMetrics.cacheHits / this.performanceMetrics.totalRequests) * 100
       : 0;

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:407:9
     const sorted = [...this.performanceMetrics.embedLatency].sort((a, b) => a - b);
     const p95Index = Math.floor(sorted.length * 0.95);
     const cacheHitRate = this.performanceMetrics.totalRequests > 0
-      ? (this.performanceMetrics.cacheHits / this.performanceMetrics.totalRequests) * 100
+      ? this.performanceMetrics.cacheHits / this.performanceMetrics.totalRequests / 100
       : 0;
 

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:407:10
     const sorted = [...this.performanceMetrics.embedLatency].sort((a, b) => a - b);
     const p95Index = Math.floor(sorted.length * 0.95);
     const cacheHitRate = this.performanceMetrics.totalRequests > 0
-      ? (this.performanceMetrics.cacheHits / this.performanceMetrics.totalRequests) * 100
+      ? (this.performanceMetrics.cacheHits * this.performanceMetrics.totalRequests) * 100
       : 0;
 

[NoCoverage] ObjectLiteral
src/lib/embeddings.ts:410:12
       ? (this.performanceMetrics.cacheHits / this.performanceMetrics.totalRequests) * 100
       : 0;
 
-    return {
-      totalRequests: this.performanceMetrics.totalRequests,
-      cacheHits: this.performanceMetrics.cacheHits,
-      cacheMisses: this.performanceMetrics.cacheMisses,
-      cacheHitRate: Math.round(cacheHitRate * 100) / 100, // Round to 2 decimal places
-      slowEmbeds: this.performanceMetrics.slowEmbeds,
-      p95Latency: sorted[p95Index] || 0,
-      averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
-      minLatency: sorted[0],
-      maxLatency: sorted[sorted.length - 1],
-    };
+    return {};
   }
 }

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:414:32
       totalRequests: this.performanceMetrics.totalRequests,
       cacheHits: this.performanceMetrics.cacheHits,
       cacheMisses: this.performanceMetrics.cacheMisses,
-      cacheHitRate: Math.round(cacheHitRate * 100) / 100, // Round to 2 decimal places
+      cacheHitRate: Math.round(cacheHitRate / 100) / 100, // Round to 2 decimal places
       slowEmbeds: this.performanceMetrics.slowEmbeds,
       p95Latency: sorted[p95Index] || 0,

[NoCoverage] ArithmeticOperator
src/lib/embeddings.ts:414:21
       totalRequests: this.performanceMetrics.totalRequests,
       cacheHits: this.performanceMetrics.cacheHits,
       cacheMisses: this.performanceMetrics.cacheMisses,
-      cacheHitRate: Math.round(cacheHitRate * 100) / 100, // Round to 2 decimal places
+      cacheHitRate: Math.round(cacheHitRate * 100) * 100, // Round to 2 decimal places
       slowEmbeds: this.performanceMetrics.slowEmbeds,
       p95Latency: sorted[p95Index] || 0,

[NoCoverage] LogicalOperator
src/lib/embeddings.ts:416:19
       cacheMisses: this.performanceMetrics.cacheMisses,
       cacheHitRate: Math.round(cacheHitRate * 100) / 100, // Round to 2 decimal places
       slowEmbeds: this.performanceMetrics.slowEmbeds,
-      p95Latency: sorted[p95Index] || 0,
+      p95Latency: sorted[p95Index] && 0,
       averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
       minLatency: sorted[0],

[NoCoverage] ConditionalExpression
src/lib/embeddings.ts:416:19
       cacheMisses: this.performanceMetrics.cacheMisses,
       cacheHitRate: Math.round(cacheHitRate * 100) / 100, // Round to 2 decimal places
       slowEmbeds: this.performanceMetrics.slowEmbeds,
-      p95Latency: sorted[p95Index] || 0,
+      p95Latency: false,
       averageLatency: sorted.reduce((sum, lat) => sum + lat, 0) / sorted.length,
       minLatency: sorted[0],
