[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:58:5
   constructor(
     database: ObsidianDatabase,
     embeddingService: ObsidianEmbeddingService
-  ) {
-    this.db = database;
-    this.embeddings = embeddingService;
-    this.contentDetector = new MultiModalContentDetector();
-    this.pdfProcessor = new PDFProcessor();
-    this.ocrProcessor = new OCRProcessor();
-    this.officeProcessor = new OfficeProcessor();
-    this.speechProcessor = new SpeechProcessor();
-    this.metadataExtractor = new UniversalMetadataExtractor(
-      this.contentDetector
-    );
-  }
+  ) {}
 
   async ingestFiles(

[NoCoverage] BooleanLiteral
src/lib/multi-modal-ingest.ts:78:22
     const {
       batchSize = 5,
       rateLimitMs = 200,
-      skipExisting = true,
+      skipExisting = false,
       maxFileSize = 50 * 1024 * 1024, // 50MB default
     } = config;

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:79:21
       batchSize = 5,
       rateLimitMs = 200,
       skipExisting = true,
-      maxFileSize = 50 * 1024 * 1024, // 50MB default
+      maxFileSize = 50 * 1024 / 1024, // 50MB default
     } = config;
 

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:79:21
       batchSize = 5,
       rateLimitMs = 200,
       skipExisting = true,
-      maxFileSize = 50 * 1024 * 1024, // 50MB default
+      maxFileSize = 50 / 1024 * 1024, // 50MB default
     } = config;
 

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:96:50
     >;
 
     // Initialize stats
-    Object.values(ContentType).forEach((type) => {
-      contentTypeStats[type] = 0;
-    });
+    Object.values(ContentType).forEach((type) => {});
 
     // Process files in batches

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:101:21
     });
 
     // Process files in batches
-    for (let i = 0; i < filePaths.length; i += batchSize) {
+    for (let i = 0; i >= filePaths.length; i += batchSize) {
       const batch = filePaths.slice(i, i + batchSize);
       console.log(

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:101:43
     });
 
     // Process files in batches
-    for (let i = 0; i < filePaths.length; i += batchSize) {
+    for (let i = 0; i < filePaths.length; i -= batchSize) {
       const batch = filePaths.slice(i, i + batchSize);
       console.log(

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:102:40
 
     // Process files in batches
     for (let i = 0; i < filePaths.length; i += batchSize) {
-      const batch = filePaths.slice(i, i + batchSize);
+      const batch = filePaths.slice(i, i - batchSize);
       console.log(
         `⚙️  Processing batch ${Math.floor(i / batchSize) + 1}/${Math.ceil(

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:102:21
 
     // Process files in batches
     for (let i = 0; i < filePaths.length; i += batchSize) {
-      const batch = filePaths.slice(i, i + batchSize);
+      const batch = filePaths;
       console.log(
         `⚙️  Processing batch ${Math.floor(i / batchSize) + 1}/${Math.ceil(

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:104:44
     for (let i = 0; i < filePaths.length; i += batchSize) {
       const batch = filePaths.slice(i, i + batchSize);
       console.log(
-        `⚙️  Processing batch ${Math.floor(i / batchSize) + 1}/${Math.ceil(
+        `⚙️  Processing batch ${Math.floor(i * batchSize) + 1}/${Math.ceil(
           filePaths.length / batchSize
         )}`

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:104:33
     for (let i = 0; i < filePaths.length; i += batchSize) {
       const batch = filePaths.slice(i, i + batchSize);
       console.log(
-        `⚙️  Processing batch ${Math.floor(i / batchSize) + 1}/${Math.ceil(
+        `⚙️  Processing batch ${Math.floor(i / batchSize) - 1}/${Math.ceil(
           filePaths.length / batchSize
         )}`

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:105:11
       const batch = filePaths.slice(i, i + batchSize);
       console.log(
         `⚙️  Processing batch ${Math.floor(i / batchSize) + 1}/${Math.ceil(
-          filePaths.length / batchSize
+          filePaths.length * batchSize
         )}`
       );

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:116:9
           ...config,
         });
 
-        processedFiles += batchResults.processedFiles;
+        processedFiles -= batchResults.processedFiles;
         skippedFiles += batchResults.skippedFiles;
         failedFiles += batchResults.failedFiles;

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:117:9
         });
 
         processedFiles += batchResults.processedFiles;
-        skippedFiles += batchResults.skippedFiles;
+        skippedFiles -= batchResults.skippedFiles;
         failedFiles += batchResults.failedFiles;
         totalChunks += batchResults.totalChunks;

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:118:9
 
         processedFiles += batchResults.processedFiles;
         skippedFiles += batchResults.skippedFiles;
-        failedFiles += batchResults.failedFiles;
+        failedFiles -= batchResults.failedFiles;
         totalChunks += batchResults.totalChunks;
         processedChunks += batchResults.processedChunks;

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:119:9
         processedFiles += batchResults.processedFiles;
         skippedFiles += batchResults.skippedFiles;
         failedFiles += batchResults.failedFiles;
-        totalChunks += batchResults.totalChunks;
+        totalChunks -= batchResults.totalChunks;
         processedChunks += batchResults.processedChunks;
         errors.push(...batchResults.errors);

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:120:9
         skippedFiles += batchResults.skippedFiles;
         failedFiles += batchResults.failedFiles;
         totalChunks += batchResults.totalChunks;
-        processedChunks += batchResults.processedChunks;
+        processedChunks -= batchResults.processedChunks;
         errors.push(...batchResults.errors);
 

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:125:30
 
         // Update content type stats
         Object.entries(batchResults.contentTypeStats).forEach(
-          ([type, count]) => {
-            contentTypeStats[type as ContentType] += count;
-          }
+          ([type, count]) => {}
         );
 

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:126:13
         // Update content type stats
         Object.entries(batchResults.contentTypeStats).forEach(
           ([type, count]) => {
-            contentTypeStats[type as ContentType] += count;
+            contentTypeStats[type as ContentType] -= count;
           }
         );

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:131:13
         );
 
         // Rate limiting
-        if (i + batchSize < filePaths.length) {
+        if (i - batchSize < filePaths.length) {
           await new Promise((resolve) => setTimeout(resolve, rateLimitMs));
         }

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:131:13
         );
 
         // Rate limiting
-        if (i + batchSize < filePaths.length) {
+        if (false) {
           await new Promise((resolve) => setTimeout(resolve, rateLimitMs));
         }

[NoCoverage] ArrowFunction
src/lib/multi-modal-ingest.ts:132:29
 
         // Rate limiting
         if (i + batchSize < filePaths.length) {
-          await new Promise((resolve) => setTimeout(resolve, rateLimitMs));
+          await new Promise(() => undefined);
         }
       } catch (error) {

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:134:23
         if (i + batchSize < filePaths.length) {
           await new Promise((resolve) => setTimeout(resolve, rateLimitMs));
         }
-      } catch (error) {
-        const errorMsg = `Batch ${
-          Math.floor(i / batchSize) + 1
-        } failed: ${error}`;
-        console.error(`❌ ${errorMsg}`);
-        errors.push(errorMsg);
-        failedFiles += batch.length;
-      }
+      } catch (error) {}
     }
 

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:136:22
         }
       } catch (error) {
         const errorMsg = `Batch ${
-          Math.floor(i / batchSize) + 1
+          Math.floor(i * batchSize) + 1
         } failed: ${error}`;
         console.error(`❌ ${errorMsg}`);

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:136:11
         }
       } catch (error) {
         const errorMsg = `Batch ${
-          Math.floor(i / batchSize) + 1
+          Math.floor(i / batchSize) - 1
         } failed: ${error}`;
         console.error(`❌ ${errorMsg}`);

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:140:9
         } failed: ${error}`;
         console.error(`❌ ${errorMsg}`);
         errors.push(errorMsg);
-        failedFiles += batch.length;
+        failedFiles -= batch.length;
       }
     }

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:155:17
       contentTypeStats,
     };
 
-    console.log(`✅ Multi-modal ingestion complete:`, result);
+    console.log(``, result);
     return result;
   }

[NoCoverage] ArrayDeclaration
src/lib/multi-modal-ingest.ts:176:30
     let failedFiles = 0;
     let totalChunks = 0;
     let processedChunks = 0;
-    const errors: string[] = [];
+    const errors: string[] = ["Stryker was here"];
     const contentTypeStats: Record<ContentType, number> = {} as Record<
       ContentType,

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:189:21
 
     for (const filePath of filePaths) {
       try {
-        console.log(`📖 Processing: ${path.basename(filePath)}`);
+        console.log(``;
 
         // Check file size

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:193:49
 
         // Check file size
         const stats = fs.statSync(filePath);
-        if (stats.size > (config.maxFileSize || 50 * 1024 * 1024)) {
+        if (stats.size > (config.maxFileSize || 50 * 1024 / 1024)) {
           console.log(
             `⏭️  Skipping large file: ${path.basename(filePath)} (${

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:193:27
 
         // Check file size
         const stats = fs.statSync(filePath);
-        if (stats.size > (config.maxFileSize || 50 * 1024 * 1024)) {
+        if (stats.size > (config.maxFileSize && 50 * 1024 * 1024)) {
           console.log(
             `⏭️  Skipping large file: ${path.basename(filePath)} (${

[NoCoverage] UpdateOperator
src/lib/multi-modal-ingest.ts:199:11
               stats.size
             } bytes)`
           );
-          skippedFiles++;
+          skippedFiles--;
           continue;
         }

[NoCoverage] UpdateOperator
src/lib/multi-modal-ingest.ts:207:9
         const metadata = await this.metadataExtractor.extractMetadata(filePath);
 
         // Update content type stats
-        contentTypeStats[metadata.content.type]++;
+        contentTypeStats[metadata.content.type]--;
 
         // Skip if processing failed

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:210:13
         contentTypeStats[metadata.content.type]++;
 
         // Skip if processing failed
-        if (!metadata.processing.success) {
+        if (true) {
           console.log(
             `⏭️  Skipping failed processing: ${path.basename(filePath)}`

[NoCoverage] BooleanLiteral
src/lib/multi-modal-ingest.ts:210:13
         contentTypeStats[metadata.content.type]++;
 
         // Skip if processing failed
-        if (!metadata.processing.success) {
+        if (metadata.processing.success) {
           console.log(
             `⏭️  Skipping failed processing: ${path.basename(filePath)}`

[NoCoverage] UpdateOperator
src/lib/multi-modal-ingest.ts:214:11
           console.log(
             `⏭️  Skipping failed processing: ${path.basename(filePath)}`
           );
-          failedFiles++;
+          failedFiles--;
           continue;
         }

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:221:9
         // Generate chunks from the file
         const chunks = await this.chunkMultiModalFile(metadata);
 
-        totalChunks += chunks.length;
+        totalChunks -= chunks.length;
 
         // Process each chunk

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:227:17
         for (const chunk of chunks) {
           try {
             // Check if chunk already exists
-            if (config.skipExisting) {
+            if (false) {
               const existing = await this.db.getChunkById(chunk.id);
               if (existing) {

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:227:38
         for (const chunk of chunks) {
           try {
             // Check if chunk already exists
-            if (config.skipExisting) {
-              const existing = await this.db.getChunkById(chunk.id);
-              if (existing) {
-                console.log(
-                  `⏭️  Skipping existing chunk: ${chunk.id.slice(0, 8)}...`
-                );
-                continue;
-              }
-            }
+            if (config.skipExisting) {}
 
             console.log(

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:229:19
             // Check if chunk already exists
             if (config.skipExisting) {
               const existing = await this.db.getChunkById(chunk.id);
-              if (existing) {
+              if (true) {
                 console.log(
                   `⏭️  Skipping existing chunk: ${chunk.id.slice(0, 8)}...`

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:229:19
             // Check if chunk already exists
             if (config.skipExisting) {
               const existing = await this.db.getChunkById(chunk.id);
-              if (existing) {
+              if (false) {
                 console.log(
                   `⏭️  Skipping existing chunk: ${chunk.id.slice(0, 8)}...`

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:231:51
               const existing = await this.db.getChunkById(chunk.id);
               if (existing) {
                 console.log(
-                  `⏭️  Skipping existing chunk: ${chunk.id.slice(0, 8)}...`
+                  `⏭️  Skipping existing chunk: ${chunk.id}...`
                 );
                 continue;

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:238:38
             }
 
             console.log(
-              `🔮 Embedding chunk: ${chunk.id.slice(0, 8)}... (${
+              `🔮 Embedding chunk: ${cchunk.id... (${
                 chunk.text.length
               } chars)`

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:238:15
             }
 
             console.log(
-              `🔮 Embedding chunk: ${chunk.id.slice(0, 8)}... (${
-                chunk.text.length
-              } chars)`
+              ``
             );
 

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:247:15
             const embeddingResult = await this.embeddings.embedWithStrategy(
               chunk.text,
               this.mapContentTypeToStrategy(metadata.content.type),
-              "knowledge-base"
+              ""
             );
 

[NoCoverage] UpdateOperator
src/lib/multi-modal-ingest.ts:256:13
               embedding: embeddingResult.embedding,
             });
 
-            processedChunks++;
+            processedChunks--;
           } catch (error) {
             console.error(`❌ Failed to process chunk ${chunk.id}: ${error}`);

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:257:27
             });
 
             processedChunks++;
-          } catch (error) {
-            console.error(`❌ Failed to process chunk ${chunk.id}: ${error}`);
-            errors.push(`Chunk ${chunk.id}: ${error}`);
-          }
+          } catch (error) {}
         }
 

[NoCoverage] UpdateOperator
src/lib/multi-modal-ingest.ts:263:9
           }
         }
 
-        processedFiles++;
+        processedFiles--;
       } catch (error) {
         console.error(`❌ Failed to process file ${filePath}: ${error}`);

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:264:23
         }
 
         processedFiles++;
-      } catch (error) {
-        console.error(`❌ Failed to process file ${filePath}: ${error}`);
-        errors.push(`File ${filePath}: ${error}`);
-        failedFiles++;
-      }
+      } catch (error) {}
     }
 

[NoCoverage] UpdateOperator
src/lib/multi-modal-ingest.ts:267:9
       } catch (error) {
         console.error(`❌ Failed to process file ${filePath}: ${error}`);
         errors.push(`File ${filePath}: ${error}`);
-        failedFiles++;
+        failedFiles--;
       }
     }

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:271:12
       }
     }
 
-    return {
-      processedFiles,
-      skippedFiles,
-      failedFiles,
-      totalChunks,
-      processedChunks,
-      errors,
-      contentTypeStats,
-    };
+    return {};
   }
 

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:289:44
     const buffer = fs.readFileSync(filePath);
 
     // Base metadata for chunks
-    const baseMetadata: DocumentMetadata = {
-      uri: `file://${filePath}`,
-      section: metadata.file.name,
-      breadcrumbs: this.generateBreadcrumbs(filePath),
-      contentType: this.mapContentType(metadata.content.type),
-      sourceType: "multi-modal",
-      sourceDocumentId: metadata.file.name,
-      lang: metadata.content.language || "en",
-      acl: "public",
-      updatedAt: metadata.file.modifiedAt,
-      createdAt: metadata.file.createdAt,
-      chunkIndex: 0,
-      chunkCount: 1,
-      // Enhanced multi-modal metadata
-      multiModalFile: {
-        fileId: metadata.file.id,
-        contentType: metadata.content.type,
-        mimeType: metadata.file.mimeType,
-        checksum: metadata.file.checksum,
-        quality: metadata.quality,
-        processing: metadata.processing,
-      },
-    };
+    const baseMetadata: DocumentMetadata = {};
 
     // Generate chunks based on content type

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:294:19
       section: metadata.file.name,
       breadcrumbs: this.generateBreadcrumbs(filePath),
       contentType: this.mapContentType(metadata.content.type),
-      sourceType: "multi-modal",
+      sourceType: "",
       sourceDocumentId: metadata.file.name,
       lang: metadata.content.language || "en",

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:296:13
       contentType: this.mapContentType(metadata.content.type),
       sourceType: "multi-modal",
       sourceDocumentId: metadata.file.name,
-      lang: metadata.content.language || "en",
+      lang: true,
       acl: "public",
       updatedAt: metadata.file.modifiedAt,

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:296:13
       contentType: this.mapContentType(metadata.content.type),
       sourceType: "multi-modal",
       sourceDocumentId: metadata.file.name,
-      lang: metadata.content.language || "en",
+      lang: false,
       acl: "public",
       updatedAt: metadata.file.modifiedAt,

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:316:7
     // Generate chunks based on content type
     switch (metadata.content.type) {
       case ContentType.MARKDOWN:
-      case ContentType.PLAIN_TEXT:
-        return await this.chunkTextFile(buffer, baseMetadata, metadata);
+      case ContentType.PLAIN_TEXT:
 
       case ContentType.PDF:

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:319:7
       case ContentType.PLAIN_TEXT:
         return await this.chunkTextFile(buffer, baseMetadata, metadata);
 
-      case ContentType.PDF:
-        return await this.chunkPDFFile(buffer, baseMetadata, metadata);
+      case ContentType.PDF:
 
       case ContentType.OFFICE_DOC:

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:324:7
 
       case ContentType.OFFICE_DOC:
       case ContentType.OFFICE_SHEET:
-      case ContentType.OFFICE_PRESENTATION:
-        return await this.chunkOfficeFile(buffer, baseMetadata, metadata);
+      case ContentType.OFFICE_PRESENTATION:
 
       case ContentType.RASTER_IMAGE:

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:328:7
         return await this.chunkOfficeFile(buffer, baseMetadata, metadata);
 
       case ContentType.RASTER_IMAGE:
-      case ContentType.VECTOR_IMAGE:
-        return await this.chunkImageFile(buffer, baseMetadata, metadata);
+      case ContentType.VECTOR_IMAGE:
 
       case ContentType.AUDIO:

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:331:7
       case ContentType.VECTOR_IMAGE:
         return await this.chunkImageFile(buffer, baseMetadata, metadata);
 
-      case ContentType.AUDIO:
-        return await this.chunkAudioFile(buffer, baseMetadata, metadata);
+      case ContentType.AUDIO:
 
       case ContentType.VIDEO:

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:334:7
       case ContentType.AUDIO:
         return await this.chunkAudioFile(buffer, baseMetadata, metadata);
 
-      case ContentType.VIDEO:
-        return await this.chunkVideoFile(buffer, baseMetadata, metadata);
+      case ContentType.VIDEO:
 
       case ContentType.JSON:

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:339:7
 
       case ContentType.JSON:
       case ContentType.XML:
-      case ContentType.CSV:
-        return await this.chunkStructuredFile(buffer, baseMetadata, metadata);
+      case ContentType.CSV:
 
       default:

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:342:7
       case ContentType.CSV:
         return await this.chunkStructuredFile(buffer, baseMetadata, metadata);
 
-      default:
-        // For unsupported types, create a single chunk with metadata
-        return [this.createMetadataOnlyChunk(baseMetadata, metadata)];
+      default:
     }
   }

[NoCoverage] ArrayDeclaration
src/lib/multi-modal-ingest.ts:344:16
 
       default:
         // For unsupported types, create a single chunk with metadata
-        return [this.createMetadataOnlyChunk(baseMetadata, metadata)];
+        return [];
     }
   }

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:354:18
     metadata: UniversalMetadata,
     preExtractedText?: string
   ): Promise<DocumentChunk[]> {
-    const text = preExtractedText || buffer.toString("utf8");
+    const text = preExtractedText && buffer.toString("utf8");
     const cleanedText = cleanMarkdown(text);
 

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:354:18
     metadata: UniversalMetadata,
     preExtractedText?: string
   ): Promise<DocumentChunk[]> {
-    const text = preExtractedText || buffer.toString("utf8");
+    const text = false;
     const cleanedText = cleanMarkdown(text);
 

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:359:24
 
     // Simple chunking by paragraphs or size
     const chunks: DocumentChunk[] = [];
-    const paragraphs = cleanedText
-      .split("\n\n")
-      .filter((p) => p.trim().length > 0);
+    const paragraphs = cleanedText.split("\n\n");
     const maxChunkSize = 800;
 

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:361:22
     const chunks: DocumentChunk[] = [];
     const paragraphs = cleanedText
       .split("\n\n")
-      .filter((p) => p.trim().length > 0);
+      .filter((p) => p.trim().length <= 0);
     const maxChunkSize = 800;
 

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:361:22
     const chunks: DocumentChunk[] = [];
     const paragraphs = cleanedText
       .split("\n\n")
-      .filter((p) => p.trim().length > 0);
+      .filter((p) => p.trim().length >= 0);
     const maxChunkSize = 800;
 

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:367:41
     let currentChunk = "";
     let chunkIndex = 0;
 
-    for (const paragraph of paragraphs) {
-      if (
-        (currentChunk + paragraph).length > maxChunkSize &&
-        currentChunk.length > 0
-      ) {
-        // Create chunk
-        chunks.push({
-          id: this.generateChunkId(metadata.file.id, chunkIndex),
-          text: currentChunk.trim(),
-          meta: {
-            ...baseMetadata,
-            section: `${baseMetadata.section} (Part ${chunkIndex + 1})`,
-            chunkIndex,
-            chunkCount: Math.ceil(cleanedText.length / maxChunkSize),
-          },
-        });
-
-        currentChunk = paragraph;
-        chunkIndex++;
-      } else {
-        currentChunk += (currentChunk ? "\n\n" : "") + paragraph;
-      }
-    }
+    for (const paragraph of paragraphs) {}
 
     // Add final chunk

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:369:9
 
     for (const paragraph of paragraphs) {
       if (
-        (currentChunk + paragraph).length > maxChunkSize &&
-        currentChunk.length > 0
+        (currentChunk + paragraph).length > maxChunkSize || currentChunk.length > 0
       ) {
         // Create chunk

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:369:9
 
     for (const paragraph of paragraphs) {
       if (
-        (currentChunk + paragraph).length > maxChunkSize &&
+        (currentChunk + paragraph).length >= maxChunkSize &&
         currentChunk.length > 0
       ) {

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:370:9
     for (const paragraph of paragraphs) {
       if (
         (currentChunk + paragraph).length > maxChunkSize &&
-        currentChunk.length > 0
+        currentChunk.length <= 0
       ) {
         // Create chunk

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:370:9
     for (const paragraph of paragraphs) {
       if (
         (currentChunk + paragraph).length > maxChunkSize &&
-        currentChunk.length > 0
+        currentChunk.length >= 0
       ) {
         // Create chunk

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:371:9
       if (
         (currentChunk + paragraph).length > maxChunkSize &&
         currentChunk.length > 0
-      ) {
-        // Create chunk
-        chunks.push({
-          id: this.generateChunkId(metadata.file.id, chunkIndex),
-          text: currentChunk.trim(),
-          meta: {
-            ...baseMetadata,
-            section: `${baseMetadata.section} (Part ${chunkIndex + 1})`,
-            chunkIndex,
-            chunkCount: Math.ceil(cleanedText.length / maxChunkSize),
-          },
-        });
-
-        currentChunk = paragraph;
-        chunkIndex++;
-      } else {
+      ) {} else {
         currentChunk += (currentChunk ? "\n\n" : "") + paragraph;
       }

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:375:17
         // Create chunk
         chunks.push({
           id: this.generateChunkId(metadata.file.id, chunkIndex),
-          text: currentChunk.trim(),
+          text: currentChunk,
           meta: {
             ...baseMetadata,

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:378:55
           text: currentChunk.trim(),
           meta: {
             ...baseMetadata,
-            section: `${baseMetadata.section} (Part ${chunkIndex + 1})`,
+            section: `${baseMetadata.section} (Part ${chunkIndex - 1})`,
             chunkIndex,
             chunkCount: Math.ceil(cleanedText.length / maxChunkSize),

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:378:22
           text: currentChunk.trim(),
           meta: {
             ...baseMetadata,
-            section: `${baseMetadata.section} (Part ${chunkIndex + 1})`,
+            section: ``,
             chunkIndex,
             chunkCount: Math.ceil(cleanedText.length / maxChunkSize),

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:380:35
             ...baseMetadata,
             section: `${baseMetadata.section} (Part ${chunkIndex + 1})`,
             chunkIndex,
-            chunkCount: Math.ceil(cleanedText.length / maxChunkSize),
+            chunkCount: Math.ceil(cleanedText.length * maxChunkSize),
           },
         });

[NoCoverage] UpdateOperator
src/lib/multi-modal-ingest.ts:385:9
         });
 
         currentChunk = paragraph;
-        chunkIndex++;
+        chunkIndex--;
       } else {
         currentChunk += (currentChunk ? "\n\n" : "") + paragraph;

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:386:14
 
         currentChunk = paragraph;
         chunkIndex++;
-      } else {
-        currentChunk += (currentChunk ? "\n\n" : "") + paragraph;
-      }
+      } else {}
     }
 

[NoCoverage] AssignmentOperator
src/lib/multi-modal-ingest.ts:387:9
         currentChunk = paragraph;
         chunkIndex++;
       } else {
-        currentChunk += (currentChunk ? "\n\n" : "") + paragraph;
+        currentChunk -= (currentChunk ? "\n\n" : "") + paragraph;
       }
     }

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:387:25
         currentChunk = paragraph;
         chunkIndex++;
       } else {
-        currentChunk += (currentChunk ? "\n\n" : "") + paragraph;
+        currentChunk += (currentChunk ? "\n\n" : "") - paragraph;
       }
     }

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:392:9
     }
 
     // Add final chunk
-    if (currentChunk.trim()) {
+    if (currentChunk) {
       chunks.push({
         id: this.generateChunkId(metadata.file.id, chunkIndex),

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:392:9
     }
 
     // Add final chunk
-    if (currentChunk.trim()) {
+    if (true) {
       chunks.push({
         id: this.generateChunkId(metadata.file.id, chunkIndex),
