[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:396:15
       chunks.push({
         id: this.generateChunkId(metadata.file.id, chunkIndex),
         text: currentChunk.trim(),
-        meta: {
-          ...baseMetadata,
-          section: `${baseMetadata.section} (Part ${chunkIndex + 1})`,
-          chunkIndex,
-          chunkCount: chunkIndex + 1,
-        },
+        meta: {},
       });
     }

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:400:23
           ...baseMetadata,
           section: `${baseMetadata.section} (Part ${chunkIndex + 1})`,
           chunkIndex,
-          chunkCount: chunkIndex + 1,
+          chunkCount: chunkIndex - 1,
         },
       });

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:418:41
       const pdfResult = await this.pdfProcessor.extractTextFromBuffer(buffer);
 
       // If PDF has extractable text, chunk it like regular text
-      if (pdfResult.metadata.hasText && pdfResult.text.length > 0) {
+      if (pdfResult.metadata.hasText && pdfResult.text.length >= 0) {
         return await this.chunkTextFile(
           buffer,

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:418:11
       const pdfResult = await this.pdfProcessor.extractTextFromBuffer(buffer);
 
       // If PDF has extractable text, chunk it like regular text
-      if (pdfResult.metadata.hasText && pdfResult.text.length > 0) {
+      if (false) {
         return await this.chunkTextFile(
           buffer,

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:431:11
       const chunk: DocumentChunk = {
         id: this.generateChunkId(metadata.file.id, 0),
         text:
-          `PDF Document: ${metadata.file.name}\n` +
+          `` +
           `Type: ${metadata.content.type}\n` +
           `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:432:11
         id: this.generateChunkId(metadata.file.id, 0),
         text:
           `PDF Document: ${metadata.file.name}\n` +
-          `Type: ${metadata.content.type}\n` +
+          `` +
           `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:433:21
         text:
           `PDF Document: ${metadata.file.name}\n` +
           `Type: ${metadata.content.type}\n` +
-          `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +
+          `Pages: ${true}\n` +
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
           `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:433:21
         text:
           `PDF Document: ${metadata.file.name}\n` +
           `Type: ${metadata.content.type}\n` +
-          `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +
+          `Pages: ${false}\n` +
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
           `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:434:53
           `PDF Document: ${metadata.file.name}\n` +
           `Type: ${metadata.content.type}\n` +
           `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +
-          `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
+          `Has Text: ${pdfResult.metadata.hasText ? "" : "No"}\n` +
           `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +
           `Author: ${pdfResult.metadata.pdfMetadata?.author || "Unknown"}\n` +

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:435:26
           `Type: ${metadata.content.type}\n` +
           `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
-          `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +
+          `Word Count: ${pdfResult.metadata.wordCount && 0}\n` +
           `Author: ${pdfResult.metadata.pdfMetadata?.author || "Unknown"}\n` +
           `Title: ${pdfResult.metadata.pdfMetadata?.title || "Unknown"}`,

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:435:26
           `Type: ${metadata.content.type}\n` +
           `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
-          `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +
+          `Word Count: ${true}\n` +
           `Author: ${pdfResult.metadata.pdfMetadata?.author || "Unknown"}\n` +
           `Title: ${pdfResult.metadata.pdfMetadata?.title || "Unknown"}`,

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:436:22
           `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
           `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +
-          `Author: ${pdfResult.metadata.pdfMetadata?.author || "Unknown"}\n` +
+          `Author: ${true}\n` +
           `Title: ${pdfResult.metadata.pdfMetadata?.title || "Unknown"}`,
         meta: {

[NoCoverage] OptionalChaining
src/lib/multi-modal-ingest.ts:436:22
           `Pages: ${pdfResult.metadata.pageCount || "Unknown"}\n` +
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
           `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +
-          `Author: ${pdfResult.metadata.pdfMetadata?.author || "Unknown"}\n` +
+          `Author: ${pdfResult.metadata.pdfMetadata.author || "Unknown"}\n` +
           `Title: ${pdfResult.metadata.pdfMetadata?.title || "Unknown"}`,
         meta: {

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:437:21
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
           `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +
           `Author: ${pdfResult.metadata.pdfMetadata?.author || "Unknown"}\n` +
-          `Title: ${pdfResult.metadata.pdfMetadata?.title || "Unknown"}`,
+          `Title: ${true}`,
         meta: {
           ...baseMetadata,

[NoCoverage] OptionalChaining
src/lib/multi-modal-ingest.ts:437:21
           `Has Text: ${pdfResult.metadata.hasText ? "Yes" : "No"}\n` +
           `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +
           `Author: ${pdfResult.metadata.pdfMetadata?.author || "Unknown"}\n` +
-          `Title: ${pdfResult.metadata.pdfMetadata?.title || "Unknown"}`,
+          `Title: ${pdfResult.metadata.pdfMetadata.title || "Unknown"}`,
         meta: {
           ...baseMetadata,

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:438:15
           `Word Count: ${pdfResult.metadata.wordCount || 0}\n` +
           `Author: ${pdfResult.metadata.pdfMetadata?.author || "Unknown"}\n` +
           `Title: ${pdfResult.metadata.pdfMetadata?.title || "Unknown"}`,
-        meta: {
-          ...baseMetadata,
-          chunkIndex: 0,
-          chunkCount: 1,
-        },
+        meta: {},
       };
 

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:446:21
       };
 
       return [chunk];
-    } catch (error) {
-      // Fallback for PDF processing errors
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-      const chunk: DocumentChunk = {
-        id: this.generateChunkId(metadata.file.id, 0),
-        text: `PDF Document: ${metadata.file.name}\nType: ${metadata.content.type}\nError: ${errorMessage}`,
-        meta: {
-          ...baseMetadata,
-          chunkIndex: 0,
-          chunkCount: 1,
-        },
-      };
-
-      return [chunk];
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:453:15
       const chunk: DocumentChunk = {
         id: this.generateChunkId(metadata.file.id, 0),
         text: `PDF Document: ${metadata.file.name}\nType: ${metadata.content.type}\nError: ${errorMessage}`,
-        meta: {
-          ...baseMetadata,
-          chunkIndex: 0,
-          chunkCount: 1,
-        },
+        meta: {},
       };
 

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:477:44
       );
 
       // If Office document has extractable text, chunk it like regular text
-      if (officeResult.metadata.hasText && officeResult.text.length > 0) {
+      if (officeResult.metadata.hasText && officeResult.text.length >= 0) {
         // For substantial content, use text chunking
         if (officeResult.text.length > 500) {

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:477:11
       );
 
       // If Office document has extractable text, chunk it like regular text
-      if (officeResult.metadata.hasText && officeResult.text.length > 0) {
+      if (officeResult.metadata.hasText || officeResult.text.length > 0) {
         // For substantial content, use text chunking
         if (officeResult.text.length > 500) {

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:479:13
       // If Office document has extractable text, chunk it like regular text
       if (officeResult.metadata.hasText && officeResult.text.length > 0) {
         // For substantial content, use text chunking
-        if (officeResult.text.length > 500) {
+        if (true) {
           return await this.chunkTextFile(
             buffer,

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:479:13
       // If Office document has extractable text, chunk it like regular text
       if (officeResult.metadata.hasText && officeResult.text.length > 0) {
         // For substantial content, use text chunking
-        if (officeResult.text.length > 500) {
+        if (officeResult.text.length >= 500) {
           return await this.chunkTextFile(
             buffer,

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:486:16
             metadata,
             officeResult.text
           );
-        } else {
-          // For shorter content, create a single enriched chunk
-          const chunk: DocumentChunk = {
-            id: this.generateChunkId(metadata.file.id, 0),
-            text:
-              `${this.getOfficeTypeLabel(metadata.content.type)}: ${
-                metadata.file.name
-              }\n` +
-              `Word Count: ${officeResult.metadata.wordCount}\n` +
-              `Language: ${officeResult.metadata.language}\n` +
-              `${officeResult.text}`,
-            meta: {
-              ...baseMetadata,
-              chunkIndex: 0,
-              chunkCount: 1,
-            },
-          };
-
-          return [chunk];
-        }
+        } else {}
       }
 

[NoCoverage] ArrayDeclaration
src/lib/multi-modal-ingest.ts:504:18
             },
           };
 
-          return [chunk];
+          return [];
         }
       }

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:515:11
           `${this.getOfficeTypeLabel(metadata.content.type)}: ${
             metadata.file.name
           }\n` +
-          `Type: ${metadata.content.type}\n` +
+          `` +
           `Has Text: ${officeResult.metadata.hasText ? "Yes" : "No"}\n` +
           `Word Count: ${officeResult.metadata.wordCount || 0}\n` +

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:516:56
             metadata.file.name
           }\n` +
           `Type: ${metadata.content.type}\n` +
-          `Has Text: ${officeResult.metadata.hasText ? "Yes" : "No"}\n` +
+          `Has Text: ${officeResult.metadata.hasText ? "" : "No"}\n` +
           `Word Count: ${officeResult.metadata.wordCount || 0}\n` +
           `${officeResult.text}`,

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:517:26
           }\n` +
           `Type: ${metadata.content.type}\n` +
           `Has Text: ${officeResult.metadata.hasText ? "Yes" : "No"}\n` +
-          `Word Count: ${officeResult.metadata.wordCount || 0}\n` +
+          `Word Count: ${false}\n` +
           `${officeResult.text}`,
         meta: {

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:517:26
           }\n` +
           `Type: ${metadata.content.type}\n` +
           `Has Text: ${officeResult.metadata.hasText ? "Yes" : "No"}\n` +
-          `Word Count: ${officeResult.metadata.wordCount || 0}\n` +
+          `Word Count: ${true}\n` +
           `${officeResult.text}`,
         meta: {

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:527:21
       };
 
       return [chunk];
-    } catch (error) {
-      // Fallback for Office document processing errors
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-      const chunk: DocumentChunk = {
-        id: this.generateChunkId(metadata.file.id, 0),
-        text: `Office Document Processing Error: ${metadata.file.name}\nError: ${errorMessage}`,
-        meta: {
-          ...baseMetadata,
-          chunkIndex: 0,
-          chunkCount: 1,
-        },
-      };
-
-      return [chunk];
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:531:36
       // Fallback for Office document processing errors
       const errorMessage =
         error instanceof Error ? error.message : String(error);
-      const chunk: DocumentChunk = {
-        id: this.generateChunkId(metadata.file.id, 0),
-        text: `Office Document Processing Error: ${metadata.file.name}\nError: ${errorMessage}`,
-        meta: {
-          ...baseMetadata,
-          chunkIndex: 0,
-          chunkCount: 1,
-        },
-      };
+      const chunk: DocumentChunk = {};
 
       return [chunk];

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:548:64
   /**
    * Get human-readable label for Office document types
    */
-  private getOfficeTypeLabel(contentType: ContentType): string {
-    switch (contentType) {
-      case ContentType.OFFICE_DOC:
-        return "Word Document";
-      case ContentType.OFFICE_SHEET:
-        return "Excel Spreadsheet";
-      case ContentType.OFFICE_PRESENTATION:
-        return "PowerPoint Presentation";
-      default:
-        return "Office Document";
-    }
-  }
+  private getOfficeTypeLabel(contentType: ContentType): string {}
 
   private async chunkImageFile(

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:550:7
    */
   private getOfficeTypeLabel(contentType: ContentType): string {
     switch (contentType) {
-      case ContentType.OFFICE_DOC:
-        return "Word Document";
+      case ContentType.OFFICE_DOC:
       case ContentType.OFFICE_SHEET:
         return "Excel Spreadsheet";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:552:7
     switch (contentType) {
       case ContentType.OFFICE_DOC:
         return "Word Document";
-      case ContentType.OFFICE_SHEET:
-        return "Excel Spreadsheet";
+      case ContentType.OFFICE_SHEET:
       case ContentType.OFFICE_PRESENTATION:
         return "PowerPoint Presentation";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:554:7
         return "Word Document";
       case ContentType.OFFICE_SHEET:
         return "Excel Spreadsheet";
-      case ContentType.OFFICE_PRESENTATION:
-        return "PowerPoint Presentation";
+      case ContentType.OFFICE_PRESENTATION:
       default:
         return "Office Document";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:556:7
         return "Excel Spreadsheet";
       case ContentType.OFFICE_PRESENTATION:
         return "PowerPoint Presentation";
-      default:
-        return "Office Document";
+      default:
     }
   }

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:568:11
   ): Promise<DocumentChunk[]> {
     try {
       // For raster images, OCR might have been performed
-      if (metadata.content.type === ContentType.RASTER_IMAGE) {
+      if (false) {
         // Check if OCR extracted text (content has hasText and wordCount > 0)
         if (

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:568:11
   ): Promise<DocumentChunk[]> {
     try {
       // For raster images, OCR might have been performed
-      if (metadata.content.type === ContentType.RASTER_IMAGE) {
+      if (true) {
         // Check if OCR extracted text (content has hasText and wordCount > 0)
         if (

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:571:11
       if (metadata.content.type === ContentType.RASTER_IMAGE) {
         // Check if OCR extracted text (content has hasText and wordCount > 0)
         if (
-          (metadata.content as any).hasText &&
-          (metadata.content as any).wordCount > 0
+          false
         ) {
           // Perform OCR to get the actual text

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:571:11
       if (metadata.content.type === ContentType.RASTER_IMAGE) {
         // Check if OCR extracted text (content has hasText and wordCount > 0)
         if (
-          (metadata.content as any).hasText &&
-          (metadata.content as any).wordCount > 0
+          (metadata.content as any).hasText || (metadata.content as any).wordCount > 0
         ) {
           // Perform OCR to get the actual text

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:572:11
         // Check if OCR extracted text (content has hasText and wordCount > 0)
         if (
           (metadata.content as any).hasText &&
-          (metadata.content as any).wordCount > 0
+          true
         ) {
           // Perform OCR to get the actual text

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:572:11
         // Check if OCR extracted text (content has hasText and wordCount > 0)
         if (
           (metadata.content as any).hasText &&
-          (metadata.content as any).wordCount > 0
+          (metadata.content as any).wordCount >= 0
         ) {
           // Perform OCR to get the actual text

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:580:15
           );
 
           // If OCR was successful, chunk the text
-          if (ocrResult.metadata.hasText && ocrResult.text.length > 100) {
+          if (true) {
             // Use text chunking for substantial OCR content
             return await this.chunkTextFile(

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:580:45
           );
 
           // If OCR was successful, chunk the text
-          if (ocrResult.metadata.hasText && ocrResult.text.length > 100) {
+          if (ocrResult.metadata.hasText && ocrResult.text.length >= 100) {
             // Use text chunking for substantial OCR content
             return await this.chunkTextFile(

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:588:18
               metadata,
               ocrResult.text
             );
-          } else {
-            // Create a chunk with OCR results and metadata
-            const chunk: DocumentChunk = {
-              id: this.generateChunkId(metadata.file.id, 0),
-              text:
-                `Image OCR: ${metadata.file.name}\n` +
-                `OCR Confidence: ${
-                  (metadata.content as any).confidence?.toFixed(1) || "Unknown"
-                }%\n` +
-                `Has Text: ${
-                  (metadata.content as any).hasText ? "Yes" : "No"
-                }\n` +
-                `Word Count: ${(metadata.content as any).wordCount || 0}\n` +
-                `${ocrResult.text}`,
-              meta: {
-                ...baseMetadata,
-                chunkIndex: 0,
-                chunkCount: 1,
-              },
-            };
-
-            return [chunk];
-          }
+          } else {}
         }
       }

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:594:17
               id: this.generateChunkId(metadata.file.id, 0),
               text:
                 `Image OCR: ${metadata.file.name}\n` +
-                `OCR Confidence: ${
-                  (metadata.content as any).confidence?.toFixed(1) || "Unknown"
-                }%\n` +
+                `` +
                 `Has Text: ${
                   (metadata.content as any).hasText ? "Yes" : "No"

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:595:19
               text:
                 `Image OCR: ${metadata.file.name}\n` +
                 `OCR Confidence: ${
-                  (metadata.content as any).confidence?.toFixed(1) || "Unknown"
+                  (metadata.content as any).confidence?.toFixed(1) && "Unknown"
                 }%\n` +
                 `Has Text: ${

[NoCoverage] OptionalChaining
src/lib/multi-modal-ingest.ts:595:19
               text:
                 `Image OCR: ${metadata.file.name}\n` +
                 `OCR Confidence: ${
-                  (metadata.content as any).confidence?.toFixed(1) || "Unknown"
+                  (metadata.content as any).confidence.toFixed(1) || "Unknown"
                 }%\n` +
                 `Has Text: ${

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:600:32
                 `Has Text: ${
                   (metadata.content as any).hasText ? "Yes" : "No"
                 }\n` +
-                `Word Count: ${(metadata.content as any).wordCount || 0}\n` +
+                `Word Count: ${true}\n` +
                 `${ocrResult.text}`,
               meta: {

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:600:32
                 `Has Text: ${
                   (metadata.content as any).hasText ? "Yes" : "No"
                 }\n` +
-                `Word Count: ${(metadata.content as any).wordCount || 0}\n` +
+                `Word Count: ${false}\n` +
                 `${ocrResult.text}`,
               meta: {

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:602:21
                 }\n` +
                 `Word Count: ${(metadata.content as any).wordCount || 0}\n` +
                 `${ocrResult.text}`,
-              meta: {
-                ...baseMetadata,
-                chunkIndex: 0,
-                chunkCount: 1,
-              },
+              meta: {},
             };
 

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:617:15
       // Fallback for images without OCR or unsupported image types
       const chunk: DocumentChunk = {
         id: this.generateChunkId(metadata.file.id, 0),
-        text: `Image: ${metadata.file.name}\nType: ${metadata.content.type}\nFormat: ${metadata.file.extension}`,
+        text: ``,
         meta: {
           ...baseMetadata,

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:626:21
       };
 
       return [chunk];
-    } catch (error) {
-      // Fallback for image processing errors
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-      const chunk: DocumentChunk = {
-        id: this.generateChunkId(metadata.file.id, 0),
-        text: `Image Processing Error: ${metadata.file.name}\nError: ${errorMessage}`,
-        meta: {
-          ...baseMetadata,
-          chunkIndex: 0,
-          chunkCount: 1,
-        },
-      };
-
-      return [chunk];
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:630:36
       // Fallback for image processing errors
       const errorMessage =
         error instanceof Error ? error.message : String(error);
-      const chunk: DocumentChunk = {
-        id: this.generateChunkId(metadata.file.id, 0),
-        text: `Image Processing Error: ${metadata.file.name}\nError: ${errorMessage}`,
-        meta: {
-          ...baseMetadata,
-          chunkIndex: 0,
-          chunkCount: 1,
-        },
-      };
+      const chunk: DocumentChunk = {};
 
       return [chunk];

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:653:9
       // Attempt speech-to-text transcription
       const speechResult = await this.speechProcessor.transcribeFromBuffer(
         buffer,
-        {
-          language: "en",
-          sampleRate: 16000,
-        }
+        {}
       );
 

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:660:44
       );
 
       // If transcription was successful, chunk the text
-      if (speechResult.metadata.hasText && speechResult.text.length > 0) {
+      if (speechResult.metadata.hasText && speechResult.text.length >= 0) {
         // For substantial transcriptions, use text chunking
         if (speechResult.text.length > 300) {

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:660:11
       );
 
       // If transcription was successful, chunk the text
-      if (speechResult.metadata.hasText && speechResult.text.length > 0) {
+      if (speechResult.metadata.hasText || speechResult.text.length > 0) {
         // For substantial transcriptions, use text chunking
         if (speechResult.text.length > 300) {

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:662:13
       // If transcription was successful, chunk the text
       if (speechResult.metadata.hasText && speechResult.text.length > 0) {
         // For substantial transcriptions, use text chunking
-        if (speechResult.text.length > 300) {
+        if (speechResult.text.length <= 300) {
           return await this.chunkTextFile(
             buffer,

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:662:13
       // If transcription was successful, chunk the text
       if (speechResult.metadata.hasText && speechResult.text.length > 0) {
         // For substantial transcriptions, use text chunking
-        if (speechResult.text.length > 300) {
+        if (speechResult.text.length >= 300) {
           return await this.chunkTextFile(
             buffer,

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:669:16
             metadata,
             speechResult.text
           );
-        } else {
-          // For shorter transcriptions, create a single enriched chunk
-          const chunk: DocumentChunk = {
-            id: this.generateChunkId(metadata.file.id, 0),
-            text:
-              `Audio Transcript: ${metadata.file.name}\n` +
-              `Duration: ${
-                speechResult.metadata.speechMetadata?.duration?.toFixed(1) ||
-                "Unknown"
-              }s\n` +
-              `Language: ${speechResult.metadata.language}\n` +
-              `Confidence: ${
-                speechResult.metadata.speechMetadata?.confidence?.toFixed(1) ||
-                "Unknown"
-              }\n` +
-              `${speechResult.text}`,
-            meta: {
-              ...baseMetadata,
-              chunkIndex: 0,
-              chunkCount: 1,
-            },
-          };
-
-          return [chunk];
-        }
+        } else {}
       }
 

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:671:40
           );
         } else {
           // For shorter transcriptions, create a single enriched chunk
-          const chunk: DocumentChunk = {
-            id: this.generateChunkId(metadata.file.id, 0),
-            text:
-              `Audio Transcript: ${metadata.file.name}\n` +
-              `Duration: ${
-                speechResult.metadata.speechMetadata?.duration?.toFixed(1) ||
-                "Unknown"
-              }s\n` +
-              `Language: ${speechResult.metadata.language}\n` +
-              `Confidence: ${
-                speechResult.metadata.speechMetadata?.confidence?.toFixed(1) ||
-                "Unknown"
-              }\n` +
-              `${speechResult.text}`,
-            meta: {
-              ...baseMetadata,
-              chunkIndex: 0,
-              chunkCount: 1,
-            },
-          };
+          const chunk: DocumentChunk = {};
 
           return [chunk];

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:674:15
           const chunk: DocumentChunk = {
             id: this.generateChunkId(metadata.file.id, 0),
             text:
-              `Audio Transcript: ${metadata.file.name}\n` +
+              `` +
               `Duration: ${
                 speechResult.metadata.speechMetadata?.duration?.toFixed(1) ||

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:676:17
             text:
               `Audio Transcript: ${metadata.file.name}\n` +
               `Duration: ${
-                speechResult.metadata.speechMetadata?.duration?.toFixed(1) ||
-                "Unknown"
+                false
               }s\n` +
               `Language: ${speechResult.metadata.language}\n` +

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:676:17
             text:
               `Audio Transcript: ${metadata.file.name}\n` +
               `Duration: ${
-                speechResult.metadata.speechMetadata?.duration?.toFixed(1) ||
-                "Unknown"
+                speechResult.metadata.speechMetadata?.duration?.toFixed(1) && "Unknown"
               }s\n` +
               `Language: ${speechResult.metadata.language}\n` +

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:680:15
                 "Unknown"
               }s\n` +
               `Language: ${speechResult.metadata.language}\n` +
-              `Confidence: ${
-                speechResult.metadata.speechMetadata?.confidence?.toFixed(1) ||
-                "Unknown"
-              }\n` +
+              `` +
               `${speechResult.text}`,
             meta: {

[NoCoverage] OptionalChaining
src/lib/multi-modal-ingest.ts:681:17
               }s\n` +
               `Language: ${speechResult.metadata.language}\n` +
               `Confidence: ${
-                speechResult.metadata.speechMetadata?.confidence?.toFixed(1) ||
+                speechResult.metadata.speechMetadata.confidence?.toFixed(1) ||
                 "Unknown"
               }\n` +
