[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:681:17
               }s\n` +
               `Language: ${speechResult.metadata.language}\n` +
               `Confidence: ${
-                speechResult.metadata.speechMetadata?.confidence?.toFixed(1) ||
-                "Unknown"
+                speechResult.metadata.speechMetadata?.confidence?.toFixed(1) && "Unknown"
               }\n` +
               `${speechResult.text}`,

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:684:15
                 speechResult.metadata.speechMetadata?.confidence?.toFixed(1) ||
                 "Unknown"
               }\n` +
-              `${speechResult.text}`,
+              ``,
             meta: {
               ...baseMetadata,

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:685:19
                 "Unknown"
               }\n` +
               `${speechResult.text}`,
-            meta: {
-              ...baseMetadata,
-              chunkIndex: 0,
-              chunkCount: 1,
-            },
+            meta: {},
           };
 

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:701:11
         id: this.generateChunkId(metadata.file.id, 0),
         text:
           `Audio: ${metadata.file.name}\n` +
-          `Type: ${metadata.content.type}\n` +
+          `` +
           `Duration: ${
             speechResult.metadata.speechMetadata?.duration?.toFixed(1) ||

[NoCoverage] OptionalChaining
src/lib/multi-modal-ingest.ts:703:13
           `Audio: ${metadata.file.name}\n` +
           `Type: ${metadata.content.type}\n` +
           `Duration: ${
-            speechResult.metadata.speechMetadata?.duration?.toFixed(1) ||
+            speechResult.metadata.speechMetadata.duration?.toFixed(1) ||
             "Unknown"
           }s\n` +

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:706:11
             speechResult.metadata.speechMetadata?.duration?.toFixed(1) ||
             "Unknown"
           }s\n` +
-          `Processing Time: ${
-            speechResult.metadata.speechMetadata?.processingTime || 0
-          }ms\n` +
+          `` +
           `${speechResult.text}`,
         meta: {

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:707:13
             "Unknown"
           }s\n` +
           `Processing Time: ${
-            speechResult.metadata.speechMetadata?.processingTime || 0
+            true
           }ms\n` +
           `${speechResult.text}`,

[NoCoverage] OptionalChaining
src/lib/multi-modal-ingest.ts:707:13
             "Unknown"
           }s\n` +
           `Processing Time: ${
-            speechResult.metadata.speechMetadata?.processingTime || 0
+            speechResult.metadata.speechMetadata.processingTime || 0
           }ms\n` +
           `${speechResult.text}`,

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:718:21
       };
 
       return [chunk];
-    } catch (error) {
-      // Fallback for audio processing errors
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-      const chunk: DocumentChunk = {
-        id: this.generateChunkId(metadata.file.id, 0),
-        text: `Audio Processing Error: ${metadata.file.name}\nError: ${errorMessage}`,
-        meta: {
-          ...baseMetadata,
-          chunkIndex: 0,
-          chunkCount: 1,
-        },
-      };
-
-      return [chunk];
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:740:31
     buffer: Buffer,
     baseMetadata: DocumentMetadata,
     metadata: UniversalMetadata
-  ): Promise<DocumentChunk[]> {
-    // Placeholder for video processing
-    // In production, would extract audio and attempt speech-to-text
-
-    const chunk: DocumentChunk = {
-      id: this.generateChunkId(metadata.file.id, 0),
-      text: `Video: ${metadata.file.name}\nType: ${
-        metadata.content.type
-      }\nDuration: ${
-        metadata.content.duration || "Unknown"
-      } seconds\nDimensions: ${
-        metadata.content.dimensions?.width || "Unknown"
-      }x${metadata.content.dimensions?.height || "Unknown"}`,
-      meta: {
-        ...baseMetadata,
-        chunkIndex: 0,
-        chunkCount: 1,
-      },
-    };
-
-    return [chunk];
-  }
+  ): Promise<DocumentChunk[]> {}
 
   private async chunkStructuredFile(

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:744:34
     // Placeholder for video processing
     // In production, would extract audio and attempt speech-to-text
 
-    const chunk: DocumentChunk = {
-      id: this.generateChunkId(metadata.file.id, 0),
-      text: `Video: ${metadata.file.name}\nType: ${
-        metadata.content.type
-      }\nDuration: ${
-        metadata.content.duration || "Unknown"
-      } seconds\nDimensions: ${
-        metadata.content.dimensions?.width || "Unknown"
-      }x${metadata.content.dimensions?.height || "Unknown"}`,
-      meta: {
-        ...baseMetadata,
-        chunkIndex: 0,
-        chunkCount: 1,
-      },
-    };
+    const chunk: DocumentChunk = {};
 
     return [chunk];

[NoCoverage] LogicalOperator
src/lib/multi-modal-ingest.ts:749:9
       text: `Video: ${metadata.file.name}\nType: ${
         metadata.content.type
       }\nDuration: ${
-        metadata.content.duration || "Unknown"
+        metadata.content.duration && "Unknown"
       } seconds\nDimensions: ${
         metadata.content.dimensions?.width || "Unknown"

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:749:9
       text: `Video: ${metadata.file.name}\nType: ${
         metadata.content.type
       }\nDuration: ${
-        metadata.content.duration || "Unknown"
+        false
       } seconds\nDimensions: ${
         metadata.content.dimensions?.width || "Unknown"

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:751:9
       }\nDuration: ${
         metadata.content.duration || "Unknown"
       } seconds\nDimensions: ${
-        metadata.content.dimensions?.width || "Unknown"
+        true
       }x${metadata.content.dimensions?.height || "Unknown"}`,
       meta: {

[NoCoverage] OptionalChaining
src/lib/multi-modal-ingest.ts:751:9
       }\nDuration: ${
         metadata.content.duration || "Unknown"
       } seconds\nDimensions: ${
-        metadata.content.dimensions?.width || "Unknown"
+        metadata.content.dimensions.width || "Unknown"
       }x${metadata.content.dimensions?.height || "Unknown"}`,
       meta: {

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:752:11
         metadata.content.duration || "Unknown"
       } seconds\nDimensions: ${
         metadata.content.dimensions?.width || "Unknown"
-      }x${metadata.content.dimensions?.height || "Unknown"}`,
+      }x${false}`,
       meta: {
         ...baseMetadata,

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:752:11
         metadata.content.duration || "Unknown"
       } seconds\nDimensions: ${
         metadata.content.dimensions?.width || "Unknown"
-      }x${metadata.content.dimensions?.height || "Unknown"}`,
+      }x${true}`,
       meta: {
         ...baseMetadata,

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:767:31
     buffer: Buffer,
     baseMetadata: DocumentMetadata,
     metadata: UniversalMetadata
-  ): Promise<DocumentChunk[]> {
-    const text = buffer.toString("utf8");
-
-    // For structured data, create a single chunk with the content
-    const chunk: DocumentChunk = {
-      id: this.generateChunkId(metadata.file.id, 0),
-      text: `Structured Data: ${metadata.file.name}\nType: ${
-        metadata.content.type
-      }\nContent:\n${text.slice(0, 1000)}${text.length > 1000 ? "..." : ""}`,
-      meta: {
-        ...baseMetadata,
-        chunkIndex: 0,
-        chunkCount: 1,
-      },
-    };
-
-    return [chunk];
-  }
+  ): Promise<DocumentChunk[]> {}
 
   private createMetadataOnlyChunk(

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:773:13
     // For structured data, create a single chunk with the content
     const chunk: DocumentChunk = {
       id: this.generateChunkId(metadata.file.id, 0),
-      text: `Structured Data: ${metadata.file.name}\nType: ${
-        metadata.content.type
-      }\nContent:\n${text.slice(0, 1000)}${text.length > 1000 ? "..." : ""}`,
+      text: ``,
       meta: {
         ...baseMetadata,

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:775:22
       id: this.generateChunkId(metadata.file.id, 0),
       text: `Structured Data: ${metadata.file.name}\nType: ${
         metadata.content.type
-      }\nContent:\n${text.slice(0, 1000)}${text.length > 1000 ? "..." : ""}`,
+      }\nContent:\n${text}${text.length > 1000 ? "..." : ""}`,
       meta: {
         ...baseMetadata,

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:775:44
       id: this.generateChunkId(metadata.file.id, 0),
       text: `Structured Data: ${metadata.file.name}\nType: ${
         metadata.content.type
-      }\nContent:\n${text.slice(0, 1000)}${text.length > 1000 ? "..." : ""}`,
+      }\nContent:\n${text.slice(0, 1000)}${true ? "..." : ""}`,
       meta: {
         ...baseMetadata,

[NoCoverage] ObjectLiteral
src/lib/multi-modal-ingest.ts:776:13
       text: `Structured Data: ${metadata.file.name}\nType: ${
         metadata.content.type
       }\nContent:\n${text.slice(0, 1000)}${text.length > 1000 ? "..." : ""}`,
-      meta: {
-        ...baseMetadata,
-        chunkIndex: 0,
-        chunkCount: 1,
-      },
+      meta: {},
     };
 

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:789:20
   private createMetadataOnlyChunk(
     baseMetadata: DocumentMetadata,
     metadata: UniversalMetadata
-  ): DocumentChunk {
-    const chunk: DocumentChunk = {
-      id: this.generateChunkId(metadata.file.id, 0),
-      text: `File: ${metadata.file.name}\nType: ${
-        metadata.content.type
-      }\nMIME Type: ${metadata.file.mimeType}\nSize: ${
-        metadata.file.size
-      } bytes\nQuality Score: ${metadata.quality.overallScore.toFixed(2)}`,
-      meta: {
-        ...baseMetadata,
-        chunkIndex: 0,
-        chunkCount: 1,
-      },
-    };
-
-    return chunk;
-  }
+  ): DocumentChunk {}
 
   private mapContentType(contentType: ContentType): string {

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:810:7
   private mapContentType(contentType: ContentType): string {
     // Map our ContentType enum to the existing content type strings
     switch (contentType) {
-      case ContentType.MARKDOWN:
-        return "markdown";
+      case ContentType.MARKDOWN:
       case ContentType.PLAIN_TEXT:
         return "plain_text";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:812:7
     switch (contentType) {
       case ContentType.MARKDOWN:
         return "markdown";
-      case ContentType.PLAIN_TEXT:
-        return "plain_text";
+      case ContentType.PLAIN_TEXT:
       case ContentType.PDF:
         return "pdf";

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:813:16
       case ContentType.MARKDOWN:
         return "markdown";
       case ContentType.PLAIN_TEXT:
-        return "plain_text";
+        return "";
       case ContentType.PDF:
         return "pdf";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:814:7
         return "markdown";
       case ContentType.PLAIN_TEXT:
         return "plain_text";
-      case ContentType.PDF:
-        return "pdf";
+      case ContentType.PDF:
       case ContentType.OFFICE_DOC:
         return "office_document";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:816:7
         return "plain_text";
       case ContentType.PDF:
         return "pdf";
-      case ContentType.OFFICE_DOC:
-        return "office_document";
+      case ContentType.OFFICE_DOC:
       case ContentType.OFFICE_SHEET:
         return "office_sheet";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:818:7
         return "pdf";
       case ContentType.OFFICE_DOC:
         return "office_document";
-      case ContentType.OFFICE_SHEET:
-        return "office_sheet";
+      case ContentType.OFFICE_SHEET:
       case ContentType.OFFICE_PRESENTATION:
         return "office_presentation";

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:819:16
       case ContentType.OFFICE_DOC:
         return "office_document";
       case ContentType.OFFICE_SHEET:
-        return "office_sheet";
+        return "";
       case ContentType.OFFICE_PRESENTATION:
         return "office_presentation";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:820:7
         return "office_document";
       case ContentType.OFFICE_SHEET:
         return "office_sheet";
-      case ContentType.OFFICE_PRESENTATION:
-        return "office_presentation";
+      case ContentType.OFFICE_PRESENTATION:
       case ContentType.RASTER_IMAGE:
         return "image";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:822:7
         return "office_sheet";
       case ContentType.OFFICE_PRESENTATION:
         return "office_presentation";
-      case ContentType.RASTER_IMAGE:
-        return "image";
+      case ContentType.RASTER_IMAGE:
       case ContentType.VECTOR_IMAGE:
         return "vector_image";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:824:7
         return "office_presentation";
       case ContentType.RASTER_IMAGE:
         return "image";
-      case ContentType.VECTOR_IMAGE:
-        return "vector_image";
+      case ContentType.VECTOR_IMAGE:
       case ContentType.AUDIO:
         return "audio";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:826:7
         return "image";
       case ContentType.VECTOR_IMAGE:
         return "vector_image";
-      case ContentType.AUDIO:
-        return "audio";
+      case ContentType.AUDIO:
       case ContentType.VIDEO:
         return "video";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:828:7
         return "vector_image";
       case ContentType.AUDIO:
         return "audio";
-      case ContentType.VIDEO:
-        return "video";
+      case ContentType.VIDEO:
       case ContentType.JSON:
         return "json";

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:829:16
       case ContentType.AUDIO:
         return "audio";
       case ContentType.VIDEO:
-        return "video";
+        return "";
       case ContentType.JSON:
         return "json";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:830:7
         return "audio";
       case ContentType.VIDEO:
         return "video";
-      case ContentType.JSON:
-        return "json";
+      case ContentType.JSON:
       case ContentType.XML:
         return "xml";

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:831:16
       case ContentType.VIDEO:
         return "video";
       case ContentType.JSON:
-        return "json";
+        return "";
       case ContentType.XML:
         return "xml";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:832:7
         return "video";
       case ContentType.JSON:
         return "json";
-      case ContentType.XML:
-        return "xml";
+      case ContentType.XML:
       case ContentType.CSV:
         return "csv";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:834:7
         return "json";
       case ContentType.XML:
         return "xml";
-      case ContentType.CSV:
-        return "csv";
+      case ContentType.CSV:
       default:
         return "unknown";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:836:7
         return "xml";
       case ContentType.CSV:
         return "csv";
-      default:
-        return "unknown";
+      default:
     }
   }

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:837:16
       case ContentType.CSV:
         return "csv";
       default:
-        return "unknown";
+        return "";
     }
   }

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:841:70
     }
   }
 
-  private mapContentTypeToStrategy(contentType: ContentType): string {
-    // Map to embedding strategy
-    switch (contentType) {
-      case ContentType.MARKDOWN:
-      case ContentType.PLAIN_TEXT:
-      case ContentType.PDF:
-      case ContentType.OFFICE_DOC:
-        return "text";
-      case ContentType.RASTER_IMAGE:
-      case ContentType.VECTOR_IMAGE:
-        return "image";
-      case ContentType.AUDIO:
-        return "audio";
-      case ContentType.VIDEO:
-        return "video";
-      default:
-        return "text"; // fallback
-    }
-  }
+  private mapContentTypeToStrategy(contentType: ContentType): string {}
 
   private generateChunkId(fileId: string, chunkIndex: number): string {

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:847:7
       case ContentType.MARKDOWN:
       case ContentType.PLAIN_TEXT:
       case ContentType.PDF:
-      case ContentType.OFFICE_DOC:
-        return "text";
+      case ContentType.OFFICE_DOC:
       case ContentType.RASTER_IMAGE:
       case ContentType.VECTOR_IMAGE:

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:850:7
       case ContentType.OFFICE_DOC:
         return "text";
       case ContentType.RASTER_IMAGE:
-      case ContentType.VECTOR_IMAGE:
-        return "image";
+      case ContentType.VECTOR_IMAGE:
       case ContentType.AUDIO:
         return "audio";

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:851:16
         return "text";
       case ContentType.RASTER_IMAGE:
       case ContentType.VECTOR_IMAGE:
-        return "image";
+        return "";
       case ContentType.AUDIO:
         return "audio";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:852:7
       case ContentType.RASTER_IMAGE:
       case ContentType.VECTOR_IMAGE:
         return "image";
-      case ContentType.AUDIO:
-        return "audio";
+      case ContentType.AUDIO:
       case ContentType.VIDEO:
         return "video";

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:856:7
         return "audio";
       case ContentType.VIDEO:
         return "video";
-      default:
-        return "text"; // fallback
+      default: // fallback // fallback
     }
   }

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:857:16
       case ContentType.VIDEO:
         return "video";
       default:
-        return "text"; // fallback
+        return ""; // fallback
     }
   }

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:861:71
     }
   }
 
-  private generateChunkId(fileId: string, chunkIndex: number): string {
-    const hash = createHash("md5")
-      .update(`${fileId}_${chunkIndex}`)
-      .digest("hex")
-      .slice(0, 8);
-    return `multi_${fileId}_${chunkIndex}_${hash}`;
-  }
+  private generateChunkId(fileId: string, chunkIndex: number): string {}
 
   private generateBreadcrumbs(filePath: string): string[] {

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:862:18
   }
 
   private generateChunkId(fileId: string, chunkIndex: number): string {
-    const hash = createHash("md5")
-      .update(`${fileId}_${chunkIndex}`)
-      .digest("hex")
-      .slice(0, 8);
+    const hash = createHash("md5").update(`${fileId}_${chunkIndex}`).digest("hex");
     return `multi_${fileId}_${chunkIndex}_${hash}`;
   }

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:862:29
   }
 
   private generateChunkId(fileId: string, chunkIndex: number): string {
-    const hash = createHash("md5")
+    const hash = createHash("")
       .update(`${fileId}_${chunkIndex}`)
       .digest("hex")

[NoCoverage] StringLiteral
src/lib/multi-modal-ingest.ts:866:12
       .update(`${fileId}_${chunkIndex}`)
       .digest("hex")
       .slice(0, 8);
-    return `multi_${fileId}_${chunkIndex}_${hash}`;
+    return ``;
   }
 

[NoCoverage] BlockStatement
src/lib/multi-modal-ingest.ts:869:59
     return `multi_${fileId}_${chunkIndex}_${hash}`;
   }
 
-  private generateBreadcrumbs(filePath: string): string[] {
-    const parts = filePath
-      .split(path.sep)
-      .filter((part) => part && part !== ".");
-
-    const breadcrumbs: string[] = [];
-    for (let i = 0; i < parts.length - 1; i++) {
-      const segment = parts.slice(0, i + 1).join("/");
-      breadcrumbs.push(segment);
-    }
-
-    return breadcrumbs;
-  }
+  private generateBreadcrumbs(filePath: string): string[] {}
 }
 

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:870:19
   }
 
   private generateBreadcrumbs(filePath: string): string[] {
-    const parts = filePath
-      .split(path.sep)
-      .filter((part) => part && part !== ".");
+    const parts = filePath.split(path.sep);
 
     const breadcrumbs: string[] = [];

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:872:33
   private generateBreadcrumbs(filePath: string): string[] {
     const parts = filePath
       .split(path.sep)
-      .filter((part) => part && part !== ".");
+      .filter((part) => part && part === ".");
 
     const breadcrumbs: string[] = [];

[NoCoverage] ArrowFunction
src/lib/multi-modal-ingest.ts:872:15
   private generateBreadcrumbs(filePath: string): string[] {
     const parts = filePath
       .split(path.sep)
-      .filter((part) => part && part !== ".");
+      .filter(() => undefined);
 
     const breadcrumbs: string[] = [];

[NoCoverage] ArrayDeclaration
src/lib/multi-modal-ingest.ts:874:35
       .split(path.sep)
       .filter((part) => part && part !== ".");
 
-    const breadcrumbs: string[] = [];
+    const breadcrumbs: string[] = ["Stryker was here"];
     for (let i = 0; i < parts.length - 1; i++) {
       const segment = parts.slice(0, i + 1).join("/");

[NoCoverage] ConditionalExpression
src/lib/multi-modal-ingest.ts:875:21
       .filter((part) => part && part !== ".");
 
     const breadcrumbs: string[] = [];
-    for (let i = 0; i < parts.length - 1; i++) {
+    for (let i = 0; false; i++) {
       const segment = parts.slice(0, i + 1).join("/");
       breadcrumbs.push(segment);

[NoCoverage] EqualityOperator
src/lib/multi-modal-ingest.ts:875:21
       .filter((part) => part && part !== ".");
 
     const breadcrumbs: string[] = [];
-    for (let i = 0; i < parts.length - 1; i++) {
+    for (let i = 0; i <= parts.length - 1; i++) {
       const segment = parts.slice(0, i + 1).join("/");
       breadcrumbs.push(segment);

[NoCoverage] ArithmeticOperator
src/lib/multi-modal-ingest.ts:876:38
 
     const breadcrumbs: string[] = [];
     for (let i = 0; i < parts.length - 1; i++) {
-      const segment = parts.slice(0, i + 1).join("/");
+      const segment = parts.slice(0, i - 1).join("/");
       breadcrumbs.push(segment);
     }

[NoCoverage] MethodExpression
src/lib/multi-modal-ingest.ts:876:23
 
     const breadcrumbs: string[] = [];
     for (let i = 0; i < parts.length - 1; i++) {
-      const segment = parts.slice(0, i + 1).join("/");
+      const segment = parts.join("/");
       breadcrumbs.push(segment);
     }
