[NoCoverage] StringLiteral
src/lib/multi-modal.ts:161:6
 export class MultiModalContentDetector {
   private mimeTypeMap: Map<string, ContentType> = new Map([
     // Text
-    ["text/plain", ContentType.PLAIN_TEXT],
+    ["", ContentType.PLAIN_TEXT],
     ["text/markdown", ContentType.MARKDOWN],
     ["text/rtf", ContentType.RICH_TEXT],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:162:6
   private mimeTypeMap: Map<string, ContentType> = new Map([
     // Text
     ["text/plain", ContentType.PLAIN_TEXT],
-    ["text/markdown", ContentType.MARKDOWN],
+    ["", ContentType.MARKDOWN],
     ["text/rtf", ContentType.RICH_TEXT],
 

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:163:5
     // Text
     ["text/plain", ContentType.PLAIN_TEXT],
     ["text/markdown", ContentType.MARKDOWN],
-    ["text/rtf", ContentType.RICH_TEXT],
+    [],
 
     // Documents

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:168:7
     // Documents
     ["application/pdf", ContentType.PDF],
     [
-      "application/vnd.openxmlformats-officedocument.wordprocessingml.document",
+      "",
       ContentType.OFFICE_DOC,
     ],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:171:6
       "application/vnd.openxmlformats-officedocument.wordprocessingml.document",
       ContentType.OFFICE_DOC,
     ],
-    ["application/msword", ContentType.OFFICE_DOC],
+    ["", ContentType.OFFICE_DOC],
     [
       "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet",

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:172:5
       ContentType.OFFICE_DOC,
     ],
     ["application/msword", ContentType.OFFICE_DOC],
-    [
-      "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet",
-      ContentType.OFFICE_SHEET,
-    ],
+    [],
     ["application/vnd.ms-excel", ContentType.OFFICE_SHEET],
     [

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:177:5
       ContentType.OFFICE_SHEET,
     ],
     ["application/vnd.ms-excel", ContentType.OFFICE_SHEET],
-    [
-      "application/vnd.openxmlformats-officedocument.presentationml.presentation",
-      ContentType.OFFICE_PRESENTATION,
-    ],
+    [],
     ["application/vnd.ms-powerpoint", ContentType.OFFICE_PRESENTATION],
 

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:178:7
     ],
     ["application/vnd.ms-excel", ContentType.OFFICE_SHEET],
     [
-      "application/vnd.openxmlformats-officedocument.presentationml.presentation",
+      "",
       ContentType.OFFICE_PRESENTATION,
     ],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:184:6
     ["application/vnd.ms-powerpoint", ContentType.OFFICE_PRESENTATION],
 
     // Images
-    ["image/jpeg", ContentType.RASTER_IMAGE],
+    ["", ContentType.RASTER_IMAGE],
     ["image/png", ContentType.RASTER_IMAGE],
     ["image/gif", ContentType.RASTER_IMAGE],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:187:5
     ["image/jpeg", ContentType.RASTER_IMAGE],
     ["image/png", ContentType.RASTER_IMAGE],
     ["image/gif", ContentType.RASTER_IMAGE],
-    ["image/bmp", ContentType.RASTER_IMAGE],
+    [],
     ["image/tiff", ContentType.RASTER_IMAGE],
     ["image/webp", ContentType.RASTER_IMAGE],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:188:6
     ["image/png", ContentType.RASTER_IMAGE],
     ["image/gif", ContentType.RASTER_IMAGE],
     ["image/bmp", ContentType.RASTER_IMAGE],
-    ["image/tiff", ContentType.RASTER_IMAGE],
+    ["", ContentType.RASTER_IMAGE],
     ["image/webp", ContentType.RASTER_IMAGE],
     ["image/svg+xml", ContentType.VECTOR_IMAGE],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:190:5
     ["image/bmp", ContentType.RASTER_IMAGE],
     ["image/tiff", ContentType.RASTER_IMAGE],
     ["image/webp", ContentType.RASTER_IMAGE],
-    ["image/svg+xml", ContentType.VECTOR_IMAGE],
+    [],
 
     // Audio

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:194:6
 
     // Audio
     ["audio/mpeg", ContentType.AUDIO],
-    ["audio/wav", ContentType.AUDIO],
+    ["", ContentType.AUDIO],
     ["audio/flac", ContentType.AUDIO],
     ["audio/mp4", ContentType.AUDIO],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:196:6
     ["audio/mpeg", ContentType.AUDIO],
     ["audio/wav", ContentType.AUDIO],
     ["audio/flac", ContentType.AUDIO],
-    ["audio/mp4", ContentType.AUDIO],
+    ["", ContentType.AUDIO],
     ["audio/ogg", ContentType.AUDIO],
 

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:197:5
     ["audio/wav", ContentType.AUDIO],
     ["audio/flac", ContentType.AUDIO],
     ["audio/mp4", ContentType.AUDIO],
-    ["audio/ogg", ContentType.AUDIO],
+    [],
 
     // Video

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:197:6
     ["audio/wav", ContentType.AUDIO],
     ["audio/flac", ContentType.AUDIO],
     ["audio/mp4", ContentType.AUDIO],
-    ["audio/ogg", ContentType.AUDIO],
+    ["", ContentType.AUDIO],
 
     // Video

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:207:5
     ["video/mkv", ContentType.VIDEO],
 
     // Structured Data
-    ["application/json", ContentType.JSON],
+    [],
     ["application/xml", ContentType.XML],
     ["text/xml", ContentType.XML],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:208:5
 
     // Structured Data
     ["application/json", ContentType.JSON],
-    ["application/xml", ContentType.XML],
+    [],
     ["text/xml", ContentType.XML],
     ["text/csv", ContentType.CSV],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:209:5
     // Structured Data
     ["application/json", ContentType.JSON],
     ["application/xml", ContentType.XML],
-    ["text/xml", ContentType.XML],
+    [],
     ["text/csv", ContentType.CSV],
   ]);

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:210:6
     ["application/json", ContentType.JSON],
     ["application/xml", ContentType.XML],
     ["text/xml", ContentType.XML],
-    ["text/csv", ContentType.CSV],
+    ["", ContentType.CSV],
   ]);
 

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:215:5
 
   private extensionMap: Map<string, ContentType> = new Map([
     // Text
-    [".md", ContentType.MARKDOWN],
+    [],
     [".txt", ContentType.PLAIN_TEXT],
     [".rtf", ContentType.RICH_TEXT],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:217:5
     // Text
     [".md", ContentType.MARKDOWN],
     [".txt", ContentType.PLAIN_TEXT],
-    [".rtf", ContentType.RICH_TEXT],
+    [],
 
     // Documents

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:220:5
     [".rtf", ContentType.RICH_TEXT],
 
     // Documents
-    [".pdf", ContentType.PDF],
+    [],
     [".docx", ContentType.OFFICE_DOC],
     [".doc", ContentType.OFFICE_DOC],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:222:6
     // Documents
     [".pdf", ContentType.PDF],
     [".docx", ContentType.OFFICE_DOC],
-    [".doc", ContentType.OFFICE_DOC],
+    ["", ContentType.OFFICE_DOC],
     [".xlsx", ContentType.OFFICE_SHEET],
     [".xls", ContentType.OFFICE_SHEET],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:222:5
     // Documents
     [".pdf", ContentType.PDF],
     [".docx", ContentType.OFFICE_DOC],
-    [".doc", ContentType.OFFICE_DOC],
+    [],
     [".xlsx", ContentType.OFFICE_SHEET],
     [".xls", ContentType.OFFICE_SHEET],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:223:5
     [".pdf", ContentType.PDF],
     [".docx", ContentType.OFFICE_DOC],
     [".doc", ContentType.OFFICE_DOC],
-    [".xlsx", ContentType.OFFICE_SHEET],
+    [],
     [".xls", ContentType.OFFICE_SHEET],
     [".pptx", ContentType.OFFICE_PRESENTATION],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:224:6
     [".docx", ContentType.OFFICE_DOC],
     [".doc", ContentType.OFFICE_DOC],
     [".xlsx", ContentType.OFFICE_SHEET],
-    [".xls", ContentType.OFFICE_SHEET],
+    ["", ContentType.OFFICE_SHEET],
     [".pptx", ContentType.OFFICE_PRESENTATION],
     [".ppt", ContentType.OFFICE_PRESENTATION],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:224:5
     [".docx", ContentType.OFFICE_DOC],
     [".doc", ContentType.OFFICE_DOC],
     [".xlsx", ContentType.OFFICE_SHEET],
-    [".xls", ContentType.OFFICE_SHEET],
+    [],
     [".pptx", ContentType.OFFICE_PRESENTATION],
     [".ppt", ContentType.OFFICE_PRESENTATION],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:226:6
     [".xlsx", ContentType.OFFICE_SHEET],
     [".xls", ContentType.OFFICE_SHEET],
     [".pptx", ContentType.OFFICE_PRESENTATION],
-    [".ppt", ContentType.OFFICE_PRESENTATION],
+    ["", ContentType.OFFICE_PRESENTATION],
 
     // Images

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:226:5
     [".xlsx", ContentType.OFFICE_SHEET],
     [".xls", ContentType.OFFICE_SHEET],
     [".pptx", ContentType.OFFICE_PRESENTATION],
-    [".ppt", ContentType.OFFICE_PRESENTATION],
+    [],
 
     // Images

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:232:5
     [".jpg", ContentType.RASTER_IMAGE],
     [".jpeg", ContentType.RASTER_IMAGE],
     [".png", ContentType.RASTER_IMAGE],
-    [".gif", ContentType.RASTER_IMAGE],
+    [],
     [".bmp", ContentType.RASTER_IMAGE],
     [".tiff", ContentType.RASTER_IMAGE],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:233:5
     [".jpeg", ContentType.RASTER_IMAGE],
     [".png", ContentType.RASTER_IMAGE],
     [".gif", ContentType.RASTER_IMAGE],
-    [".bmp", ContentType.RASTER_IMAGE],
+    [],
     [".tiff", ContentType.RASTER_IMAGE],
     [".webp", ContentType.RASTER_IMAGE],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:236:5
     [".bmp", ContentType.RASTER_IMAGE],
     [".tiff", ContentType.RASTER_IMAGE],
     [".webp", ContentType.RASTER_IMAGE],
-    [".svg", ContentType.VECTOR_IMAGE],
+    [],
 
     // Audio

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:240:6
 
     // Audio
     [".mp3", ContentType.AUDIO],
-    [".wav", ContentType.AUDIO],
+    ["", ContentType.AUDIO],
     [".flac", ContentType.AUDIO],
     [".m4a", ContentType.AUDIO],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:241:6
     // Audio
     [".mp3", ContentType.AUDIO],
     [".wav", ContentType.AUDIO],
-    [".flac", ContentType.AUDIO],
+    ["", ContentType.AUDIO],
     [".m4a", ContentType.AUDIO],
     [".ogg", ContentType.AUDIO],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:241:5
     // Audio
     [".mp3", ContentType.AUDIO],
     [".wav", ContentType.AUDIO],
-    [".flac", ContentType.AUDIO],
+    [],
     [".m4a", ContentType.AUDIO],
     [".ogg", ContentType.AUDIO],

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:242:6
     [".mp3", ContentType.AUDIO],
     [".wav", ContentType.AUDIO],
     [".flac", ContentType.AUDIO],
-    [".m4a", ContentType.AUDIO],
+    ["", ContentType.AUDIO],
     [".ogg", ContentType.AUDIO],
 

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:247:6
 
     // Video
     [".mp4", ContentType.VIDEO],
-    [".avi", ContentType.VIDEO],
+    ["", ContentType.VIDEO],
     [".mov", ContentType.VIDEO],
     [".wmv", ContentType.VIDEO],

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:250:5
     [".avi", ContentType.VIDEO],
     [".mov", ContentType.VIDEO],
     [".wmv", ContentType.VIDEO],
-    [".mkv", ContentType.VIDEO],
+    [],
 
     // Structured Data

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:254:5
 
     // Structured Data
     [".json", ContentType.JSON],
-    [".xml", ContentType.XML],
+    [],
     [".csv", ContentType.CSV],
   ]);

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:254:6
 
     // Structured Data
     [".json", ContentType.JSON],
-    [".xml", ContentType.XML],
+    ["", ContentType.XML],
     [".csv", ContentType.CSV],
   ]);

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:255:5
     // Structured Data
     [".json", ContentType.JSON],
     [".xml", ContentType.XML],
-    [".csv", ContentType.CSV],
+    [],
   ]);
 

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:255:6
     // Structured Data
     [".json", ContentType.JSON],
     [".xml", ContentType.XML],
-    [".csv", ContentType.CSV],
+    ["", ContentType.CSV],
   ]);
 

[NoCoverage] MethodExpression
src/lib/multi-modal.ts:269:23
     const contentAnalysis = await this.analyzeContent(fileBuffer);
 
     // 3. Extension-based detection (as fallback)
-    const extension = path.extname(fileName).toLowerCase();
+    const extension = path.extname(fileName).toUpperCase();
     const extensionBasedType = this.extensionMap.get(extension);
 

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:277:9
 
     // 5. Final classification - prefer MIME type, fall back to extension, then content analysis
     let contentType: ContentType;
-    if (this.mimeTypeMap.has(mimeType)) {
+    if (true) {
       contentType = this.mimeTypeMap.get(mimeType)!;
     } else if (extensionBasedType) {

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:277:41
 
     // 5. Final classification - prefer MIME type, fall back to extension, then content analysis
     let contentType: ContentType;
-    if (this.mimeTypeMap.has(mimeType)) {
-      contentType = this.mimeTypeMap.get(mimeType)!;
-    } else if (extensionBasedType) {
+    if (this.mimeTypeMap.has(mimeType)) {} else if (extensionBasedType) {
       contentType = extensionBasedType;
     } else {

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:279:16
     let contentType: ContentType;
     if (this.mimeTypeMap.has(mimeType)) {
       contentType = this.mimeTypeMap.get(mimeType)!;
-    } else if (extensionBasedType) {
+    } else if (true) {
       contentType = extensionBasedType;
     } else {

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:279:16
     let contentType: ContentType;
     if (this.mimeTypeMap.has(mimeType)) {
       contentType = this.mimeTypeMap.get(mimeType)!;
-    } else if (extensionBasedType) {
+    } else if (false) {
       contentType = extensionBasedType;
     } else {

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:281:12
       contentType = this.mimeTypeMap.get(mimeType)!;
     } else if (extensionBasedType) {
       contentType = extensionBasedType;
-    } else {
-      contentType = this.classifyContentType(mimeType, contentAnalysis);
-    }
+    } else {}
 
     return {

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:307:32
       offset?: number;
     }> = [
       {
-        signature: Buffer.from([0x25, 0x50, 0x44, 0x46]),
+        signature: Buffer.from([]),
         mimeType: "application/pdf",
       }, // %PDF

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:308:19
     }> = [
       {
         signature: Buffer.from([0x25, 0x50, 0x44, 0x46]),
-        mimeType: "application/pdf",
+        mimeType: "",
       }, // %PDF
       { signature: Buffer.from([0xff, 0xd8, 0xff]), mimeType: "image/jpeg" }, // JPEG

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:310:63
         signature: Buffer.from([0x25, 0x50, 0x44, 0x46]),
         mimeType: "application/pdf",
       }, // %PDF
-      { signature: Buffer.from([0xff, 0xd8, 0xff]), mimeType: "image/jpeg" }, // JPEG
+      { signature: Buffer.from([0xff, 0xd8, 0xff]), mimeType: "" }, // JPEG
       {
         signature: Buffer.from([0x89, 0x50, 0x4e, 0x47]),

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:310:32
         signature: Buffer.from([0x25, 0x50, 0x44, 0x46]),
         mimeType: "application/pdf",
       }, // %PDF
-      { signature: Buffer.from([0xff, 0xd8, 0xff]), mimeType: "image/jpeg" }, // JPEG
+      { signature: Buffer.from([]), mimeType: "image/jpeg" }, // JPEG
       {
         signature: Buffer.from([0x89, 0x50, 0x4e, 0x47]),

[NoCoverage] ObjectLiteral
src/lib/multi-modal.ts:311:7
         mimeType: "application/pdf",
       }, // %PDF
       { signature: Buffer.from([0xff, 0xd8, 0xff]), mimeType: "image/jpeg" }, // JPEG
-      {
-        signature: Buffer.from([0x89, 0x50, 0x4e, 0x47]),
-        mimeType: "image/png",
-      }, // PNG
+      {}, // PNG
       {
         signature: Buffer.from([0x47, 0x49, 0x46, 0x38]),

[NoCoverage] ObjectLiteral
src/lib/multi-modal.ts:315:7
         signature: Buffer.from([0x89, 0x50, 0x4e, 0x47]),
         mimeType: "image/png",
       }, // PNG
-      {
-        signature: Buffer.from([0x47, 0x49, 0x46, 0x38]),
-        mimeType: "image/gif",
-      }, // GIF
+      {}, // GIF
       { signature: Buffer.from([0x42, 0x4d]), mimeType: "image/bmp" }, // BMP
       {

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:317:19
       }, // PNG
       {
         signature: Buffer.from([0x47, 0x49, 0x46, 0x38]),
-        mimeType: "image/gif",
+        mimeType: "",
       }, // GIF
       { signature: Buffer.from([0x42, 0x4d]), mimeType: "image/bmp" }, // BMP

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:319:57
         signature: Buffer.from([0x47, 0x49, 0x46, 0x38]),
         mimeType: "image/gif",
       }, // GIF
-      { signature: Buffer.from([0x42, 0x4d]), mimeType: "image/bmp" }, // BMP
+      { signature: Buffer.from([0x42, 0x4d]), mimeType: "" }, // BMP
       {
         signature: Buffer.from([0x49, 0x49, 0x2a, 0x00]),

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:319:32
         signature: Buffer.from([0x47, 0x49, 0x46, 0x38]),
         mimeType: "image/gif",
       }, // GIF
-      { signature: Buffer.from([0x42, 0x4d]), mimeType: "image/bmp" }, // BMP
+      { signature: Buffer.from([]), mimeType: "image/bmp" }, // BMP
       {
         signature: Buffer.from([0x49, 0x49, 0x2a, 0x00]),

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:321:32
       }, // GIF
       { signature: Buffer.from([0x42, 0x4d]), mimeType: "image/bmp" }, // BMP
       {
-        signature: Buffer.from([0x49, 0x49, 0x2a, 0x00]),
+        signature: Buffer.from([]),
         mimeType: "image/tiff",
       }, // TIFF (little-endian)

[NoCoverage] ObjectLiteral
src/lib/multi-modal.ts:324:7
         signature: Buffer.from([0x49, 0x49, 0x2a, 0x00]),
         mimeType: "image/tiff",
       }, // TIFF (little-endian)
-      {
-        signature: Buffer.from([0x4d, 0x4d, 0x00, 0x2a]),
-        mimeType: "image/tiff",
-      }, // TIFF (big-endian)
+      {}, // TIFF (big-endian)
       {
         signature: Buffer.from([0x52, 0x49, 0x46, 0x46]),

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:336:19
         signature: Buffer.from([
           0x00, 0x00, 0x00, 0x20, 0x66, 0x74, 0x79, 0x70,
         ]),
-        mimeType: "video/mp4",
+        mimeType: "",
       }, // MP4
       {

[NoCoverage] ObjectLiteral
src/lib/multi-modal.ts:338:7
         ]),
         mimeType: "video/mp4",
       }, // MP4
-      {
-        signature: Buffer.from([0x66, 0x74, 0x79, 0x70]),
-        mimeType: "video/mp4",
-        offset: 4,
-      }, // MP4 (alternative)
+      {}, // MP4 (alternative)
     ];
 

[NoCoverage] ArrayDeclaration
src/lib/multi-modal.ts:339:32
         mimeType: "video/mp4",
       }, // MP4
       {
-        signature: Buffer.from([0x66, 0x74, 0x79, 0x70]),
+        signature: Buffer.from([]),
         mimeType: "video/mp4",
         offset: 4,

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:345:67
       }, // MP4 (alternative)
     ];
 
-    for (const { signature, mimeType, offset = 0 } of signatures) {
-      if (buffer.length >= signature.length + offset) {
-        const bufferSlice = buffer.slice(offset, offset + signature.length);
-        if (bufferSlice.equals(signature)) {
-          return mimeType;
-        }
-      }
-    }
+    for (const { signature, mimeType, offset = 0 } of signatures) {}
 
     // Fallback to extension-based detection

[NoCoverage] ArithmeticOperator
src/lib/multi-modal.ts:346:28
     ];
 
     for (const { signature, mimeType, offset = 0 } of signatures) {
-      if (buffer.length >= signature.length + offset) {
+      if (buffer.length >= signature.length - offset) {
         const bufferSlice = buffer.slice(offset, offset + signature.length);
         if (bufferSlice.equals(signature)) {

[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:346:11
     ];
 
     for (const { signature, mimeType, offset = 0 } of signatures) {
-      if (buffer.length >= signature.length + offset) {
+      if (buffer.length > signature.length + offset) {
         const bufferSlice = buffer.slice(offset, offset + signature.length);
         if (bufferSlice.equals(signature)) {

[NoCoverage] MethodExpression
src/lib/multi-modal.ts:347:29
 
     for (const { signature, mimeType, offset = 0 } of signatures) {
       if (buffer.length >= signature.length + offset) {
-        const bufferSlice = buffer.slice(offset, offset + signature.length);
+        const bufferSlice = buffer;
         if (bufferSlice.equals(signature)) {
           return mimeType;

[NoCoverage] ArithmeticOperator
src/lib/multi-modal.ts:347:50
 
     for (const { signature, mimeType, offset = 0 } of signatures) {
       if (buffer.length >= signature.length + offset) {
-        const bufferSlice = buffer.slice(offset, offset + signature.length);
+        const bufferSlice = buffer.slice(offset, offset - signature.length);
         if (bufferSlice.equals(signature)) {
           return mimeType;

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:348:13
     for (const { signature, mimeType, offset = 0 } of signatures) {
       if (buffer.length >= signature.length + offset) {
         const bufferSlice = buffer.slice(offset, offset + signature.length);
-        if (bufferSlice.equals(signature)) {
+        if (true) {
           return mimeType;
         }

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:348:44
     for (const { signature, mimeType, offset = 0 } of signatures) {
       if (buffer.length >= signature.length + offset) {
         const bufferSlice = buffer.slice(offset, offset + signature.length);
-        if (bufferSlice.equals(signature)) {
-          return mimeType;
-        }
+        if (bufferSlice.equals(signature)) {}
       }
     }

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:355:12
     }
 
     // Fallback to extension-based detection
-    return "application/octet-stream";
+    return "";
   }
 

[NoCoverage] BooleanLiteral
src/lib/multi-modal.ts:362:16
     buffer: Buffer
   ): Promise<{ features: ContentFeatures }> {
     const features: ContentFeatures = {
-      hasText: false,
+      hasText: true,
       hasImages: false,
       hasAudio: false,

[NoCoverage] BooleanLiteral
src/lib/multi-modal.ts:363:18
   ): Promise<{ features: ContentFeatures }> {
     const features: ContentFeatures = {
       hasText: false,
-      hasImages: false,
+      hasImages: true,
       hasAudio: false,
       hasVideo: false,

[NoCoverage] BooleanLiteral
src/lib/multi-modal.ts:364:17
     const features: ContentFeatures = {
       hasText: false,
       hasImages: false,
-      hasAudio: false,
+      hasAudio: true,
       hasVideo: false,
       isStructured: false,

[NoCoverage] BooleanLiteral
src/lib/multi-modal.ts:365:17
       hasText: false,
       hasImages: false,
       hasAudio: false,
-      hasVideo: false,
+      hasVideo: true,
       isStructured: false,
       encoding: "unknown",

[NoCoverage] BooleanLiteral
src/lib/multi-modal.ts:366:21
       hasImages: false,
       hasAudio: false,
       hasVideo: false,
-      isStructured: false,
+      isStructured: true,
       encoding: "unknown",
       language: "unknown",

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:378:27
     features.isStructured = this.detectStructuredData(buffer);
 
     // Detect encoding if text
-    if (features.hasText) {
-      features.encoding = await this.detectEncoding(buffer);
-      features.language = await this.detectLanguage(buffer);
-    }
+    if (features.hasText) {}
 
     // Note: Binary file analysis for images/audio/video would require

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:378:9
     features.isStructured = this.detectStructuredData(buffer);
 
     // Detect encoding if text
-    if (features.hasText) {
+    if (false) {
       features.encoding = await this.detectEncoding(buffer);
       features.language = await this.detectLanguage(buffer);

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:389:54
     return { features };
   }
 
-  private detectTextContent(buffer: Buffer): boolean {
-    // Check if buffer contains mostly printable ASCII characters
-    const sampleSize = Math.min(1024, buffer.length);
-    let printableChars = 0;
-    let totalChars = 0;
-
-    for (let i = 0; i < sampleSize; i++) {
-      const byte = buffer[i];
-      totalChars++;
-
-      // Count printable ASCII characters (32-126) and common whitespace
-      if (
-        (byte >= 32 && byte <= 126) ||
-        byte === 9 ||
-        byte === 10 ||
-        byte === 13
-      ) {
-        printableChars++;
-      }
-    }
-
-    // Consider it text if > 70% printable characters
-    return totalChars > 0 && printableChars / totalChars > 0.7;
-  }
+  private detectTextContent(buffer: Buffer): boolean {}
 
   private detectStructuredData(buffer: Buffer): boolean {

[NoCoverage] MethodExpression
src/lib/multi-modal.ts:391:24
 
   private detectTextContent(buffer: Buffer): boolean {
     // Check if buffer contains mostly printable ASCII characters
-    const sampleSize = Math.min(1024, buffer.length);
+    const sampleSize = Math.max(1024, buffer.length);
     let printableChars = 0;
     let totalChars = 0;

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:395:21
     let printableChars = 0;
     let totalChars = 0;
 
-    for (let i = 0; i < sampleSize; i++) {
+    for (let i = 0; false; i++) {
       const byte = buffer[i];
       totalChars++;

[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:395:21
     let printableChars = 0;
     let totalChars = 0;
 
-    for (let i = 0; i < sampleSize; i++) {
+    for (let i = 0; i <= sampleSize; i++) {
       const byte = buffer[i];
       totalChars++;

[NoCoverage] UpdateOperator
src/lib/multi-modal.ts:397:7
 
     for (let i = 0; i < sampleSize; i++) {
       const byte = buffer[i];
-      totalChars++;
+      totalChars--;
 
       // Count printable ASCII characters (32-126) and common whitespace

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:401:9
 
       // Count printable ASCII characters (32-126) and common whitespace
       if (
-        (byte >= 32 && byte <= 126) ||
-        byte === 9 ||
-        byte === 10 ||
-        byte === 13
+        true
       ) {
         printableChars++;

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:401:9
 
       // Count printable ASCII characters (32-126) and common whitespace
       if (
-        (byte >= 32 && byte <= 126) ||
-        byte === 9 ||
-        byte === 10 ||
-        byte === 13
+        false
       ) {
         printableChars++;

[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:402:9
       // Count printable ASCII characters (32-126) and common whitespace
       if (
         (byte >= 32 && byte <= 126) ||
-        byte === 9 ||
+        byte !== 9 ||
         byte === 10 ||
         byte === 13

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:402:9
       // Count printable ASCII characters (32-126) and common whitespace
       if (
         (byte >= 32 && byte <= 126) ||
-        byte === 9 ||
+        false ||
         byte === 10 ||
         byte === 13

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:403:9
       if (
         (byte >= 32 && byte <= 126) ||
         byte === 9 ||
-        byte === 10 ||
+        false ||
         byte === 13
       ) {

[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:403:9
       if (
         (byte >= 32 && byte <= 126) ||
         byte === 9 ||
-        byte === 10 ||
+        byte !== 10 ||
         byte === 13
       ) {

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:404:9
         (byte >= 32 && byte <= 126) ||
         byte === 9 ||
         byte === 10 ||
-        byte === 13
+        false
       ) {
         printableChars++;

[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:404:9
         (byte >= 32 && byte <= 126) ||
         byte === 9 ||
         byte === 10 ||
-        byte === 13
+        byte !== 13
       ) {
         printableChars++;

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:405:9
         byte === 9 ||
         byte === 10 ||
         byte === 13
-      ) {
-        printableChars++;
-      }
+      ) {}
     }
 

[NoCoverage] UpdateOperator
src/lib/multi-modal.ts:406:9
         byte === 10 ||
         byte === 13
       ) {
-        printableChars++;
+        printableChars--;
       }
     }

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:411:12
     }
 
     // Consider it text if > 70% printable characters
-    return totalChars > 0 && printableChars / totalChars > 0.7;
+    return true;
   }
 

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:411:12
     }
 
     // Consider it text if > 70% printable characters
-    return totalChars > 0 && printableChars / totalChars > 0.7;
+    return true && printableChars / totalChars > 0.7;
   }
 

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:415:9
   }
 
   private detectStructuredData(buffer: Buffer): boolean {
-    if (!this.detectTextContent(buffer)) return false;
+    if (false) return false;
 
     const text = buffer.toString("utf8", 0, Math.min(1024, buffer.length));

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:415:9
   }
 
   private detectStructuredData(buffer: Buffer): boolean {
-    if (!this.detectTextContent(buffer)) return false;
+    if (true) return false;
 
     const text = buffer.toString("utf8", 0, Math.min(1024, buffer.length));

[NoCoverage] MethodExpression
src/lib/multi-modal.ts:417:45
   private detectStructuredData(buffer: Buffer): boolean {
     if (!this.detectTextContent(buffer)) return false;
 
-    const text = buffer.toString("utf8", 0, Math.min(1024, buffer.length));
+    const text = buffer.toString("utf8", 0, Math.max(1024, buffer.length));
 
     // Check for JSON
