[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:766:11
   ): Promise<ContentMetadata> {
     try {
       // For raster images, attempt OCR
-      if (base.type === ContentType.RASTER_IMAGE) {
+      if (base.type !== ContentType.RASTER_IMAGE) {
         const ocrResult = await this.ocrProcessor.extractTextFromBuffer(
           buffer,

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:766:11
   ): Promise<ContentMetadata> {
     try {
       // For raster images, attempt OCR
-      if (base.type === ContentType.RASTER_IMAGE) {
+      if (false) {
         const ocrResult = await this.ocrProcessor.extractTextFromBuffer(
           buffer,

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:786:21
         ...base,
         dimensions: { width: 0, height: 0 }, // Placeholder for future image analysis
       };
-    } catch (error) {
-      // Fallback to basic metadata if OCR fails
-      return {
-        ...base,
-        dimensions: { width: 0, height: 0 },
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/lib/multi-modal.ts:788:14
       };
     } catch (error) {
       // Fallback to basic metadata if OCR fails
-      return {
-        ...base,
-        dimensions: { width: 0, height: 0 },
-      };
+      return {};
     }
   }

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:799:31
     buffer: Buffer,
     contentType: ContentType,
     base: ContentMetadata
-  ): Promise<ContentMetadata> {
-    try {
-      // Use the Office processor to extract detailed metadata
-      const officeResult = await this.officeProcessor.extractTextFromBuffer(
-        buffer,
-        contentType
-      );
-
-      // Merge with base metadata
-      return {
-        ...base,
-        ...officeResult.metadata,
-      };
-    } catch (error) {
-      // Fallback to basic metadata if Office processing fails
-      return {
-        ...base,
-        wordCount: 0,
-        characterCount: buffer.length,
-      };
-    }
-  }
+  ): Promise<ContentMetadata> {}
 
   private async extractSpeechMetadata(

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:800:9
     contentType: ContentType,
     base: ContentMetadata
   ): Promise<ContentMetadata> {
-    try {
-      // Use the Office processor to extract detailed metadata
-      const officeResult = await this.officeProcessor.extractTextFromBuffer(
-        buffer,
-        contentType
-      );
-
-      // Merge with base metadata
-      return {
-        ...base,
-        ...officeResult.metadata,
-      };
-    } catch (error) {
+    try {} catch (error) {
       // Fallback to basic metadata if Office processing fails
       return {

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:812:21
         ...base,
         ...officeResult.metadata,
       };
-    } catch (error) {
-      // Fallback to basic metadata if Office processing fails
-      return {
-        ...base,
-        wordCount: 0,
-        characterCount: buffer.length,
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:825:31
   private async extractSpeechMetadata(
     buffer: Buffer,
     base: ContentMetadata
-  ): Promise<ContentMetadata> {
-    try {
-      // Use the speech processor to extract transcription and metadata
-      const speechResult = await this.speechProcessor.transcribeFromBuffer(
-        buffer,
-        {
-          language: "en", // Default to English
-          sampleRate: 16000,
-        }
-      );
-
-      // Merge with base metadata
-      return {
-        ...base,
-        ...speechResult.metadata,
-      };
-    } catch (error) {
-      // Fallback to basic metadata if speech processing fails
-      return {
-        ...base,
-        wordCount: 0,
-        characterCount: 0,
-      };
-    }
-  }
+  ): Promise<ContentMetadata> {}
 
   private async extractAudioMetadata(

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:826:9
     buffer: Buffer,
     base: ContentMetadata
   ): Promise<ContentMetadata> {
-    try {
-      // Use the speech processor to extract transcription and metadata
-      const speechResult = await this.speechProcessor.transcribeFromBuffer(
-        buffer,
-        {
-          language: "en", // Default to English
-          sampleRate: 16000,
-        }
-      );
-
-      // Merge with base metadata
-      return {
-        ...base,
-        ...speechResult.metadata,
-      };
-    } catch (error) {
+    try {} catch (error) {
       // Fallback to basic metadata if speech processing fails
       return {

[NoCoverage] ObjectLiteral
src/lib/multi-modal.ts:837:14
       );
 
       // Merge with base metadata
-      return {
-        ...base,
-        ...speechResult.metadata,
-      };
+      return {};
     } catch (error) {
       // Fallback to basic metadata if speech processing fails

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:841:21
         ...base,
         ...speechResult.metadata,
       };
-    } catch (error) {
-      // Fallback to basic metadata if speech processing fails
-      return {
-        ...base,
-        wordCount: 0,
-        characterCount: 0,
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:854:31
   private async extractAudioMetadata(
     buffer: Buffer,
     base: ContentMetadata
-  ): Promise<ContentMetadata> {
-    // Placeholder - would need music-metadata library
-    // For now, return basic metadata
-    return {
-      ...base,
-      duration: 0, // Placeholder
-    };
-  }
+  ): Promise<ContentMetadata> {}
 
   private async extractVideoMetadata(

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:866:31
   private async extractVideoMetadata(
     buffer: Buffer,
     base: ContentMetadata
-  ): Promise<ContentMetadata> {
-    // Placeholder - would need ffprobe or similar
-    // For now, return basic metadata
-    return {
-      ...base,
-      duration: 0, // Placeholder
-      dimensions: { width: 0, height: 0 }, // Placeholder
-    };
-  }
+  ): Promise<ContentMetadata> {}
 
   private async extractStructuredMetadata(

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:879:31
   private async extractStructuredMetadata(
     buffer: Buffer,
     base: ContentMetadata
-  ): Promise<ContentMetadata> {
-    const text = buffer.toString("utf8");
-
-    return {
-      ...base,
-      wordCount: text.split(/\s+/).filter((word) => word.length > 0).length,
-      characterCount: text.length,
-    };
-  }
+  ): Promise<ContentMetadata> {}
 
   private calculateCompleteness(contentMetadata: ContentMetadata): number {

[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:884:53
 
     return {
       ...base,
-      wordCount: text.split(/\s+/).filter((word) => word.length > 0).length,
+      wordCount: text.split(/\s+/).filter((word) => word.length <= 0).length,
       characterCount: text.length,
     };

[NoCoverage] MethodExpression
src/lib/multi-modal.ts:884:18
 
     return {
       ...base,
-      wordCount: text.split(/\s+/).filter((word) => word.length > 0).length,
+      wordCount: text.split(/\s+/).length,
       characterCount: text.length,
     };

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:894:5
     let maxScore = 0;
 
     // Type is always present
-    score += 1;
+    score -= 1;
     maxScore += 1;
 

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:895:5
 
     // Type is always present
     score += 1;
-    maxScore += 1;
+    maxScore -= 1;
 
     // Language detection

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:898:77
     maxScore += 1;
 
     // Language detection
-    if (contentMetadata.language && contentMetadata.language !== "unknown") {
-      score += 1;
-    }
+    if (contentMetadata.language && contentMetadata.language !== "unknown") {}
     maxScore += 1;
 

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:898:9
     maxScore += 1;
 
     // Language detection
-    if (contentMetadata.language && contentMetadata.language !== "unknown") {
+    if (false) {
       score += 1;
     }

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:899:7
 
     // Language detection
     if (contentMetadata.language && contentMetadata.language !== "unknown") {
-      score += 1;
+      score -= 1;
     }
     maxScore += 1;

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:901:5
     if (contentMetadata.language && contentMetadata.language !== "unknown") {
       score += 1;
     }
-    maxScore += 1;
+    maxScore -= 1;
 
     // Encoding detection

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:904:9
     maxScore += 1;
 
     // Encoding detection
-    if (contentMetadata.encoding && contentMetadata.encoding !== "unknown") {
+    if (false) {
       score += 1;
     }

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:904:37
     maxScore += 1;
 
     // Encoding detection
-    if (contentMetadata.encoding && contentMetadata.encoding !== "unknown") {
+    if (contentMetadata.encoding && true) {
       score += 1;
     }

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:905:7
 
     // Encoding detection
     if (contentMetadata.encoding && contentMetadata.encoding !== "unknown") {
-      score += 1;
+      score -= 1;
     }
     maxScore += 1;

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:912:7
     // Content-specific metrics
     switch (contentMetadata.type) {
       case ContentType.MARKDOWN:
-      case ContentType.PLAIN_TEXT:
-        if (contentMetadata.wordCount !== undefined) score += 1;
-        if (contentMetadata.characterCount !== undefined) score += 1;
-        maxScore += 2;
-        break;
+      case ContentType.PLAIN_TEXT:
 
       case ContentType.PDF:

[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:913:13
     switch (contentMetadata.type) {
       case ContentType.MARKDOWN:
       case ContentType.PLAIN_TEXT:
-        if (contentMetadata.wordCount !== undefined) score += 1;
+        if (contentMetadata.wordCount === undefined) score += 1;
         if (contentMetadata.characterCount !== undefined) score += 1;
         maxScore += 2;

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:913:54
     switch (contentMetadata.type) {
       case ContentType.MARKDOWN:
       case ContentType.PLAIN_TEXT:
-        if (contentMetadata.wordCount !== undefined) score += 1;
+        if (contentMetadata.wordCount !== undefined) score -= 1;
         if (contentMetadata.characterCount !== undefined) score += 1;
         maxScore += 2;

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:914:13
       case ContentType.MARKDOWN:
       case ContentType.PLAIN_TEXT:
         if (contentMetadata.wordCount !== undefined) score += 1;
-        if (contentMetadata.characterCount !== undefined) score += 1;
+        if (false) score += 1;
         maxScore += 2;
         break;

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:914:13
       case ContentType.MARKDOWN:
       case ContentType.PLAIN_TEXT:
         if (contentMetadata.wordCount !== undefined) score += 1;
-        if (contentMetadata.characterCount !== undefined) score += 1;
+        if (true) score += 1;
         maxScore += 2;
         break;

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:915:9
       case ContentType.PLAIN_TEXT:
         if (contentMetadata.wordCount !== undefined) score += 1;
         if (contentMetadata.characterCount !== undefined) score += 1;
-        maxScore += 2;
+        maxScore -= 2;
         break;
 

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:918:7
         maxScore += 2;
         break;
 
-      case ContentType.PDF:
-        if (contentMetadata.pageCount !== undefined) score += 1;
-        maxScore += 1;
-        break;
+      case ContentType.PDF:
 
       case ContentType.RASTER_IMAGE:

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:919:13
         break;
 
       case ContentType.PDF:
-        if (contentMetadata.pageCount !== undefined) score += 1;
+        if (true) score += 1;
         maxScore += 1;
         break;

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:919:54
         break;
 
       case ContentType.PDF:
-        if (contentMetadata.pageCount !== undefined) score += 1;
+        if (contentMetadata.pageCount !== undefined) score -= 1;
         maxScore += 1;
         break;

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:920:9
 
       case ContentType.PDF:
         if (contentMetadata.pageCount !== undefined) score += 1;
-        maxScore += 1;
+        maxScore -= 1;
         break;
 

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:924:7
         break;
 
       case ContentType.RASTER_IMAGE:
-      case ContentType.VECTOR_IMAGE:
-        if (contentMetadata.dimensions !== undefined) score += 1;
-        maxScore += 1;
-        break;
+      case ContentType.VECTOR_IMAGE:
 
       case ContentType.AUDIO:

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:925:13
 
       case ContentType.RASTER_IMAGE:
       case ContentType.VECTOR_IMAGE:
-        if (contentMetadata.dimensions !== undefined) score += 1;
+        if (false) score += 1;
         maxScore += 1;
         break;

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:925:13
 
       case ContentType.RASTER_IMAGE:
       case ContentType.VECTOR_IMAGE:
-        if (contentMetadata.dimensions !== undefined) score += 1;
+        if (true) score += 1;
         maxScore += 1;
         break;

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:926:9
       case ContentType.RASTER_IMAGE:
       case ContentType.VECTOR_IMAGE:
         if (contentMetadata.dimensions !== undefined) score += 1;
-        maxScore += 1;
+        maxScore -= 1;
         break;
 

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:930:7
         break;
 
       case ContentType.AUDIO:
-      case ContentType.VIDEO:
-        if (contentMetadata.duration !== undefined) score += 1;
-        maxScore += 1;
-        break;
+      case ContentType.VIDEO:
     }
 

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:931:53
 
       case ContentType.AUDIO:
       case ContentType.VIDEO:
-        if (contentMetadata.duration !== undefined) score += 1;
+        if (contentMetadata.duration !== undefined) score -= 1;
         maxScore += 1;
         break;

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:931:13
 
       case ContentType.AUDIO:
       case ContentType.VIDEO:
-        if (contentMetadata.duration !== undefined) score += 1;
+        if (true) score += 1;
         maxScore += 1;
         break;

[NoCoverage] AssignmentOperator
src/lib/multi-modal.ts:932:9
       case ContentType.AUDIO:
       case ContentType.VIDEO:
         if (contentMetadata.duration !== undefined) score += 1;
-        maxScore += 1;
+        maxScore -= 1;
         break;
     }

[NoCoverage] ConditionalExpression
src/lib/multi-modal.ts:936:12
         break;
     }
 
-    return maxScore > 0 ? score / maxScore : 0;
+    return false ? score / maxScore : 0;
   }
 

[NoCoverage] EqualityOperator
src/lib/multi-modal.ts:936:12
         break;
     }
 
-    return maxScore > 0 ? score / maxScore : 0;
+    return maxScore <= 0 ? score / maxScore : 0;
   }
 

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:939:52
     return maxScore > 0 ? score / maxScore : 0;
   }
 
-  private generateFileId(filePath: string): string {
-    const hash = createHash("md5").update(filePath).digest("hex").slice(0, 8);
-    return `file_${hash}`;
-  }
+  private generateFileId(filePath: string): string {}
 
   private generateChecksum(buffer: Buffer): string {

[NoCoverage] MethodExpression
src/lib/multi-modal.ts:940:18
   }
 
   private generateFileId(filePath: string): string {
-    const hash = createHash("md5").update(filePath).digest("hex").slice(0, 8);
+    const hash = createHash("md5").update(filePath).digest("hex");
     return `file_${hash}`;
   }

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:940:29
   }
 
   private generateFileId(filePath: string): string {
-    const hash = createHash("md5").update(filePath).digest("hex").slice(0, 8);
+    const hash = createHash("").update(filePath).digest("hex").slice(0, 8);
     return `file_${hash}`;
   }

[NoCoverage] StringLiteral
src/lib/multi-modal.ts:941:12
 
   private generateFileId(filePath: string): string {
     const hash = createHash("md5").update(filePath).digest("hex").slice(0, 8);
-    return `file_${hash}`;
+    return ``;
   }
 

[NoCoverage] BlockStatement
src/lib/multi-modal.ts:944:52
     return `file_${hash}`;
   }
 
-  private generateChecksum(buffer: Buffer): string {
-    return createHash("md5").update(buffer).digest("hex");
-  }
+  private generateChecksum(buffer: Buffer): string {}
 }
 
