[Killed] BlockStatement
src/lib/obsidian-models.ts:89:49
  * Utility functions for Obsidian document processing
  */
 export class ObsidianUtils {
-  static cleanMarkdown(content: string): string {
-    return content
-      .replace(/^---[\s\S]*?---\n?/m, "")
-      .replace(
-        /\[\[([^\]|]+)(?:\|([^\]]+))?\]\]/g,
-        (_, target, display) => display || target
-      )
-      .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
-      .replace(/(\*\*|__)(.*?)\1/g, "$2")
-      .replace(/(\*|_)(.*?)\1/g, "$2")
-      .replace(/`([^`]+)`/g, "$1")
-      .replace(/~~(.*?)~~/g, "$1")
-      .replace(/^#{1,6}\s+(.*)$/gm, "$1")
-      .replace(/\n{3,}/g, "\n\n")
-      .trim();
-  }
+  static cleanMarkdown(content: string): string {}
 
   static extractWikilinks(content: string): string[] {
killedBy: ObsidianUtils cleanMarkdown should remove frontmatter
statusReason: expected undefined to be 'This is the content.' // Object.is equality

[Survived] Regex
src/lib/obsidian-models.ts:97:16
         (_, target, display) => display || target
       )
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
-      .replace(/(\*\*|__)(.*?)\1/g, "$2")
+      .replace(/(\*\*|__)(.)\1/g, "$2")
       .replace(/(\*|_)(.*?)\1/g, "$2")
       .replace(/`([^`]+)`/g, "$1")

[Killed] Regex
src/lib/obsidian-models.ts:99:16
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
       .replace(/(\*\*|__)(.*?)\1/g, "$2")
       .replace(/(\*|_)(.*?)\1/g, "$2")
-      .replace(/`([^`]+)`/g, "$1")
+      .replace(/`([^`])`/g, "$1")
       .replace(/~~(.*?)~~/g, "$1")
       .replace(/^#{1,6}\s+(.*)$/gm, "$1")
killedBy: ObsidianUtils cleanMarkdown should remove inline code formatting
statusReason: expected 'Use the `console.log()` function.' to be 'Use the console.log() function.' // Object.is equality

[Killed] Regex
src/lib/obsidian-models.ts:99:16
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
       .replace(/(\*\*|__)(.*?)\1/g, "$2")
       .replace(/(\*|_)(.*?)\1/g, "$2")
-      .replace(/`([^`]+)`/g, "$1")
+      .replace(/`([`]+)`/g, "$1")
       .replace(/~~(.*?)~~/g, "$1")
       .replace(/^#{1,6}\s+(.*)$/gm, "$1")
killedBy: ObsidianUtils cleanMarkdown should remove inline code formatting
statusReason: expected 'Use the `console.log()` function.' to be 'Use the console.log() function.' // Object.is equality

[Killed] BlockStatement
src/lib/obsidian-models.ts:106:54
       .trim();
   }
 
-  static extractWikilinks(content: string): string[] {
-    const wikilinkRegex = /\[\[([^\]]+)\]\]/g;
-    const links: string[] = [];
-    let match;
-
-    while ((match = wikilinkRegex.exec(content)) !== null) {
-      const linkContent = match[1];
-      // Split on | and take the first part (the target)
-      const target = linkContent.split("|")[0];
-      links.push(target);
-    }
-
-    return [...new Set(links)];
-  }
+  static extractWikilinks(content: string): string[] {}
 
   static extractTags(content: string): string[] {
killedBy: ObsidianUtils extractWikilinks should extract simple wikilinks
statusReason: expected undefined to deeply equal [ 'Simple Link' ]

[Killed] BlockStatement
src/lib/obsidian-models.ts:111:60
     const links: string[] = [];
     let match;
 
-    while ((match = wikilinkRegex.exec(content)) !== null) {
-      const linkContent = match[1];
-      // Split on | and take the first part (the target)
-      const target = linkContent.split("|")[0];
-      links.push(target);
-    }
+    while ((match = wikilinkRegex.exec(content)) !== null) {}
 
     return [...new Set(links)];
killedBy: ObsidianUtils extractWikilinks should extract simple wikilinks
statusReason: expected [] to deeply equal [ 'Simple Link' ]

[Killed] Regex
src/lib/obsidian-models.ts:134:30
   }
 
   static parseFrontmatter(content: string): Record<string, any> {
-    const frontmatterRegex = /^---\n([\s\S]*?)\n---/;
+    const frontmatterRegex = /^---\n([\S\S]*?)\n---/;
     const match = content.match(frontmatterRegex);
 
killedBy: ObsidianUtils parseFrontmatter should parse simple frontmatter
statusReason: expected {} to deeply equal { title: 'Test Document', …(2) }

[Survived] Regex
src/lib/obsidian-models.ts:134:30
   }
 
   static parseFrontmatter(content: string): Record<string, any> {
-    const frontmatterRegex = /^---\n([\s\S]*?)\n---/;
+    const frontmatterRegex = /---\n([\s\S]*?)\n---/;
     const match = content.match(frontmatterRegex);
 

[Killed] BooleanLiteral
src/lib/obsidian-models.ts:137:9
     const frontmatterRegex = /^---\n([\s\S]*?)\n---/;
     const match = content.match(frontmatterRegex);
 
-    if (!match) return {};
+    if (match) return {};
 
     try {
killedBy: ObsidianUtils parseFrontmatter should parse simple frontmatter
statusReason: expected {} to deeply equal { title: 'Test Document', …(2) }

[Killed] ConditionalExpression
src/lib/obsidian-models.ts:146:20
 
       for (const line of lines) {
         const [key, ...valueParts] = line.split(":");
-        if (key && valueParts.length > 0) {
+        if (key && true) {
           const value = valueParts.join(":").trim();
           // Remove quotes if present
killedBy: ObsidianUtils parseFrontmatter should handle lines without colons
statusReason: expected { title: 'Valid Line', …(2) } to deeply equal { title: 'Valid Line', …(1) }

[Killed] ConditionalExpression
src/lib/obsidian-models.ts:146:13
 
       for (const line of lines) {
         const [key, ...valueParts] = line.split(":");
-        if (key && valueParts.length > 0) {
+        if (false) {
           const value = valueParts.join(":").trim();
           // Remove quotes if present
killedBy: ObsidianUtils parseFrontmatter should parse simple frontmatter
statusReason: expected {} to deeply equal { title: 'Test Document', …(2) }

[Killed] Regex
src/lib/obsidian-models.ts:149:51
         if (key && valueParts.length > 0) {
           const value = valueParts.join(":").trim();
           // Remove quotes if present
-          frontmatter[key.trim()] = value.replace(/^["']|["']$/g, "");
+          frontmatter[key.trim()] = value.replace(/^["']|[^"']$/g, "");
         }
       }
killedBy: ObsidianUtils parseFrontmatter should parse simple frontmatter
statusReason: expected { title: 'Test Documen', …(2) } to deeply equal { title: 'Test Document', …(2) }

[Killed] StringLiteral
src/lib/obsidian-models.ts:161:30
 
   static generateFileChecksum(content: string): string {
     const crypto = require("crypto");
-    return crypto.createHash("sha256").update(content).digest("hex");
+    return crypto.createHash("").update(content).digest("hex");
   }
 
killedBy: ObsidianUtils generateFileChecksum should generate checksum for content
statusReason: Digest method not supported

[Killed] BlockStatement
src/lib/obsidian-models.ts:168:13
     filePath: string,
     vaultPath: string,
     frontmatter: Record<string, any>
-  ): string {
-    // Check frontmatter type first (prioritize explicit type)
-    if (frontmatter.type) {
-      return frontmatter.type;
-    }
-
-    const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
-
-    // Path-based classification
-    if (relativePath.includes("MOCs/")) return "moc";
-    if (relativePath.includes("Articles/")) return "article";
-    if (relativePath.includes("AIChats/")) return "conversation";
-    if (relativePath.includes("Books/")) return "book-note";
-    if (relativePath.includes("templates/")) return "template";
-
-    return "note";
-  }
+  ): string {}
 }
 
killedBy: ObsidianUtils determineContentType should detect MOC content type
statusReason: expected undefined to be 'moc' // Object.is equality

[Killed] BlockStatement
src/lib/obsidian-models.ts:170:27
     frontmatter: Record<string, any>
   ): string {
     // Check frontmatter type first (prioritize explicit type)
-    if (frontmatter.type) {
-      return frontmatter.type;
-    }
+    if (frontmatter.type) {}
 
     const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
killedBy: ObsidianUtils determineContentType should use frontmatter type when available
statusReason: expected 'note' to be 'custom-type' // Object.is equality

[Killed] ConditionalExpression
src/lib/obsidian-models.ts:170:9
     frontmatter: Record<string, any>
   ): string {
     // Check frontmatter type first (prioritize explicit type)
-    if (frontmatter.type) {
+    if (true) {
       return frontmatter.type;
     }
killedBy: ObsidianUtils determineContentType should detect MOC content type
statusReason: expected undefined to be 'moc' // Object.is equality

[Killed] Regex
src/lib/obsidian-models.ts:174:66
       return frontmatter.type;
     }
 
-    const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
+    const relativePath = filePath.replace(vaultPath, "").replace(/\/+/, "");
 
     // Path-based classification
killedBy: ObsidianUtils determineContentType should handle vault path with trailing slash
statusReason: expected 'note' to be 'moc' // Object.is equality

[Survived] Regex
src/lib/obsidian-models.ts:174:66
       return frontmatter.type;
     }
 
-    const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
+    const relativePath = filePath.replace(vaultPath, "").replace(/^\//, "");
 
     // Path-based classification

[Killed] ArrayDeclaration
src/lib/obsidian-models.ts:699:53
 /**
  * Supported Obsidian content types
  */
-export const OBSIDIAN_CONTENT_TYPES = Object.freeze([
-  "note",
-  "moc",
-  "article",
-  "conversation",
-  "template",
-  "book-note",
-  "canvas",
-  "dataview",
-]);
+export const OBSIDIAN_CONTENT_TYPES = Object.freeze([]);
 
 export type ObsidianContentType = (typeof OBSIDIAN_CONTENT_TYPES)[number];
killedBy: OBSIDIAN_CONTENT_TYPES should contain all expected content types
statusReason: expected [] to deeply equal [ 'note', 'moc', 'article', …(5) ]
