[NoCoverage] ObjectLiteral
src/lib/processors/pdf-processor.ts:43:40
       const pdfData = await pdfParse(buffer);
 
       // Extract basic metadata
-      const pdfMetadata: PDFMetadata = {
-        title: pdfData.info?.Title,
-        author: pdfData.info?.Author,
-        subject: pdfData.info?.Subject,
-        creator: pdfData.info?.Creator,
-        producer: pdfData.info?.Producer,
-        creationDate: pdfData.info?.CreationDate
-          ? new Date(pdfData.info.CreationDate)
-          : undefined,
-        modificationDate: pdfData.info?.ModDate
-          ? new Date(pdfData.info.ModDate)
-          : undefined,
-      };
+      const pdfMetadata: PDFMetadata = {};
 
       // Get the extracted text

[NoCoverage] OptionalChaining
src/lib/processors/pdf-processor.ts:44:16
 
       // Extract basic metadata
       const pdfMetadata: PDFMetadata = {
-        title: pdfData.info?.Title,
+        title: pdfData.info.Title,
         author: pdfData.info?.Author,
         subject: pdfData.info?.Subject,

[NoCoverage] OptionalChaining
src/lib/processors/pdf-processor.ts:45:17
       // Extract basic metadata
       const pdfMetadata: PDFMetadata = {
         title: pdfData.info?.Title,
-        author: pdfData.info?.Author,
+        author: pdfData.info.Author,
         subject: pdfData.info?.Subject,
         creator: pdfData.info?.Creator,

[NoCoverage] OptionalChaining
src/lib/processors/pdf-processor.ts:46:18
       const pdfMetadata: PDFMetadata = {
         title: pdfData.info?.Title,
         author: pdfData.info?.Author,
-        subject: pdfData.info?.Subject,
+        subject: pdfData.info.Subject,
         creator: pdfData.info?.Creator,
         producer: pdfData.info?.Producer,

[NoCoverage] OptionalChaining
src/lib/processors/pdf-processor.ts:47:18
         title: pdfData.info?.Title,
         author: pdfData.info?.Author,
         subject: pdfData.info?.Subject,
-        creator: pdfData.info?.Creator,
+        creator: pdfData.info.Creator,
         producer: pdfData.info?.Producer,
         creationDate: pdfData.info?.CreationDate

[NoCoverage] OptionalChaining
src/lib/processors/pdf-processor.ts:48:19
         author: pdfData.info?.Author,
         subject: pdfData.info?.Subject,
         creator: pdfData.info?.Creator,
-        producer: pdfData.info?.Producer,
+        producer: pdfData.info.Producer,
         creationDate: pdfData.info?.CreationDate
           ? new Date(pdfData.info.CreationDate)

[NoCoverage] OptionalChaining
src/lib/processors/pdf-processor.ts:49:23
         subject: pdfData.info?.Subject,
         creator: pdfData.info?.Creator,
         producer: pdfData.info?.Producer,
-        creationDate: pdfData.info?.CreationDate
+        creationDate: pdfData.info.CreationDate
           ? new Date(pdfData.info.CreationDate)
           : undefined,

[NoCoverage] OptionalChaining
src/lib/processors/pdf-processor.ts:52:27
         creationDate: pdfData.info?.CreationDate
           ? new Date(pdfData.info.CreationDate)
           : undefined,
-        modificationDate: pdfData.info?.ModDate
+        modificationDate: pdfData.info.ModDate
           ? new Date(pdfData.info.ModDate)
           : undefined,

[NoCoverage] MethodExpression
src/lib/processors/pdf-processor.ts:58:20
       };
 
       // Get the extracted text
-      const text = pdfData.text.trim();
+      const text = pdfData.text;
 
       // Analyze text content

[NoCoverage] MethodExpression
src/lib/processors/pdf-processor.ts:61:21
       const text = pdfData.text.trim();
 
       // Analyze text content
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/);
       const hasText = text.length > 0 && words.length > 0;
 

[NoCoverage] EqualityOperator
src/lib/processors/pdf-processor.ts:61:56
       const text = pdfData.text.trim();
 
       // Analyze text content
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter((word) => word.length <= 0);
       const hasText = text.length > 0 && words.length > 0;
 

[NoCoverage] ConditionalExpression
src/lib/processors/pdf-processor.ts:62:23
 
       // Analyze text content
       const words = text.split(/\s+/).filter((word) => word.length > 0);
-      const hasText = text.length > 0 && words.length > 0;
+      const hasText = true && words.length > 0;
 
       // Create content metadata

[NoCoverage] BlockStatement
src/lib/processors/pdf-processor.ts:80:21
         text,
         metadata: contentMetadata,
       };
-    } catch (error) {
-      // Return basic metadata for corrupted or unreadable PDFs
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-      const contentMetadata: PDFContentMetadata = {
-        type: ContentType.PDF,
-        language: "unknown",
-        encoding: "unknown",
-        pageCount: 0,
-        wordCount: 0,
-        characterCount: 0,
-        hasText: false,
-      };
-
-      return {
-        text: `PDF Document: Unable to extract text. Error: ${errorMessage}`,
-        metadata: contentMetadata,
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/lib/processors/pdf-processor.ts:84:51
       // Return basic metadata for corrupted or unreadable PDFs
       const errorMessage =
         error instanceof Error ? error.message : String(error);
-      const contentMetadata: PDFContentMetadata = {
-        type: ContentType.PDF,
-        language: "unknown",
-        encoding: "unknown",
-        pageCount: 0,
-        wordCount: 0,
-        characterCount: 0,
-        hasText: false,
-      };
+      const contentMetadata: PDFContentMetadata = {};
 
       return {

[NoCoverage] BooleanLiteral
src/lib/processors/pdf-processor.ts:91:18
         pageCount: 0,
         wordCount: 0,
         characterCount: 0,
-        hasText: false,
+        hasText: true,
       };
 

[NoCoverage] ObjectLiteral
src/lib/processors/pdf-processor.ts:94:14
         hasText: false,
       };
 
-      return {
-        text: `PDF Document: Unable to extract text. Error: ${errorMessage}`,
-        metadata: contentMetadata,
-      };
+      return {};
     }
   }

[NoCoverage] ArrowFunction
src/lib/processors/pdf-processor.ts:131:46
       const text = pdfData.text.trim();
 
       // Analyze text content
-      const words = text.split(/\s+/).filter((word) => word.length > 0);
+      const words = text.split(/\s+/).filter(() => undefined);
       const hasText = text.length > 0 && words.length > 0;
 

[NoCoverage] EqualityOperator
src/lib/processors/pdf-processor.ts:132:42
 
       // Analyze text content
       const words = text.split(/\s+/).filter((word) => word.length > 0);
-      const hasText = text.length > 0 && words.length > 0;
+      const hasText = text.length > 0 && words.length >= 0;
 
       // Create content metadata

[NoCoverage] StringLiteral
src/lib/processors/pdf-processor.ts:156:19
         error instanceof Error ? error.message : String(error);
       const contentMetadata: PDFContentMetadata = {
         type: ContentType.PDF,
-        language: "unknown",
+        language: "",
         encoding: "unknown",
         pageCount: 0,

[NoCoverage] StringLiteral
src/lib/processors/pdf-processor.ts:165:15
       };
 
       return {
-        text: `PDF Document: Unable to extract text. Error: ${errorMessage}`,
+        text: ``,
         metadata: contentMetadata,
       };

[NoCoverage] BlockStatement
src/lib/processors/pdf-processor.ts:175:48
    * Simple language detection based on common patterns
    * In production, use a proper language detection library
    */
-  private detectLanguage(text: string): string {
-    // Simple heuristics for language detection
-    const englishWords = /\b(the|and|or|but|in|on|at|to|for|of|with|by)\b/gi;
-    const spanishWords =
-      /\b(el|la|los|las|y|o|pero|en|sobre|a|para|de|con|por)\b/gi;
-    const frenchWords =
-      /\b(le|la|les|et|ou|mais|dans|sur|à|pour|de|avec|par)\b/gi;
-
-    const englishMatches = (text.match(englishWords) || []).length;
-    const spanishMatches = (text.match(spanishWords) || []).length;
-    const frenchMatches = (text.match(frenchWords) || []).length;
-
-    const maxMatches = Math.max(englishMatches, spanishMatches, frenchMatches);
-
-    if (maxMatches === 0) return "unknown";
-    if (maxMatches === englishMatches) return "en";
-    if (maxMatches === spanishMatches) return "es";
-    if (maxMatches === frenchMatches) return "fr";
-
-    return "unknown";
-  }
+  private detectLanguage(text: string): string {}
 
   /**

[NoCoverage] ConditionalExpression
src/lib/processors/pdf-processor.ts:191:9
 
     if (maxMatches === 0) return "unknown";
     if (maxMatches === englishMatches) return "en";
-    if (maxMatches === spanishMatches) return "es";
+    if (true) return "es";
     if (maxMatches === frenchMatches) return "fr";
 

[NoCoverage] BlockStatement
src/lib/processors/pdf-processor.ts:200:39
   /**
    * Check if a file is likely a readable PDF
    */
-  isValidPDF(buffer: Buffer): boolean {
-    // Check PDF signature
-    const signature = buffer.subarray(0, 8);
-    const pdfSignature = Buffer.from("%PDF-");
-
-    return signature.subarray(0, 5).equals(pdfSignature);
-  }
+  isValidPDF(buffer: Buffer): boolean {}
 }
 

[NoCoverage] StringLiteral
src/lib/processors/pdf-processor.ts:203:38
   isValidPDF(buffer: Buffer): boolean {
     // Check PDF signature
     const signature = buffer.subarray(0, 8);
-    const pdfSignature = Buffer.from("%PDF-");
+    const pdfSignature = Buffer.from("");
 
     return signature.subarray(0, 5).equals(pdfSignature);
