[Killed] BlockStatement
src/lib/utils.ts:7:49
  * Normalize text for consistent embedding and caching
  * Following the best practices from the instructions
  */
-export function normalize(text: string): string {
-  return text
-    .normalize("NFC")
-    .replace(/\r\n?/g, "\n")
-    .replace(/[ \t]+/g, " ")
-    .replace(/\u200B|\u200C|\u200D|\uFEFF/g, "") // zero-widths
-    .trim();
-}
+export function normalize(text: string): string {}
 
 /**
killedBy: normalize should normalize basic text
statusReason: expected undefined to be 'Hello World' // Object.is equality

[Killed] MethodExpression
src/lib/utils.ts:8:10
  * Following the best practices from the instructions
  */
 export function normalize(text: string): string {
-  return text
-    .normalize("NFC")
-    .replace(/\r\n?/g, "\n")
-    .replace(/[ \t]+/g, " ")
-    .replace(/\u200B|\u200C|\u200D|\uFEFF/g, "") // zero-widths
-    .trim();
+  return text.normalize("NFC").replace(/\r\n?/g, "\n").replace(/[ \t]+/g, " ").replace(/\u200B|\u200C|\u200D|\uFEFF/g, "") // zero-widths;
 }
 
killedBy: normalize should normalize basic text
statusReason: expected ' Hello World ' to be 'Hello World' // Object.is equality

[Killed] Regex
src/lib/utils.ts:11:14
   return text
     .normalize("NFC")
     .replace(/\r\n?/g, "\n")
-    .replace(/[ \t]+/g, " ")
+    .replace(/[^ \t]+/g, " ")
     .replace(/\u200B|\u200C|\u200D|\uFEFF/g, "") // zero-widths
     .trim();
killedBy: ObsidianEmbeddingService embedBatch should process batch successfully
statusReason: expected "spy" to be called 3 times, but got 2 times

[Killed] StringLiteral
src/lib/utils.ts:21:28
  */
 export function createContentHash(text: string): string {
   const normalized = normalize(text);
-  return crypto.createHash("sha256").update(normalized).digest("hex");
+  return crypto.createHash("").update(normalized).digest("hex");
 }
 
killedBy: createContentHash should create consistent hashes for same content
statusReason: Digest method not supported

[Killed] ArithmeticOperator
src/lib/utils.ts:28:52
  * L2 normalize a vector (ensures cosine similarity is in [-1, 1] range)
  */
 export function normalizeVector(vector: number[]): number[] {
-  const norm = Math.sqrt(vector.reduce((sum, x) => sum + x * x, 0));
+  const norm = Math.sqrt(vector.reduce((sum, x) => sum - x * x, 0));
   if (norm === 0) return vector; // Avoid division by zero for zero vectors
   return vector.map((x) => x / norm);
killedBy: normalizeVector should normalize a vector to unit length
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 5e-11

[Killed] ConditionalExpression
src/lib/utils.ts:37:7
  * Calculate cosine similarity between two normalized vectors
  */
 export function cosineSimilarity(vecA: number[], vecB: number[]): number {
-  if (vecA.length !== vecB.length) {
+  if (false) {
     throw new Error("Vectors must have the same dimension");
   }
killedBy: cosineSimilarity should reject vectors of different dimensions
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/utils.ts:45:19
   let normA = 0;
   let normB = 0;
 
-  for (let i = 0; i < vecA.length; i++) {
+  for (let i = 0; false; i++) {
     dotProduct += vecA[i] * vecB[i];
     normA += vecA[i] * vecA[i];
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected +0 to be close to 1, received difference is 1, but expected 5e-11

[Killed] EqualityOperator
src/lib/utils.ts:54:7
   normA = Math.sqrt(normA);
   normB = Math.sqrt(normB);
 
-  if (normA === 0 || normB === 0) return 0;
+  if (normA !== 0 || normB === 0) return 0;
 
   return dotProduct / (normA * normB);
killedBy: cosineSimilarity should calculate similarity between identical vectors
statusReason: expected +0 to be close to 1, received difference is 1, but expected 5e-11

[Survived] Regex
src/lib/utils.ts:63:31
  * Estimate token count (crude approximation: words/0.75)
  */
 export function estimateTokens(text: string): number {
-  return Math.ceil(text.split(/\s+/).length / 0.75);
+  return Math.ceil(text.split(/\s/).length / 0.75);
 }
 

[Killed] Regex
src/lib/utils.ts:77:25
  * Extract Obsidian wikilinks from text
  */
 export function extractWikilinks(text: string): string[] {
-  const wikilinkRegex = /\[\[([^\]]+)\]\]/g;
+  const wikilinkRegex = /\[\[([\]]+)\]\]/g;
   const wikilinks: string[] = [];
   let match;
killedBy: extractWikilinks should extract wikilinks from text
statusReason: expected [] to deeply equal [ 'link', 'link2' ]

[Killed] ConditionalExpression
src/lib/utils.ts:80:10
   const wikilinkRegex = /\[\[([^\]]+)\]\]/g;
   const wikilinks: string[] = [];
   let match;
-  while ((match = wikilinkRegex.exec(text)) !== null) {
+  while (false) {
     wikilinks.push(match[1]);
   }
killedBy: extractWikilinks should extract wikilinks from text
statusReason: expected [] to deeply equal [ 'link', 'link2' ]

[Killed] ConditionalExpression
src/lib/utils.ts:93:10
   const tagRegex = /#([a-zA-Z0-9_/-]+)/g;
   const tags: string[] = [];
   let match;
-  while ((match = tagRegex.exec(text)) !== null) {
+  while (false) {
     tags.push(match[1]);
   }
killedBy: extractHashtags should extract hashtags from text
statusReason: expected [] to deeply equal [ 'tag', 'tag2' ]

[Killed] Regex
src/lib/utils.ts:106:16
   return (
     text
       // Remove frontmatter
-      .replace(/^---[\s\S]*?---\n?/, "")
+      .replace(/^---[\s\S]---\n?/, "")
       // Remove wikilinks but keep the text
       .replace(/\[\[([^\]]+)\]\]/g, "$1")
killedBy: cleanMarkdown should remove frontmatter
statusReason: expected '---\ntitle: Test\n---\nThis is content' to be 'This is content' // Object.is equality

[Killed] StringLiteral
src/lib/utils.ts:106:38
   return (
     text
       // Remove frontmatter
-      .replace(/^---[\s\S]*?---\n?/, "")
+      .replace(/^---[\s\S]*?---\n?/, "Stryker was here!")
       // Remove wikilinks but keep the text
       .replace(/\[\[([^\]]+)\]\]/g, "$1")
killedBy: cleanMarkdown should remove frontmatter
statusReason: expected 'Stryker was here!This is content' to be 'This is content' // Object.is equality

[Killed] StringLiteral
src/lib/utils.ts:108:37
       // Remove frontmatter
       .replace(/^---[\s\S]*?---\n?/, "")
       // Remove wikilinks but keep the text
-      .replace(/\[\[([^\]]+)\]\]/g, "$1")
+      .replace(/\[\[([^\]]+)\]\]/g, "")
       // Remove markdown links but keep the text
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
killedBy: cleanMarkdown should remove wikilinks but keep text
statusReason: expected 'This is a  in text' to be 'This is a link in text' // Object.is equality

[Killed] Regex
src/lib/utils.ts:110:16
       // Remove wikilinks but keep the text
       .replace(/\[\[([^\]]+)\]\]/g, "$1")
       // Remove markdown links but keep the text
-      .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
+      .replace(/\[([^\]])\]\([^)]+\)/g, "$1")
       // Remove markdown formatting
       .replace(/[*_`~]/g, "")
killedBy: cleanMarkdown should remove markdown links but keep text
statusReason: expected 'This is a [link](url) in text' to be 'This is a link in text' // Object.is equality

[Killed] Regex
src/lib/utils.ts:110:16
       // Remove wikilinks but keep the text
       .replace(/\[\[([^\]]+)\]\]/g, "$1")
       // Remove markdown links but keep the text
-      .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
+      .replace(/\[([^\]]+)\]\([^)]\)/g, "$1")
       // Remove markdown formatting
       .replace(/[*_`~]/g, "")
killedBy: cleanMarkdown should remove markdown links but keep text
statusReason: expected 'This is a [link](url) in text' to be 'This is a link in text' // Object.is equality

[Killed] Regex
src/lib/utils.ts:112:16
       // Remove markdown links but keep the text
       .replace(/\[([^\]]+)\]\([^)]+\)/g, "$1")
       // Remove markdown formatting
-      .replace(/[*_`~]/g, "")
+      .replace(/[^*_`~]/g, "")
       // Remove headers
       .replace(/^#+\s+/gm, "")
killedBy: cleanMarkdown should remove frontmatter
statusReason: expected '' to be 'This is content' // Object.is equality

[Killed] StringLiteral
src/lib/utils.ts:116:28
       // Remove headers
       .replace(/^#+\s+/gm, "")
       // Clean up extra whitespace
-      .replace(/\n\s*\n/g, "\n\n")
+      .replace(/\n\s*\n/g, "")
       .trim()
   );
killedBy: cleanMarkdown should clean up extra whitespace
statusReason: expected 'Line 1Line 2' to be 'Line 1\n\nLine 2' // Object.is equality

[Survived] Regex
src/lib/utils.ts:116:16
       // Remove headers
       .replace(/^#+\s+/gm, "")
       // Clean up extra whitespace
-      .replace(/\n\s*\n/g, "\n\n")
+      .replace(/\n\s\n/g, "\n\n")
       .trim()
   );

[Killed] StringLiteral
src/lib/utils.ts:129:40
   vaultPath: string
 ): string[] {
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
-  const pathParts = relativePath.split("/");
+  const pathParts = relativePath.split("");
   pathParts.pop(); // Remove filename
   return pathParts.length > 0 ? pathParts : ["Root"];
killedBy: generateBreadcrumbs should generate breadcrumbs from file path
statusReason: expected [ 'f', 'o', 'l', 'd', 'e', 'r', …(7) ] to deeply equal [ 'folder' ]

[Killed] ConditionalExpression
src/lib/utils.ts:131:10
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
   const pathParts = relativePath.split("/");
   pathParts.pop(); // Remove filename
-  return pathParts.length > 0 ? pathParts : ["Root"];
+  return true ? pathParts : ["Root"];
 }
 
killedBy: generateBreadcrumbs should handle root level files
statusReason: expected [] to deeply equal [ 'Root' ]

[Killed] EqualityOperator
src/lib/utils.ts:131:10
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
   const pathParts = relativePath.split("/");
   pathParts.pop(); // Remove filename
-  return pathParts.length > 0 ? pathParts : ["Root"];
+  return pathParts.length >= 0 ? pathParts : ["Root"];
 }
 
killedBy: generateBreadcrumbs should handle root level files
statusReason: expected [] to deeply equal [ 'Root' ]

[Killed] ConditionalExpression
src/lib/utils.ts:144:7
 ): string {
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
 
-  if (relativePath.startsWith("MOCs/")) return "moc";
+  if (true) return "moc";
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
killedBy: determineContentType should detect article content type
statusReason: expected 'moc' to be 'article' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils.ts:145:7
   const relativePath = filePath.replace(vaultPath, "").replace(/^\/+/, "");
 
   if (relativePath.startsWith("MOCs/")) return "moc";
-  if (relativePath.startsWith("Articles/")) return "article";
+  if (true) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
   if (relativePath.startsWith("Books/")) return "book-note";
killedBy: determineContentType should detect conversation content type
statusReason: expected 'article' to be 'conversation' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils.ts:147:7
   if (relativePath.startsWith("MOCs/")) return "moc";
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
-  if (relativePath.startsWith("Books/")) return "book-note";
+  if (false) return "book-note";
   if (relativePath.startsWith("templates/")) return "template";
 
killedBy: determineContentType should detect book-note content type
statusReason: expected 'note' to be 'book-note' // Object.is equality

[Killed] ConditionalExpression
src/lib/utils.ts:148:7
   if (relativePath.startsWith("Articles/")) return "article";
   if (relativePath.startsWith("AIChats/")) return "conversation";
   if (relativePath.startsWith("Books/")) return "book-note";
-  if (relativePath.startsWith("templates/")) return "template";
+  if (true) return "template";
 
   // Check frontmatter type
killedBy: determineContentType should use frontmatter type if available
statusReason: expected 'template' to be 'custom' // Object.is equality
